package com.hijamaplanet.drawer.fragment;

import android.graphics.Color;
import android.graphics.Typeface;
import android.os.Bundle;
import android.support.annotation.NonNull;
import android.support.annotation.Nullable;
import android.support.v4.app.Fragment;
import android.support.v4.app.FragmentActivity;
import android.support.v4.view.ViewCompat;
import android.support.v7.app.AppCompatActivity;
import android.support.v7.widget.Toolbar;
import android.text.Html;
import android.text.method.LinkMovementMethod;
import android.view.Gravity;
import android.view.KeyEvent;
import android.view.LayoutInflater;
import android.view.MenuItem;
import android.view.View;
import android.view.ViewGroup;
import android.widget.Button;
import android.widget.ImageView;
import android.widget.LinearLayout;
import android.widget.TextView;

import com.bumptech.glide.Glide;
import com.hijamaplanet.MainActivity;
import com.hijamaplanet.R;
import com.hijamaplanet.admin.activity.AdminView;
import com.hijamaplanet.admin.activity.MasterAdminView;
import com.hijamaplanet.user.UserView;

public class HijamaExtension extends Fragment {

    private LinearLayout linearLayout;
    private int identifier;
    public static final String TAG = HijamaExtension.class.getSimpleName();
    private Fragment fragment;
    private String activityName;

    @Override
    public void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setHasOptionsMenu(true);
    }

    @Nullable
    @Override
    public View onCreateView(LayoutInflater inflater, @Nullable ViewGroup container, Bundle savedInstanceState) {
        //return super.onCreateView(inflater, container, savedInstanceState);
        return inflater.inflate(R.layout.nav_hijama_extension, container, false);
    }

    @Override
    public void onViewCreated(@NonNull View view, @Nullable Bundle savedInstanceState) {
        super.onViewCreated(view, savedInstanceState);

        activityName = getActivity().getClass().getSimpleName();

        Toolbar toolbar = view.findViewById(R.id.toolbar);
        ((AppCompatActivity) getActivity()).setSupportActionBar(toolbar);

        ((AppCompatActivity) getActivity()).getSupportActionBar().setDisplayHomeAsUpEnabled(true);
        ((AppCompatActivity) getActivity()).getSupportActionBar().setHomeButtonEnabled(true);
        ((AppCompatActivity) getActivity()).getSupportActionBar().setHomeAsUpIndicator(R.drawable.drawer_icon_small);

        linearLayout = view.findViewById(R.id.root_layout);

        Bundle bundle = this.getArguments();
        if (bundle != null) {
            identifier = bundle.getInt("identifier");
        }

        if (identifier == 0) {
            toolbar.setTitle("হিজামা কি ও কিভাবে করা হয়?");

            linearLayout.addView(textHeader("হিজামা কি?"));
            linearLayout.addView(textField("হিজামা শব্দটি আরবি হাজামা বা হাজ্জামা ক্রিয়া থেকে এসেছে যার অর্থ হচ্ছে কমিয়ে ফেলা, আসল আকারে ফিরিয়ে নেয়া, বা আকারে ছোট করে ফেলা ইত্যাদি।\n\n" +
                    "আরবিতে তারা বলে যে এক লোক সমস্যাটা ছোট করে ফেলেছে- এর অর্থ হচ্ছে “সে সমস্যাটা আগে অবস্থায় ফিরিয়ে নিয়ে গেছে।”\n\n" +
                    "আরও একটা ভার্ব বা ক্রিয়া আছে “আহজামা” যার মানে যুদ্ধক্ষেত্র থেকে পিছিয়ে আসা বা অস্ত্র সংবরণ করা। \n\n" +
                    "তার মানে, যে হিজামা করে (অর্থাৎ হাজ্জাম) সে রোগকে বাধা দেয় বা সংবরণ করে রোগীকে আক্রান্ত করা থেকে। \n\n" +
                    "আমাদের শরীরে প্রতিনিয়ত মেটাবলিক বাই-প্রোডাক্ট তৈরি হচ্ছে। রোগ-জীবাণুর আক্রমণে বা ব্যাবহার এর কারণে বিভিন্ন রক্তকণিকা ও টিস্যুর ক্ষতিসাধন হচ্ছে। মানুষের বয়স যত বাড়তে থাকে মানুষের শরীরের বিভিন্ন স্থানে মাসল ও টিস্যুর মধ্যে এই মেটাবলিক বাই প্রোডাক্ট ট্র্যাপ হচ্ছে। এর  একটি উৎকৃষ্ট উদাহরণ হচ্ছে আমরা যদি জোরে হাটতে বা দৌড়াতে থাকি তবে কিছুক্ষণের মধ্যেই আমাদের পায়ে ব্যাথা শুরু হয়ে যায়। এর কারন হচ্ছে মেটাবলিক বাইপ্রোডাক্ট আমাদের মাসলে জমা হয়ে নার্ভ এন্ডিং গুলোর পেইন রিসেপ্টরে স্টিমুলেশান দেয়। আবার কিছুক্ষণ রেস্ট নিলে এই পেইন কমে যায়, কারন বাই প্রোডাক্টগুলোকে ব্লাড ফলো করে ডাইলিউট করে দেয় এবং কিডনি বা লিভার বা \n" +
                    "ঘর্মগ্রন্থি তাদের নিজস্ব প্রক্রিয়ার মাধ্যমে এগুলোকে পুনরায় ব্যাবহার্য্য করে বা শরীর থেকে বের করে দেয়।\n\n" +
                    "আমাদের শরীরে ছোট ছোট রক্তনালী (ক্যাপিলারি ও ভেনিউলস) ও নার্ভ (নিউরন) জালিকার মত বিছিয়ে রয়েছে। বিভিন্ন জীবাণুর আক্রমণে বা বিভিন্ন শরীরবৃত্ত্বীয় প্রকৃয়ায় আমাদের রক্তকণিকা ক্ষতিগ্রস্থ হয়। এগুলো অনেক ক্ষেত্রেই এইসব ছোট ছোট রক্তনালীতে ট্র্যাপ হয়ে পড়ে এবং রক্ত প্রবাহে বাঁধার সৃষ্টি করে।\n"));

            linearLayout.addView(textHeader("হিজামা কিভাবে করা হয়?"));
            linearLayout.addView(textField("প্রথমে যার ওপর হিজামা প্রয়োগ করা হবে, তার রোগের বর্ণনা শুনে শরীরের বিভিন্ন পয়েন্টে হিজামা করার স্থান নির্বাচন করা হয়।\n"));
            linearLayout.addView(imageField(R.drawable.hijama_ki1));
            linearLayout.addView(imageText("হিজামার বেসিক পয়েন্টস ম্যাপিং"));
            linearLayout.addView(textField("হিজামা থেরাপিস্টদের সুবিধার্থে। হিজামার পয়েন্ট গুলোর প্রপার এ্যানাটমিকাল পজিশানিং নিচে দেয়া হল।"));
            linearLayout.addView(imageField(R.drawable.hijama_ki2));
            linearLayout.addView(imageText("মাথা ও ঘাড়ের হিজামা পয়েন্টগুলোর এ্যানাটমিক্যাল পজিশনিং"));
            linearLayout.addView(imageField(R.drawable.hijama_ki3));
            linearLayout.addView(imageField(R.drawable.hijama_ki4));
            linearLayout.addView(imageField(R.drawable.hijama_ki5));
            linearLayout.addView(textField("এরপর পেশেন্টের চামড়ার ঐ স্থান গুলো ডিসইনফেক্ট করে কাপ বসানো হয়। কাপ বসানোর পূর্বে তেল লাগিয়ে নিলে স্কিনে স্ট্রেস কম পড়বে। ডিসপোজেবল কাপ ব্যাবহার করা বাধ্যতামূলক। অথবা গ্লাস, সিরামিক বা মেটালিক কাপ স্টেরিলাইজ করে ব্যাবহার করতে পারেন।"));
            linearLayout.addView(imageField(R.drawable.hijama_ki6));
            linearLayout.addView(textField("কাপ লাগানর সাথে সাথে নেগেটিভ প্রেশারের কারণে কাপের নিম্নস্থিত টিস্যু ফুলে ওঠে। এখানে হাইপারমিয়া হয়, অর্থাৎ এখানের রক্তনালীগুলো সম্প্রসারিত হয়ে ওঠে ফলে আশপাশ থেকে রক্ত কাপের নিচে এসে জমা হয়।"));
            linearLayout.addView(imageField(R.drawable.hijama_ki7));
            linearLayout.addView(textField("কয়েক মিনিট এভাবে অপেক্ষা করার পরে কাপ খুলে ফেলা হয়। তারপর স্টেরাইল (জীবাণুমুক্ত) ও ধারাল ব্লেড দিয়ে ছোট ছোট আচড় দেয়া হয়। এই সুক্ষ্ম আচড়ের ফলে রক্ত বের হবে না, রক্তের হালকা বিন্দু দেখা যেতে পারে।"));
            linearLayout.addView(imageField(R.drawable.hijama_ki8));
            linearLayout.addView(textField("অনেকে সুঁই দিয়ে হিজামা করতে পছন্দ করেন। কিন্তু সুঁই দিয়ে ব্যাথা বেশি পাওয়া যায়, ভাল ভাবে রক্ত বের হয় না, আর নাইট্রিক অক্সাইড রিলিজের পরিমাণও কম হয়।"));
            linearLayout.addView(imageField(R.drawable.hijama_ki9));
            linearLayout.addView(textField("এরপর কাপ বসিয়ে ভ্যাকিউয়াম করা হলে রক্ত বের হওয়া শুরু হয়। প্রায় ১০ থেকে ১৫ মিনিট রক্ত বের হয়।"));
            linearLayout.addView(imageField(R.drawable.hijama_ki10));
            linearLayout.addView(textField("রক্ত বের হওয়ার পরিমাণ এক এক পেশেন্টের ক্ষেত্রে এক এক শারীরিক কন্ডিশানে এক এক রকম হতে পারে। অনেক ক্ষেত্রে দেখা যায় কারও কয়েক ফোটা বের হয়েছে, আবার কারও কাপ ভরে গেছে। রক্ত বেশি বের হলে যে হিজামার ইফেক্ট বেশি পাওয়া যাবে তা কিন্তু নয়। হাদিসে এসেছে হিজামা কাটার মধ্যে শেফা।"));
            linearLayout.addView(imageField(R.drawable.hijama_ki11));
            linearLayout.addView(textField("স্ক্র্যাচ করার পর প্রথমবার কাপ বসিয়ে ১৫ থেকে ২০ মিনিট অপেক্ষা করে কাপ খুলে রক্ত মুছে ফেলতে হবে। "));
            linearLayout.addView(imageField(R.drawable.hijama_ki12));
            linearLayout.addView(textField("এরপর আবার কাপ বসিয়ে পরীক্ষা করতে হবে যে রক্ত আর বের হয় কিনা। যতক্ষণ রক্ত বের হবে ততক্ষণ কাপ বসিয়ে রাখতে হবে।"));
            linearLayout.addView(imageField(R.drawable.hijama_ki13));
            linearLayout.addView(textField("রক্ত বের হওয়া বন্ধ হলে রক্তরস (Serum) বের হবে যা দেখতে সাদাটে বা হলদাভ পানির মত।"));
            linearLayout.addView(imageField(R.drawable.hijama_ki14));
            linearLayout.addView(textField("অভিজ্ঞ হিজামা থেরাপিস্ট এর আচড় কা কাটা হবে খুবই সূক্ষ্ম। পেশেন্ট প্রায় কোন ব্যাথাই পাবে না। একটু কড়া সুড়সুড়ির মত অনুভূতি হবে শুধু।"));
            linearLayout.addView(imageField(R.drawable.hijama_ki15));
            linearLayout.addView(textField("আর এই হিজামার আচর ২৪ ঘণ্টার মধ্যে হিলিং হয়ে যাবে। দুই দিনের মধ্যে অনেকটা নিচের ছবির মত দেখাবে।"));
            linearLayout.addView(imageField(R.drawable.hijama_ki16));
            linearLayout.addView(textField("হিজামাকে খুব সহজ মনে করে আনপ্রফেশনাল লোকদের দ্বারা হিজামা করাবেন না, এতে করে ক্ষতি হতে পারে। নীচের ছবির মত হিজামার কাটের কারণে ইনফেকশান হতে পারে ও, পারমানেন্ট স্কার মার্ক থেকে যেতে পারে। "));
            linearLayout.addView(imageField(R.drawable.hijama_ki17));
            linearLayout.addView(textField("এছাড়াও তৈরি হতে পারে ব্লিস্টার, যা আপনাকে অনেকদিন ভোগাবে।"));
            linearLayout.addView(imageField(R.drawable.hijama_ki18));
            linearLayout.addView(textField("হিজামা করার জন্য ডাক্তার হওয়ার প্রয়োজন নেই। ঠিক যেমন ফিজিওথেরাপি সেবা দেয়ার জন্য ফিজিওথেরাপিস্ট হলেই চলে ডাক্তার হওয়ার প্রয়োজন নেই। কিন্তু এর মানে এই নয় যে, যে কেউ হিজামা করতে পারবে। ডাক্তাররা আরও অনেক জটিল ধরনের কাজ করেন। তবে ডাক্তাররা হিজামা শিখলে ইফেক্টিভভাবে ট্রিটমেন্ট প্ল্যান তৈরি করতে পারবেন, যা অন্যরা পারবে না।"));
        } else if (identifier == 1) {
            toolbar.setTitle("হিজামার ইতিহাস");

            linearLayout.addView(textField("হিজামা (কাপিং থেরাপী) একটি সহজ, নিরাপদ এবং একই সময়ে খুবই কার্যকারী চিকিৎসা ব্যবস্থা। এটি মূল চিকিৎসা ব্যস্থার সাথে একটি অল্টারনেটিভ থেরাপী হিসেবে হাজার বছর ধরে চর্চা হয়ে আসছে। প্রাচীন মিশরীয় এবং চাইনিজ চিকিৎসকদের আদি লিপি হতে এর নিশ্চিত প্রমাণ পাওয়া যায়।"));
            linearLayout.addView(imageField(R.drawable.hijama_his1));
            linearLayout.addView(textField("বিংশ শতাব্দীতে হিজামা একটি সহজ এবং কার্যকারী অল্টারনেটিভ চিকিৎসা ব্যবস্থা হিসেব গতানুগতিক চিকিৎসা বিজ্ঞানে যোগ হয়েছে।\n" +
                    "পূর্ব থেকে পশ্চিম এবং উত্তর থেকে দক্ষিণ, অনেক সভ্যতা হিজামা চর্চা করে আসছে একটি \"ঘরোয়া চিকিৎসা ব্যবস্থা\" হিসেবে। প্রাক যুগে গবাদী পশুর শিং দিয়ে হিজামা করা হতো। এটাকে তাই \"Horn Therapy\" ও বলা হতো। এরপর ধারাবাহিকভাবে আসে বাঁশ, গ্লাস, প্লাস্টিক ইত্যাদি।"));
            linearLayout.addView(textHeader("\nচীনা ইতিহাস "));
            linearLayout.addView(textField("চীনে হিজামা \"কাপিং থেরাপী\" নামে সুপরিচিত।\n" +
                    "প্রাচীন চাইনিজ রেকর্ড অনুযায়ী প্রাচীন \"বশু\" যা আবিষ্কৃত হয় হান ডাইনাস্টির প্রাচীন স্তম্ভ হতে ১৯৭৩ সালে যেখানে কাপিং এর কথা পাওয়া যায়।"));
            linearLayout.addView(imageField(R.drawable.hijama_his2));
            linearLayout.addView(textField("এছাড়া ২৮ খ্রিস্টাব্দতে \"জো হো ফাং\" বই এ এবং ৭৫৫ খ্রিস্টাব্দে \"উইতাইমিয়াও\" তে যক্ষ্মা চিকিৎসায় কাপিং এর তথ্য পাওয়া যায়। এরপর তিনশত বছর পর আরেকটি প্রাচীন বই \"সুসেন লিয়াং ফাং\" এ পাওয়া যায় কাপিং দ্বারা কার্যকারীভাবে দীর্ঘমেয়াদী কাশি এবং বিষাক্ত সাপের কামড়ের সফল চিকিৎসার তথ্য। প্রায় ৫০০ বছর আগে, উইকেযেন জং নামে একজন বিখ্যাত চিকিৎসক হিজামাকে সার্জিকাল প্রাক্টিসের অন্তর্ভুক্ত করেন।"));
            linearLayout.addView(textField("চীনা সমাজে কাপিং চিকিৎসার আধিপত্যের দরুন, আধুনিক চাইনিজ চিকিৎসা বিজ্ঞানেও হিজামা নিজের স্বতন্ত্র স্থান করে নিয়েছে বর্তমানে। ১৯৫০ সালে হিজামার উপকারীতা এবং কার্যাকারীতা রিসার্চ দ্বারা প্রমাণিত হয় এবং কাপিং থেরাপী নামে অফিসিয়াল থেরাপী হিসেবে চায়নার সব হাসপাতালে যুক্ত হয় \"হিজামা\"।\n\n" +
                    "চীনা একটি প্রবাদ বাক্য - \" আকুপাংচার এবং কাপিং, অর্ধেকেরও বেশী রোগ নিরাময় করে\"।"));
            linearLayout.addView(imageField(R.drawable.hijama_his3));
            linearLayout.addView(textHeader("\nপশ্চিমা বিশ্ব এবং মধ্যপ্রাচ্যে হিজামা"));
            linearLayout.addView(textField("-লন্ডনের হিজামা বিশেষজ্ঞ স্যামুয়েল বেফিল্ড ১৮২৩  খ্রিস্টাব্দে বলেছেন, \"হিজামা একটি শিল্প\"। \n" +
                    "-হাজার বছর ধরে চিকিৎসা বিজ্ঞানের লেখকরা হিজামাকে দুই ভাগে ভাগ করেছেন- শুষ্ক (Dry Cupping) এবং আদ্র (Wet Cupping)। ড্রাই কাপিং এ শরীর থেকে কোনো রক্ত বের করা হয় না। পক্ষান্তরে, ওয়েট কাপিং শুরু করা হয় শুষ্ক কাপিং দিয়ে, এরপর ধারাবাহিকতায় কাটার ফলে রক্ত বের হয়।"));
            linearLayout.addView(imageField(R.drawable.hijama_his4));
            linearLayout.addView(textField("-মিশরের প্রধান রাবী, রাবী মশে বিন মাসুন, তার বইয়ে হিজামার কথা বলেছিলেন।"));
            linearLayout.addView(textHeader("\nমুসলিম বিশ্বে হিজামা"));
            linearLayout.addView(textField("-প্রাগৈতিহাসিক যুগ ধরেই মুসলিমরা হিজামা চর্চা করে আসছে। চীনা সমাজে যা কাপিং নামে পরিচিত তা মুসলমানদের মধ্যে \"হিজামা\" নামে প্রসিদ্ধ।\n" +
                    "-সর্বশেষ নবী এবং রাসূল হযরত মুহাম্মাদ (সল্লাল্লহু আলাইহি ওয়া সাল্লাম) নিয়মিত হিজামা করাতেন এবং অন্যদেরও উৎসাহ দিতেন। হিজামা নিয়ে রয়েছে সহস্রাধিক হাদিস। "));
            linearLayout.addView(imageField(R.drawable.hijama_his5));
            linearLayout.addView(textField("-দামেস্কের লেখক ইমাম ইবনে কাইয়ুম আল জাজিয়া এর লিখিত বই “Healing with Medicine of Prophet” এ এসেছে হিজামা তে রয়েছে বহু রোগের শেফা।"));
        } /*else if (identifier == 2) {
            toolbar.setTitle("হিজামার কিভাবে করতে হবে?");

            linearLayout.addView(textHeader("স্বাভাবিক অবস্থায় যেভাবে করবে।"));
            linearLayout.addView(textField("ক. আরবী মাসের ১৭, ১৯ ও ২১ তারিখের কোন একটি নির্বাচন করবে।\n" +
                    "খ. সোম, মঙ্গল ও বৃহস্পতিবারের কোনটিকে নির্বাচন করবে।\n" +
                    "উল্লেখ্য, তারিখ ও দিনের মধ্যে বিরোধ হলে তারিখকে অগ্রাধিকার দিবে।\n" +
                    "গ. খালি পেটেই হিজামা করবে। সকালে খালি পেটে হিজামা করা উত্তম। \n" +
                    "ঘ. ফজরের পর হতে দুপুর ১২টার মধ্যে করবে।\n" +
                    "ঙ. হিজামার আগের ও পরের দিন সঙ্গম না করা উত্তম।\n"));
            linearLayout.addView(textHeader("জরুরী অবস্থায় যেভাবে করবে।"));
            linearLayout.addView(textField("এতে মাস ও দিনের কোনো ধর্তব্য নেই। যখনই সমস্যা তখনই করা যেতে পারে। একসময় রসূলুল্লাহ (ছল্লাল্লাহু আলাইহি ওয়াসাল্লাম) ঘোড়া থেকে পড়ে পায়ে আঘাত পাওয়ায় হিজামা করেছিলেন।\n"));
            linearLayout.addView(textHeader("হিজামার নির্দিষ্ট স্থানসমূহ"));
            linearLayout.addView(textField("১. মাথার উপরিভাগ তথা মধ্যভাগ।\n" +
                    "২. মাথার ঠিক মাঝখানে। \n" +
                    "৩. ঘাড়ের উভয় পাশে। \n" +
                    "৪. ঘাড়ের নীচে উভয় কাঁধের মাঝখানে।\n" +
                    "৫. উভয় পায়ের উপরিভাগে।\n" +
                    "৬. মাথার নীচে চুলের ঝুটির স্থলে।\n"));


        } /*else if (identifier == 3){
            toolbar.setTitle("হিজামার উপকারিতা");

            linearLayout.addView(textField("হাদিসে আছে, হজরত রাসূলুল্লাহ (সা.) হিজামা করেছেন মাথাব্যথার প্রতিষেধক হিসেবে।\n" +
                    "পিঠের ব্যথার জন্য দুই কাঁধের মাঝে ও ঘাড়ের দু’টি রগে। হিজামার উপকারিতা সম্পর্কে সিহাহ সিত্তার গ্রন্থসমূহে বহু হাদিস রয়েছে।\n" +
                    "আপনার রোগ হলে যেমন ডাক্তারের কাছে যান। তারপর প্রয়োজন পড়লে অস্ত্রপোচারও করান।\n" +
                    "তেমনি আপনার রোগের জন্য হিজামা করাবেন। তাহলে ফায়দা স্বরূপ রোগ থেকে ইনশাআল্লাহ মুক্তি পাবেন এবং \n" +
                    "রাসূল সাঃ এর একটি সুন্নাতের উপরও আমল করা হলো।\n"));

        }*/ else if (identifier == 2) {
            toolbar.setTitle("হিজামার যন্ত্রপাতি");

            linearLayout.addView(textField("হিজামা খুব সহজ একটি প্রসেস। আদি যুগ থেকে এই প্রচলিত। ধারনা করা হয় এই চিকিৎসা ওহীর মাধ্যমেই প্রাপ্ত। তাই সেই আদিযুগের অবস্থা বিবেচনা করলে তখন আধুনিক কালের মত এত সরঞ্জাম ছিল না। সব কিছু ভালভাবে জানা থাকলে, আপনার কাছে যদি কোন কিছু না থাকে তবে পানি খাওয়ার গ্লাস দিয়েও হিজামা করতে পারবেন। কিন্তু এখন আধুনিক যুগে দূষণ ও রোগের প্রকোপ এত বেড়ে গেছে যে সাবধানতা অবলম্বন না করলে বিপদ হতে পারে। তাই আধুনিক ও প্রফেশনাল হিজামাতে চেষ্টা করা হয় ডিসপোজেবল জিনিসপত্র ব্যাবহার করতে।"));
            linearLayout.addView(textHeader("\nহিজামা করতে যা যা লাগে"));

            linearLayout.addView(textField("1.হিজামা কাপ ও ভ্যাকিউয়াম পাম্প\n" +
                    "এখন বাংলাদেশেই কাপ তৈরি হচ্ছে। দাম খুবই কম। ১০০ কাপের মূল্য ১৫০০ টাকা মাত্র, এগুলো ডিসপোজেবল , অর্থাৎ একবার ব্যাবহার করে ফেলে দিতে হবে। অর্ডার করতে ফোন করুনঃ +8801612877464\n" +
                    "\n2.স্টেরাইল বা জীবাণুমুক্ত ব্লেড\n" +
                    "স্কিলড বা অভিজ্ঞ হাজ্জাম বা হিজামা থেরাপিস্টদের উচিৎ সাধারণ শেভিং ব্লেড ব্যাবহার করা। প্রতি পেশেন্টের জন্য নতুন ব্লেড ব্যাবহার করতে হবে। এই ব্লেডগুলো সাধারণ গ্রোসারি স্টোরেই পাওয়া যায়। ভাল ব্র্যান্ডের (যেমন জিলেট) ব্লেড ব্যাবহার করা উচিৎ যাতে স্টেরিলিটি নিয়ে কোন সন্দেহ না থাকে।\n" +
                    "\n" +
                    "3.এ্যাপ্রন (ডিসপোজেবল/ পলি ইথলিন/ কাপড়ের)\n" +
                    "বিভিন্ন ধরনের ডিসপোজেবল এ্যাপ্রন দোকান ভেদে ৫৫ থেকে ৮০ টাকার মধ্যে পাওয়া যায়।\n" +
                    "\n4.গ্লাভস \n" +
                    "এগুলো লেটেক্স এর তৈরি। যে কোন ফার্মেসিতে পাওয়া যায়। প্রতি বক্সে ১০০ গ্লাভস থাকে। দাম ২২০ থেকে ৪০০ এর মধ্যে।\n" +
                    "\n5.মাস্ক\n" +
                    "সব ধরনের ফার্মেসি বা মেডিকেল স্টোরেই ডিসপোজেবল মাস্ক পাওয়া যায়। অনেকেই ডিসপোজেবল মাস্ক কয়েকদিন ব্যাবহার করেন, কিন্তু আসলে একটি ডিসপোজেবল মাস্ক এর কার্যক্ষমতা আড়াই ঘন্টা। এর মেসি সময় অতিবাহিত\n" +
                    "\n6.স্কিন স্টেরিলাইজার\n" +
                    "   i)১০% আয়োডিন সলিউশান, অথবা\n" +
                    "   ii)৭০% এ্যালকোহল, অথবা\n" +
                    "   iii)কালোজিরার তেলও ব্যাবহার করা যায়\n" +
                    "   এগুলো সকল ফার্মেসি মা মেডিকেল স্টোরে পাওয়া যায়।\n" +
                    "\n" +
                    "7.অলিভ অয়েল\n" +
                    "8.হিজামা বেড\n" +
                    "9.ফ্লোর ম্যাট\n" +
                    "10.কটন রোল বা কিচেন টিস্যু (রক্ত মোছার জন্য)\n" +
                    "11.বেড কভারিং পলি ইথিলিন বা ক্লিনিকাল টিস্যু\n" +
                    "12.বিন ব্যাগ\n" +
                    "13.বিন বা বর্জ ফেলার জন্য বালতি বা এ ধরনের কিছু।"));
        } else if (identifier == 3) {
            toolbar.setTitle("হিজামার মাধ্যমে রোগের উপকার");

            linearLayout.addView(textField("1.মাইগ্রেন জনিত দীর্ঘমেয়াদী মাথাব্যথা\n" +
                    "2.রক্তদূষণ\n" +
                    "3.উচ্চরক্তচাপ\n" +
                    "4.ঘুমের ব্যাঘাত (insomnia)\n" +
                    "5.স্মৃতিভ্রষ্টতা\n" +
                    "6.অস্থি সন্ধির ব্যাথা (joint pain)\n" +
                    "7.পিঠের ব্যাথা\n" +
                    "8.হাঁটু ব্যাথা\n" +
                    "9.দীর্ঘমেয়াদী সাধারন মাথা ব্যাথা\n" +
                    "10.ঘাড়ে ব্যাথা \n" +
                    "11.কোমর ব্যাথা\n" +
                    "12.পায়ে ব্যাথা \n" +
                    "13.মাংসপেশীর ব্যাথা (muscle strain), মাসল পুল\n" +
                    "14.দীর্ঘমেয়াদী পেট ব্যথা \n" +
                    "15.হাড়ের স্থানচ্যুতি জনিত ব্যাথা, ফ্র\u200D্যাকচার পেইন \n" +
                    "16.থাইরয়েড গ্রন্থির সমস্যা \n" +
                    "17.সাইনুসাইটিস \n" +
                    "18.হাঁপানি (asthma) \n" +
                    "19.Motion Sickness\n" +
                    "20.Tonsilitis\n" +
                    "21.Otitis Media\n" +
                    "22.হৃদরোগ (Cardiac Disease) \n" +
                    "23.রক্তসংবহন তন্ত্রের সংক্রমন \n" +
                    "24.টনসিলাইটিস, ফ্যারিঞ্জাইটিস, ব্রংকাইটিস \n" +
                    "25.দাঁত/মুখের/জিহ্বার সংক্রমন \n" +
                    "26.গ্যাস্ট্রিক পেইন, গ্যাস্ট্রিক আলসার, এসিডিটি\n" +
                    "27.Esophageal varices\n" +
                    "28.IBS\n" +
                    "29.Intoxication (বিষক্রিয়া) \n" +
                    "30.মুটিয়ে যাওয়া (obesity) \n" +
                    "31.দীর্ঘমেয়াদী চর্মরোগ (Chronic Skin Diseases) \n" +
                    "32.ত্বকের নিম্নস্থিত বর্জ্য নিষ্কাশন \n" +
                    "33.ফোঁড়া-পাঁচড়া সহ আরো অনেক রোগ, \n" +
                    "34.ডায়াবেটিক ফুট, \n" +
                    "35.ভার্টিব্রাল ডিস্ক প্রোল্যাপ্স/ হারনিয়েশান, \n" +
                    "36.চুল পড়া (Hair fall), \n" +
                    "37.মানসিক সমস্যা (Psychological disorder), \n" +
                    "38.পারকিনসন্স ডিজিজ \n" +
                    "39.কিডনির সমস্যা \n" +
                    "40.স্পোর্টস ইঞ্জুরি (খেলোয়াড়, আর্মি, কনট্যাক্ট স্পোর্টস)\n" +
                    "41.কানের সমস্যা \n" +
                    "42.ক্যান্সারের ব্যাথা নিয়ন্ত্রন, \n" +
                    "43.লিভার ডিজিজ, পোর্টাল হাইপারটেনশান, \n" +
                    "44.হরমোনাল সমস্যা,\n" +
                    "45.ব্রেইন ডিজিজ ও ডিজঅর্ডার, \n" +
                    "46.ক্রনিক কফ \n" +
                    "47.Erectile Dysfunction (ED) \n" +
                    "48.ব্রন, \n" +
                    "49.সিস্টেমিক লুপাস ইরাইথেমেটোসাস (SLE), \n" +
                    "50.অনিয়মিত মাসিক, মেয়েদের অন্যান্য সমস্যা, \n" +
                    "51.এডিকশান/ ডিপেন্ডেন্সি (স্লিপিং পিল, ড্রাগস, কফ সিরাপ, জর্দা, সিগারেট, এলকোহল ও অন্যান্য নেশাদ্রব্য) \n" +
                    "52.TMJ Dysfunction Syndrome \n" +
                    "53.প্যারালাইসিস (স্ট্রোক, মেরুদন্ডে আঘাত, গিয়েন বারে সিন্ড্রোম, ফেসিয়াল প্যারালাইসিস বা বেল'স পলসি প্রভৃতি) \n" +
                    "54.অস্টিওপোরোসিস (হাড়ের ক্ষয়) \n" +
                    "55.Post menopsusal hot flush \n" +
                    "56.Vaginismus \n" +
                    "57.vertigo (মাথা ঘোরা)...\n" +
                    "58.কার্পাল টানেল সিন্ড্রোম\n" +
                    "59.Early Cerebral Infarction\n" +
                    "60.Brachialgia paraesthesia nocturna\n" +
                    "61.Trigeminal neuralgia, trigeminal neuritis, facial neuritis\n" +
                    "62.Laziness, lassitude, somnolence\n" +
                    "63.Some psychiatric conditions\n" +
                    "64.Rheumatiod Arthritis\n" +
                    "65Vitiligo\n" +
                    "66.Thyroid autoimmunity (Graves disease and Hashimoto’s Thyroiditis)\n" +
                    "67.Goodpastures disease\n" +
                    "68.Multiple Sclerosos\n" +
                    "69.Scleroderma\n" +
                    "70.Addisn’s disease\n" +
                    "71.Insulin Dependant Diabetes mellitus (ডায়াবেটিস)\n" +
                    "72.Autoimmune anemia & Pernicious anemia\n" +
                    "73.Myasthenia Gravis\n" +
                    "74.Acanthosis Nigricans\n" +
                    "75.Ankylosing Spondylitis\n" +
                    "76.Cold Aglutinin Disease\n" +
                    "77.Gout and Gouty Arthritis\n" +
                    "78.Thyroid Dysfunction\n" +
                    "79.Condition of Hormonal Imbalance\n" +
                    "80.Hyperlipidemia & Hypercholesterolemia\n" +
                    "81.Cellulitis\n" +
                    "82.Some Viral Infection (eg. Herpes Zoster)\n" +
                    "83.Viral Hepatitis B & C\n" +
                    "84.Thalassemia (to excrete excess iron and fragmented cells)\n" +
                    "85.Sideroblastic anemia (to excrete excess iron)\n" +
                    "86.Hemolysis (to excrete liberated hemoglobin and  fragmented cells)\n" +
                    "87.Conditions of impaired immunity\n" +
                    "88.Alopecia\n" +
                    "89.Chronic fatigue syndrome\n" +
                    "90.Glaucoma\n" +
                    "91.Pain of dysmenorrhea\n" +
                    "এবং আরও অনেক রোগ। "));

        } else if (identifier == 4) {
            toolbar.setTitle("হিজামার যন্ত্রপাতি ডিসপোজেবলের কারণ");

            linearLayout.addView(textField("আপনারা যারা যারা ডিসপজেবল হিজামা কাপ রি-ইউজ করছেন তারা সকলেই হাশরের ময়দানে ধরা খাবেন বান্দার হক্ব নষ্ট করার জন্য। বাংলাদেশে যে কাপগুলো পাওয়া যায় এগুলো স্টেরিলাইজ বা জীবানুমুক্ত করা যায় না। এগুলো বার বার ব্যাবহার করার মাধ্যমে এক রোগীর জীবানু অপর রোগীর শরীরে চলে যেতে পারে।\n\n" +
                    "অনেকের কাছেই শুনছি যে যারা ট্রেনিং দিচ্ছেন তারা বলছেন সাবান/ শ্যাম্পু/ ডিটারজেন্ট বা ডেটল পানি দিয়ে ধুয়ে কাপ রিইউজ করার পরামর্শ দেন বা অনেক থেরাপিস্ট এত এত বছর ধরে এভাবে করেন। আসলে এভাবে কাপ জীবানুমুক্ত করা সম্ভব নয়। ফুটানো পানিতে আধা ঘন্টা সিদ্ধ করলেও এগুলো জীবানুমুক্ত হয় না।\n\n" +
                    "অনেকেই বলবেন যে রোগ ছড়ায় না। তাদের জন্যঃ\n" +
                    "সিরিয়ায় একবার ব্যাপক আকারে মহামারীরুপে প্লেগ দেখা দিয়েছিলো। হযরত ওমর (রা.) সাহাবাদের সাথে সেখানে রওয়ানা হয়েছিলেন, কিন্তু এখবর পাওয়ার পর যাত্রা স্থগিত করেন। একজন সাহাবী জিজ্ঞেস করলেন, হে আমীরুল মুমেনীন! আপনি কি আল্লাহর লেখা তাক্বদির থেকে পলায়ন করছেন? তিনি বললেন, হাঁ, আমি আল্লাহর লেখা একটি তাক্বদির থেকে অন্য একটি তাক্বদিরের দিকে পলায়ন করছি। অর্থাৎ, রোগ থেকে দুরে চলে যাওয়াও তাক্বদিরের একটি অংশ।\n\n" +
                    "এটা অনেকটা এমন যে, আল্লহর হুকুম ছাড়া মউত হয় না, তাই আপনি কি ছাদ থেকে লাফ দিয়ে টেস্ট করবেন যে মউত হয় কিনা?\n\n" +
                    "সৌদি আরবে অযোগ্য লোকদের হিজামা প্র্যাকটিস ও ডিসপজেবল ম্যাটেরিয়াল মাল্টিপল ব্যাবহারের কারনে হিজামা ব্যান করে দেয়া হয়েছিল। এরপর নিয়ম হয়েছে মিনিমাম ৬ মাসের মেডিকেল এডুকেশানের ব্যাকগ্রাউন্ড আছে এমন ব্যাক্তি ছাড়া কেউ হিজামা করতে পারবে না।\n\n" +
                    "হিজামার ব্যাপারটা এমন হয়েছে যে সেদিন দেখলাম এক লোক দারিদ্র বিমোচনের জন্য হিজামা শিখাচ্ছেন। আপনাদের জন্য আমি বলব- আল্লহকে ভয় করুন। সুন্নতকে কলুষিত করবেন না। ইসলামে চিকিৎসা বিজ্ঞান একটি আলাদা অংশ। এর ইলম হাসিল না করে চিকিৎসা করা নিষেধ।\n\n" +
                    "আমার মনে হয় এই ব্যাপারে মুফতি সাহেবদের ফতোয়া তৈরি করা উচিৎ যাতে মানুষ সাবধান হয়। সরকার বা স্বাস্থ্য মন্ত্রণালয় যদি এই যথেচ্ছাচারের ব্যাপারে জানতে পারে তবে তা এই সুন্নতী চিকিৎসার ভবিষ্যতের জন্য ভাল হবে না।\n\n" +
                    "কাপ রিইউজ করলে অনেক ধরনের রোগ হতে পারে। এর মধ্যে রয়েছে জীবনঘাতী\n" +
                    "   • এইডস, হেপাটাইটিস বি ও সি (এগুলো থেকে হতে পারে লিভার সিরোসিস বা লিভার ক্যান্সারের মত রোগ)\n" +
                    "   • হতে পারে ইনফেকশান (স্কিন ইনফেকশান, সেপটিসেমিয়া ও যৌন রোগের মত সমস্যা), যা কারন হতে পারে মৃত্যুর, ডেকে নিয়ে আসতে পারে পঙ্গুত্ব।\n" +
                    "আল্লহ বুঝ দান করেন। সহজ করেন।"));

        } else if (identifier == 5) {
            toolbar.setTitle("এ্যানাটমি অফ হিজামা কাটস");

            linearLayout.addView(textField("প্রায়ই রোগীরা আসেন যারা হিজামা করিয়েছেন বিভিন্ন প্রতিষ্ঠান থেকে, উপকার তেমন পাননি কিন্তু পেয়েছেন পার্মানেন্ট \"স্কার মার্ক\"!\n"));
            linearLayout.addView(textHeader("স্কার মার্ক কি?\n"));
            linearLayout.addView(textField("স্কার মার্ক কি- সেটা জানার আগে জানতে হবে স্কিনে কয়টা লেয়ার আছে এবং কি কি?"));
            linearLayout.addView(imageField(R.drawable.hijama_anatomy));
            linearLayout.addView(textField("  1.এপিডার্মিসঃ স্কিনের ১ম স্তর। প্রতি ২১ দিন অন্তর অন্তর এই লেয়ার নতুন করে পুনর্গঠিত হয়। হিজামার স্ক্রাচ মূলত এই স্তরেই দেয়া হয়।\n" +
                    "  2.ডার্মিসঃ স্কিনের ২য় স্তর। নেগেটিভ সাকশানের কারনে এখানে হাইপারেমিয়া হবে, এখানে কাট বা ইনজুরি হবে তবে সেটা প্যাপিলারি লেয়ারের মাইক্রোভেসেলস বা ক্যাপিলারি পর্যন্ত সীমাবদ্ধ হবে। অর্থাৎ আসলে স্ট্রেট লাইন টানলে সেটা এপিডার্মিসের মধ্যেই সীমাবদ্ধ।\n" +
                    "  3.সাবকিউটানিয়াস স্তরঃ সর্বশেষ স্তর। কোনো পরিবর্তন নেই।\n"));
            linearLayout.addView(imageField(R.drawable.hijama_anatomy2));
            linearLayout.addView(textField("এখানে দেখুনঃ এপিডার্মিসের প্যাপিলা স্ক্যালোপড শেইপের হয়। এই এই প্যাপিলার কনকেইভিটির ভেতরে ছোট ছোট রক্তনালী থাকে।\n"));
            linearLayout.addView(imageField(R.drawable.hijama_anatomy3));
            linearLayout.addView(textField("স্কার মার্ক হলো স্কিনের ২য় স্তর ডার্মাল লেয়ারে একগুচ্ছ অসংগতিপূর্ণ কোলাজেন টিস্যু গুচ্ছ। \n"));
            linearLayout.addView(imageField(R.drawable.hijama_anatomy4));
            linearLayout.addView(textField("যেকোনো আঘাতের পর সময়ের সাথে সাথে টিস্যু পুনরায় রিজেনারেট করতে চেষ্টা করে, তবে ত্বক কখনোই তার মূল অবস্থায় ফিরে যাবে না - বিশেষ করে যদি কাট ডেপথ এপিডার্মিস (Epidermis) অতিক্রম করে স্ক্যালোপড বেইজমেন্ট মেমব্রেনের এর নীচের যে দাগ টানা হয়েছে সেটা পেরিয়ে যায় ( স্কিন এর নীচের স্তর)।\n\n"));
            linearLayout.addView(textHeader("হিজামা করলে কি স্কার মার্ক হওয়া সম্ভব?\n\n"));
            linearLayout.addView(textField("হিজামাতে কাটা হয় এটা সবাই কম বেশী জানি। কিন্তু এই কাটাটা কেমন? গভীরতা কতটুকু?\n\n" +
                    "প্রথমত, হিজামাতে কাটা হয় না। Scratch (স্ক্র\u200D্যাচ) কিংবা আঁচড় দেয়া হয়। এই স্ক্রাচ মার্ক শুধুই স্কিনের প্রথম লেয়ার এপিডার্মিস পর্যন্ত হবে। আগেই বলেছি এপিডার্মিস লেয়ার প্রতি ৩ মাসে নতুন করে হয়ই, এই স্ক্রাচ মার্ক ২৪ ঘন্টা থেকে ৭ দিনের মধ্যেই হিল হবে ইন শা আল্লাহ এবং পরবর্তীতে স্কিনে কোনো দাগ অবশিষ্ট থাকবে না।\n" +
                    "তবুও কেনো কখনো কখনো হিজামা করার মাস খানেক পর কিংবা কয়েক বছর পরও দাগ দেখা যায়?\n" +
                    "এই দাগ গুলো কিছুটা প্রেগন্যান্সির সময়ের স্ট্রেস মার্ক এর মতো দেখায়। \n" +
                    "হিজামায় তো স্ক্র\u200D্যাচ দেয়া হয় তাহলে এই দাগ কেনো রয়ে গেলো?\n" +
                    "এখানে দুটি ফ্যাক্টর হতে পারেঃ\n"));
            linearLayout.addView(textField("  1.যিনি হিজামা করেছেন উনি হিজামা সম্পর্কে অনভিজ্ঞ। হাদীসে আছে \" হিজামার কাটাতেই শেফা\" - আর এই কাটাই যে পারেন না সে হিজামা কি করবে? কেনো করবে?\n" +
                    "  2.হিজামার স্ক্র\u200D্যাচ মার্ক স্কিনে স্কার মার্ক তখনই হবে যখন স্ক্র\u200D্যাচ হয়ে যাবে কাট (Cut/ incision) এবং তা গিয়ে পড়বে স্কিনের ২য় স্তর ডার্মিসে। ফলাফল এই দাগ চিরস্থায়ী।\n"));
            linearLayout.addView(textField("এই দাগের চিকিৎসা লেজার থেরাপী, এছাড়া অন্যান্য ব্যয়বহুল চিকিৎসাও রয়েছে।"));
            linearLayout.addView(textHeader("হিজামা একটি জনপ্রিয় সুন্নাহ ও বিজ্ঞানভিত্তিক চিকিৎসা পদ্ধতি।\n"));
            linearLayout.addView(textField("হিজামা একটি ব্যাথামুক্ত ও ঔষধমুক্ত চিকিৎসা পদ্ধতি। হিজামা করতে কোন ব্যাথা লাগে না। এটাতে কোন কাটাছেঁড়া করা হয় না। হালকা স্ক্র্যাচ করা হয়। এতে একটু কড়া সুড়সুড়ি অনুভূত হয় মাত্র, ভয়ের কোনই কারণ নেই।\n\n" +
                    "হিজামা সম্পর্কে বিস্তারিত জানতে এই লিংকে ক্লিক করুনঃ\n\n" +
                    "হিজামা থেরাপী নেয়ার বা দেয়ার সময় তাই সবার সতর্ক হওয়া উচিৎ। আসুন সুন্নাহকে অবহেলা না করে  হিজামা করা বা করানোর আগে এ বিষয়ে স্টাডি করি। শুধু সুন্নাহ নয়, অভিজ্ঞ চিকিৎসক কে জিজ্ঞেস করুন হিজামা কিভাবে কাজ করে, কোন রোগে কিভাবে করতে হয়, ইত্যাদি নানা প্রশ্ন। বাংলাদেশে তো হিজামা এখন এমন ব্যবসা হয়েছে যে হিজামা কিভাবে কাজ করে জানে না, কিন্তু বই লিখছে, ট্রেনিং দিচ্ছে।\n\n" +
                    "যেখানে হাদিসে এসেছে চিকিৎসা শাস্ত্রে অনভিজ্ঞ কেউ যদি চিকিৎসা দেয় তাকে জবাবদিহি করতে হবে।\n\n" +
                    "যারা হিজামা প্রাকটিস করছেন আরো পড়াশুনা করুন, শিখুন। ইউটিউব আর কোয়াক দের থেকে নয়, হিজামা বিশেষজ্ঞ দের থেকে ট্রেনিং নিন, পরামর্শ করুন।\n\n" +
                    "নাহলে জবাবদিহির জন্য প্রস্তুত থাকুন। আর যারা মেডিকেল ব্যাকগ্রাউন্ডের তারাও শিখুন, পড়ুন তারপর চর্চা করুন। সার্টিফিকেট এর অপব্যবহার বন্ধ করুন প্লিজ। শেখায় লজ্জা নেই, ভুল চিকিৎসা দেয়ায় লজ্জা। আপনাদের কোন বিষয়ে জানার দরকার হলে আমাদের কাছে আসুন, আসতে না পারলে আমাদের গ্রুপে প্রশ্ন করুন\n\n" +
                    "আমাদের কাছে স্কার মার্ক ছাড়াও পেশেন্ট আসে ব্লিস্টার নিয়ে। আর ট্রিটমেন্ট প্লান এ তো পয়েন্ট ভুলে ভরা। তাই যারা প্রাক্টিস করেন এনাটমি, ফিজিওলজি, প্যাথোলজি পড়ুন। সম্ভব না হলে, অন্তত অভিজ্ঞ কারো ট্রিটমেন্ট প্লান ফলো করুন। অনলাইনে বা অন্যান্য বইয়ে যেসব ট্রিটমেন্ট প্ল্যান পাওয়া যায় তার বেশিরভাগই কোন রোগীর উপর ভিত্তি করে তৈরি। আপনার রোগীর ট্রিটমেন্ট প্ল্যানও তাদের সাথে মিলবে না।\n"));

        } else if (identifier == 6) {
            toolbar.setTitle("সবাই কি হিজামা করতে পারবে? কার কাছে হিজামা করাবেন?");

            linearLayout.addView(textField("আজকে ইউটিউবে আমি সার্জারী শিখে, কালকে আপনাদের লাইভে শিখাবো।\n\n" +
                    "কে কে শিখবেন বলেন?\n\n" +
                    "কি? অদ্ভুত লাগছে শুনতে? অসম্ভব লাগছে? আমাকে পাগল মনে হচ্ছে?\n\n" +
                    "কেনো? আপনারাই তো খুব এক্সাইটেড লাইভে/ ইউটিউবে হিজামা শেখা নিয়ে। ফ্রি তে শিখতে পারবেন সুন্নাহ চিকিৎসা। সার্টিফিকেট বিহীন ডাক্তারী। মৃত সুন্নাহ জাগিয়ে তুলবেন। হিজামা তো সুন্নাহ, ইসলামিক চিকিৎসা, হাদিসে আছে তাই সমগ্র মুসলিম এর অধিকার আছে চর্চা করার। তাই না?\n\n" +
                    "অবশ্যই আপনাদের হিজামা শেখা- করার অধিকার আছে। কিন্তু তাই বলে লাইভ দেখে? ইউটিউব দেখে? একবার রোগী হয়ে হিজামা করিয়ে, পরের দিন নিজেই রোগী দেখা?\n\n" +
                    "না। আপনার এই হক নেই। চিকিৎসা বিদ্যায় জ্ঞ্যান অর্জন ছাড়া হাদিস আপনাকে অনুমতি দেয় না, সরকার ও দেয় না।\n\n" +
                    "কারা হিজাম করতে পারবেনঃ\n\n" +
                    "  1.ডাক্তাররা যেমন এমবিবিএস/ বিডিএস।\n" +
                    "  2.দেশে বা বিদেশে হিজামা নিয়ে অন্তত পক্ষে ৬ মাসের কোর্স করা, এছাড়াও হিজামা নিয়ে এক/দুই/ তিন বছরের ডিপ্লোমা/অনার্স/পিএইচডি করা যারা আছেন তারা অগ্রাধিকার পাবেন।\n" +
                    "  3.অন্যান্য অল্টারনেটিভ চিকিৎসকরা যেমন ফিজিওথেরাপিস্ট, ইউনানী ও আয়ুর্বেদিক হেকিম, হোমিওপ্যাথিস্ট\n" +
                    "  4.মেডিকেল এসিস্ট্যান্ট বা স্যাকমোরা।\n" +
                    "  5.গ্রাম ডাক্তাররা।\n" +
                    "  6.এছাড়াও যারা পর্যাপ্ত সময় কোন শায়খ বা শিক্ষক যিনি সঠিকভাবে হিজামা করতে পারেন তার কাছে থেকে যদি কেউ হিজামা করার অনুমতি প্রাপ্ত হন তবে সেও হিজামা করতে পারবে। এটা শরীয়ত সম্মত হলেও আইনসম্মত নয়।\n\n" +
                    "অর্থাৎ যাদের অন্তত পক্ষে ৬ মাসের মেডিকেল ব্যাকগ্রাউন্ড আছে তারাই প্রফেশনালি হিজামা করতে পারবেন- এটাই আমাদের সরকারী আইন বলে। আপনি যদি কোন মেডিকেল প্রফেশনাল না হন, অর্থাৎ সঠিকভাবে চিকিকিৎসা না শিখে থাকেন তাহলে ইসলামও আপনাকে চিকিৎসা করার অধিকার দেয় না। আর ওপরের যে কয়টি পয়েন্ট বললাম তাদের সবাইকেই হিজামা শিখে হিজামা করার আইনী অধিকার আছে। এই পয়েন্টটা নোট করবেনঃ হিজামা শিখতে হবে। আমাদের দেশে মাত্র চার- পাঁচজন ডাক্তারকে (এমবিবিএস/ বিডিএস) আমি চিনি যারা আসলেই হিজামা সাইন্স বোঝেন। আর যারা ডাক্তার নন তাদের হালত কি হতে পারে সেটা সহজেই অনুমেয়।\n\n" +
                    "আপনি শিখুন, পড়াশুনা করুন, কোর্স করুন, এমন কারো কাছে হাতে কলমে শিখুন যে নিজে অভিজ্ঞ কারো কাছে ট্রেনিং প্রাপ্ত এবং দীর্ঘদিন হিজামা করার অভিজ্ঞতা সম্পন্ন। যার কাছে হিজামা করাচ্ছেন বা শিখছেন তাকে জিজ্ঞেস করুন আপনি হিজামা কার কাছ থেকে শিখেছেন? ইসলামে এই লার্নিং চেইনের কদর সবচেয়ে বেশি। চেইনে ব্রেক থাকলেই বুঝতে হবে সমস্যা আছে। যে হিজামা করছে বা যার কাছ থেকে শিখেছে তাদের একজনের যদি মেডিকেল ব্যাকগ্রাউন্ড না হয় তাহলেই বিপত্তি বাঁধার সম্ভাবনা, হবে Malpraxis. \n\n" +
                    "(MBBS/ BDS রা রেজিস্টার সার্জন তাদের আলাদা সার্টিফিকেট নিষ্প্রয়োজন, ডাক্তাররা যে কোন ভাবেই হিজামা শিখে ট্রিটমেন্ট শুরু করতে পারবেন)\n\n" +
                    "হিজামা করতে প্রচুর পড়াশুনা করা লাগে। \n\n" +
                    "  1.একজন থেরাপিস্ট কে রোগীর হিস্টোরি শুনতে হবে\n" +
                    "  2.সাইন-সিম্পটম শুনে রোগ নির্নয় করতে হবে। \n" +
                    "  3.রোগের প্যাথোজেনেসিস জানতে হবে। \n" +
                    "  4.এনাটমি -ফিজিওলজি-ইন্ডিকেশান-কন্ট্রাইন্ডিকেশান ইত্যাদি মাথায় রেখে ট্রিটমেন্ট প্লান করতে হবে।\n\n" +
                    "কি ভাবছেন? ট্রিটমেন্ট প্ল্যান তো গুগলে আছে মানবদেহের ছবির উপর লাল লাল ফোটা দেয়া রোগের নাম সহ কিংবা নম্বর আকারে?\n\n" +
                    "আচ্ছা ধরেন একজন রোগী আসলো থাইরয়েড হরমোনের প্রবলেম। হাইপো/ হাইপার। সে হিজামা করাবে, তার ট্রিটমেন্ট প্লান কি দিবেন?\n\n" +
                    "আপনার সেই গুগল বই তে তো আছে ৪-৫ টা পয়েন্ট। যতদূর মনে পরে, গলায় আর পিঠে পয়েন্ট গুলো। কিন্তু মাথায় যে একটা পয়েন্ট আছে সেটা বলে দেবে কে আপনাকে? মাথায় কেনো, কিসের পয়েন্ট, কি গ্ল্যান্ড, কি রিলিজ হয় তা কি লাইভে/ইউ টিউবে/ গুগলের সেই বই কিংবা আপনার নন মেডিকেল ট্রেইনার বলেছে?\n\n" +
                    "আবার ধরেন, রোগী এসে বললো আমার থাইরয়েড হরমোনে প্রবলেম কিন্তু হাইপো নাকি হাইপার জানি না, রিপোর্ট আনিনি। এখন বলেন তো আপনি কিভাবে নির্নয় করবেন তার রোগ কোনটা? শুধুমাত্র কথা বলে কিংবা দেখে? টেস্ট করানো পরের কথা। কি? পারবেন?\n\n" +
                    "ধরেন কারো পায়ে অবশ ভাব আছে, তো আপনি কাপ বসিয়ে দিলেন যে জায়গায় অবশ ভাব আছে সেখানে, কিন্তু পায়ের এখানে সাপ্লাই দেয় যে নার্ভ সেটা তো লাম্বার ভার্টিব্রা থেকে আসে। ওখানে ডিস্কের সমস্যার কারনে পায়ের সেনসেশান এ প্রবলেম, এটা কে বলবে?\n\n" +
                    "আর ম্যালপ্র্যাক্সিস নিয়ে নতুন করে কি বলবো। রোগীরা আসেন ডাক্তারদের কাছে কম খরচে অমুক তমুক ছাতার মতো গজিয়ে উঠা হিজামা ক্লিনিক হতে। সুস্থ হন নি। কিন্তু সুন্নতে অগাধ বিশ্বাস। স্কিনে দেখি কি বড় বড় কাটা! স্কার মার্ক!\n"));
            linearLayout.addView(textHeader("আর যারা আমাদের কাছে  বা অন্য অভিজ্ঞ থেরাপিস্ট এর কাছে যান না, তারা পরে হয়তো বলেন এটা চৌদ্দশ বছর আগের চিকিৎসা, এগুলোতে এখন আর কাজ হয় না।\n"));
            linearLayout.addView(textField("মানুষকে আপনারা সুন্নতের দাওয়াত দিতে গিয়ে সুন্নাহ বিরোধি বানিয়ে ফেলছেন কিনা একবার তো খোঁজ নিন।\n\n" +
                    "আরে ভাই-আপা! হিজামাতে কাটতে হয় না। স্ক্রাচ দিতে হয়। কাটাকুটি খেলে যে রোগীর শরীরে সারাজীবনের জন্য ক্ষত/ দাগ ফেলেছেন, তার জবাব আল্লাহ কে কি দিবেন?\n\n"));
            linearLayout.addView(textArabic("حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، وَرَاشِدُ بْنُ سَعِيدٍ الرَّمْلِيُّ، قَالاَ حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ، حَدَّثَنَا ابْنُ جُرَيْجٍ، عَنْ عَمْرِو بْنِ شُعَيْبٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ \u200F \"\u200F مَنْ تَطَبَّبَ وَلَمْ يُعْلَمْ مِنْهُ طِبٌّ قَبْلَ ذَلِكَ فَهُوَ ضَامِنٌ \u200F\"\u200F \u200F.\u200F"));
            linearLayout.addView(textField("আবদুল্লাহ বিন আমর ইবনুল আস (রাঃ), থেকে বর্ণিতঃ\n\n" +
                    "রাসূলুল্লাহ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেন, কোন ব্যক্তি চিকিৎসা বিদ্যা অর্জন না করেই চিকিৎসা করলে সে দায়ী হবে।\n\n" +
                    "(সুনানে ইবনে মাজাহ) [৩৪৬৬]\n\n" +
                    "(তাহকীক আলবানীঃ হাসান।)\n\n" +
                    "যারা প্রাক্টিস করছেন আপনাদের হিজামার স্ক্রাচ নিয়ে জ্ঞান না থাকলে প্রয়োজনে আমাদের কাছে আসুন, দেখুন - শিখুন। অহেতুক ইগো আর ভুল জ্ঞান দিয়ে বেশীদূর যাওয়া সম্ভব নয়। টাকা দিয়ে কোর্স করতে হবে এমন নয়, যারাই হিজামা প্রাক্টিস করেন যেকোনো পরামর্শ, সহায়তার জন্য আমাদের নক করেছেন আমরা যথাসাধ্য সাহায্য করেছি, ইন শা আল্লাহ করবো।\n\n" +
                    "কাপের পুনঃব্যবহার বন্ধ করুন। বাসায় বাসায় গিয়ে যার তার বিছানায় নয়। একটি পরিচ্ছন্ন রুম নিন, গ্লাভস নিন, নতুন কাপ, নতুন ব্লেড নিন, পরিষ্কার গান নিন, রেক্সিনের বেডে ওয়ান টাইম বেড টিস্যু নিন, রোগীকে নির্দিষ্ট ক্লিন গাউন দিন, আপনিও গাউন বা এ্যাপ্রোন - মাস্ক পড়ুন। সার্জিকাল সাইট প্রিপারেশান এর মত স্কিন ক্লিন করুন আয়োডিন সলিউশান দিয়ে। হিজামা করুন প্রপার ওয়ে তে। শেষ হবার আগে কাপ খুলে রোগী ছেড়ে দেবেন না। আপনি জানেন তো হিজামা শেষ হয়েছে কি না কিভাবে বোঝা যায়?\n\n" +
                    "চিকিৎসা শাস্ত্র নিয়ে তাই মজা নয় প্লিজ। মানুষের জীবন, মানুষের রোগ, মানুষের আবেগ নিয়ে খেলা নয় প্লিজ।\n" +
                    "শিখুন। পড়ুন। জ্ঞান বাড়ান।\n\n" +
                    "ট্রেনিং নিয়ে হিজামা প্রাক্টিস করুন সুন্নাহ হিসেবে কিন্তু ফিজিশিয়ান বা সার্জন বা মেডিকেল ব্যাকগ্রাউন্ডের না হলে রোগীর রোগের চিকিৎসা হিসেবে হিজামা করবেন না প্লিজ।\n" +
                    "অন্যথায় সৌদি আরব কিংবা দুবাই এর মতো নন মেডিকেল দের জন্য হিজামা প্রাক্টিস ব্যান হতে সময় লাগবে না।\n\n" +
                    "এদেশের মানুষ সেক্যুলার বেশী, আপনাদের ভুল পদক্ষেপ আর ধর্ম ব্যবসার জন্য যেন এই নববী চিকিৎসার দুর্নাম না হয় সেদিকে লক্ষ্য রাখবেন।\n\n" +
                    "আপনারা আরো আরো হিজামা শিখুন,করুন, সেন্টার দিন এটাই আমার প্রত্যাশা। আমি যখন হিজামা শুরু করি তখন ধারনা ছিলো না মানুষ কিভাবে গ্রহন করবে, কত ইনকাম হবে। মৃত সুন্নাহ এর পুনঃজাগরণ, প্রচার, প্রসারের লক্ষ্যেই শুরু করি। মাসে পাঁচ সাতজন রোগী হত তখন। আর এখন আমাদের ব্রাঞ্চের সংখ্যাই এর চেয়ে বেশি। \n\n" +
                    "অর্থ উপার্জনের জন্য তো আমাদের ডেন্টাল ডিগ্রীই কাফি। বিশ্বের সবচেয়ে ব্যয়বহুল চিকিৎসা ডেন্টাল আর একজন ডেন্টাল সার্জনের ইনকাম মাশা আল্লাহ খুব ভাল। আর আমাদের ডেন্টাল ক্লিনিক Tooth Planet দেশের অন্যতম ও সেরা প্রতিষ্ঠানের একটি যেখানে আন্তর্জাতিক মানের কাজ হয়।\n\n" +
                    "তাই হিজামা চর্চার আগে নিয়ত পরিবর্তন করুন। আগে শিখুন, তারপর চিকিৎসা দিন নিজের দায়বদ্ধতা থেকে।\n\n" +
                    "আর রোগীরা সোচ্চার হন, সজাগ হন। যত্রতত্র ভাবে আর চিকিৎসা সেবা আর নয়। ডাক্তার দেখাতে যেমন ডিগ্রী দেখেন, তেমন হিজামা করাতেও প্রয়োজনে ডিগ্রী যাচাই করুন। “দীর্ঘ এতো বছর মিডল ইস্টে হিজামা করেছি” এটা কোনো ডিগ্রী নয়। অমুকের ক্লিনিকে সহকারী ছিলাম কোনো ডিগ্রী নয়। অমুক কলেজের স্যার হিজামা দেখিয়ে দিয়েছে কোনো ডিগ্রী নয়। তাদের অনুমতি পত্র দেখাতে পারলে ঠিক আছে, যে তারা ওনার স্কিল ও জ্ঞান দেখে হিজামার অনুমতি দিয়েছে। যারা অনুমতি দিয়েছে তাদের স্বীকৃত কোন মেডিকেল ডিগ্রী থাকা বাঞ্ছনীয়।\n\n" +
                    "কাপ দেখে বুঝে নিন নতুন না পূর্বে ব্যবহৃত। ব্যবহৃত কাপ ঘোলা হয়। হিজামায় ব্যবহৃত জিনিষ মাটিতে পুতে ফেলার কঠোর নির্দেশনা আছে হাদিসে। আমরা আমাদের ক্লিনিক Hijama Planet: Cupping & Ruqyah Center এ সর্বদা ডিসপজেবল সামগ্রী ব্যাবহার করি।\n\n" +
                    "উপযুক্ত স্টেরিলাইজেশন এর অভাবে আপনার হতে পারে এইচ আইভি/ হেপাটাইটিস সংক্রমণ। পচন ধরতে পারে পায়ে। ভাবছেন বানিয়ে বলছি? সারা দেশ থেকে এই ধরনের তথ্য পাই আমরা। তাই সজাগ হন আজই।"));

        } else if (identifier == 7) {
            toolbar.setTitle("ইসলামী শরীয়াহ মোতাবেক চিকিৎসকের যোগ্যতা ও দ্বায়িত্ব");
            linearLayout.addView(textField("অনেকেই ইদানীং আরগিউ করছেন যে, ইসলামে হাতুড়ে ডাক্তার বা চিকিৎসক বলতে কিছু নেই। যে কেউ চিকিৎসা দিতে পারে। আসলেই কি তাই?\n"));
            linearLayout.addView(imageField(R.drawable.hijama_doc_cap1));
            linearLayout.addView(imageField(R.drawable.hijama_doc_cap2));
            linearLayout.addView(imageField(R.drawable.hijama_doc_cap3));
            linearLayout.addView(imageField(R.drawable.hijama_doc_cap4));
            linearLayout.addView(imageField(R.drawable.hijama_doc_cap5));
            linearLayout.addView(imageField(R.drawable.hijama_doc_cap6));
            linearLayout.addView(imageField(R.drawable.hijama_doc_cap7));
            linearLayout.addView(imageField(R.drawable.hijama_doc_cap8));
            linearLayout.addView(imageField(R.drawable.hijama_doc_cap9));

        } else if (identifier == 8) {
            toolbar.setTitle("হিজামা সংক্রান্ত হাদীসসমূহ ও মাসায়েল");

            linearLayout.addView(textHeader("রোজায় হিজামা\n"));
            linearLayout.addView(textArabic("وَعَنْ أَنَسِ بْنِ مَالِكٍ - رضي الله عنه - قَالَ: أَوَّلُ مَا كُرِهَتِ الحِجَامَةُ لِلصَّائِمِ; أَنَّ جَعْفَرَ بْنَ أَبِي طَالِبٍ احْتَجَمَ وَهُوَ صَائِمٌ، فَمَرَّ بِهِ النَّبِيُّ - صلى الله عليه وسلم - فَقَالَ: «أَفْطَرَ هَذَانِ»، ثُمَّ رَخَّصَ النَّبِيُّ - صلى الله عليه وسلم - بَعْدُ فِي الحِجَامَةِ لِلصَّائِمِ، وَكَانَ أَنَسٌ يَحْتَجِمُ وَهُوَ صَائِمٌ. رَوَاهُ الدَّارَقُطْنِيُّ وَقَوَّاهُ \n"));
            linearLayout.addView(textField(" আনাস বিন মালিক রদ্বিআল্লহু আনহু  তিনি বলেন, প্রথম দিকে সিঙ্গা লাগান মাকরূহ হবার কারণ ছিল, জাফার বিন আবু তালিব সওমের অবস্থায় সিঙ্গা লাগিয়েছিলেন আর নাবী সল্লাল্লহু ‘আলাইহি ওয়া সাল্লাম) তার নিকট দিয়ে যাচ্ছিলেন, তিনি বললেন-এরা দুজনেই সওম ভঙ্গ করে ফেলেছে। তারপর তিনি (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) সওমের অবস্থায় সিঙ্গা লাগানোর ব্যাপারে অবকাশ দিয়েছেন। ফলে আনাস রদ্বিআল্লহু আনহু সায়িম অবস্থায় সিঙ্গা লাগাতেন। \n\n" +
                    "দারাকুৎনী একে কাবি (মজবুত) সনদ হিসেবে সাব্যস্ত করেছেন। \n" +
                    "\nসুনানে ইবনে মাজাহ, হাদিস নং ৬৬৭ \n" +
                    "হাদিসের মান: সহিহ হাদিস\n\n"));
            linearLayout.addView(textArabic("و حَدَّثَنِي عَنْ مَالِك عَنْ ابْنِ شِهَابٍ أَنَّ سَعْدَ بْنَ أَبِي وَقَّاصٍ وَعَبْدَ اللهِ بْنَ عُمَرَ كَانَا يَحْتَجِمَانِ وَهُمَا صَائِمَانِ\n"));
            linearLayout.addView(textField("ইবনু শিহাব (র) থেকে বর্ণিতঃ\n" +
                    "সা’দ ইবনু আবি ওয়াক্কাস ও আবদুল্লাহ্ ইবনু উমার (রা) দু’জনে শিঙ্গা লাগাতেন অথচ তাঁরা রোযাদার। \n" +
                    "\n(হাদীসটি ইমাম মালিক (রঃ) একক ভাবে বর্ণনা করেছেন)\n" +
                    "হাদিসের মানঃ নির্ণীত নয় \n"));
            linearLayout.addView(textArabic("و حَدَّثَنِي عَنْ مَالِك عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ أَنَّهُ كَانَ يَحْتَجِمُ وَهُوَ صَائِمٌ ثُمَّ لَا يُفْطِرُ قَالَ وَمَا رَأَيْتُهُ احْتَجَمَ قَطُّ إِلَّا وَهُوَ صَائِمٌ ১قَالَ مَالِك لَا تُكْرَهُ الْحِجَامَةُ لِلصَّائِمِ إِلَّا خَشْيَةً مِنْ أَنْ يَضْعُفَ وَلَوْلَا ذَلِكَ لَمْ تُكْرَهْ وَلَوْ أَنَّ رَجُلًا احْتَجَمَ فِي رَمَضَانَ ثُمَّ سَلِمَ مِنْ أَنْ يُفْطِرَ لَمْ أَرَ عَلَيْهِ شَيْئًا وَلَمْ آمُرْهُ بِالْقَضَاءِ لِذَلِكَ الْيَوْمِ الَّذِي احْتَجَمَ فِيهِ لِأَنَّ الْحِجَامَةَ إِنَّمَا تُكْرَهُ لِلصَّائِمِ لِمَوْضِعِ التَّغْرِيرِ بِالصِّيَامِ فَمَنْ احْتَجَمَ وَسَلِمَ مِنْ أَنْ يُفْطِرَ حَتَّى يُمْسِيَ فَلَا أَرَى عَلَيْهِ شَيْئًا وَلَيْسَ عَلَيْهِ قَضَاءُ ذَلِكَ الْيَوْمِ\n"));
            linearLayout.addView(textField("হিশাম ইবনু উরওয়াহ্ (র) থেকে বর্ণিতঃ\n" +
                    "হিশাম ইবনু উরওয়াহ্ (র) তাঁর পিতা হতে বর্ণনা করেন যে, তিনি হিজামা লাগাতেন অথচ তিনি রোযাদার। অতঃপর এই কারণে রোযা ভঙ্গ করতেন না। হিশাম বলেন, আমি তাঁকে রোযাদার অবস্থা ছাড়া কখনো হিজামা লাগাতে দেখিনি। \n" +
                    "(হাদীসটি ইমাম মালিক (রঃ) একক ভাবে বর্ণনা করেছেন)\n" +
                    "মালিক (র) বলেন, রোযাদারের শিঙ্গা লাগানো মাকরূহ নয় কিন্তু দুর্বল হয়ে পড়ার ভয় হলে মাকরূহ, দুর্বল না হলে এটা মাকরূহ হবে না। আর যদি কোন ব্যক্তি রমযানে শিঙ্গা লাগায়, অতঃপর রোযা ভঙ্গ করা হতে বিরত থাকে, আমি তার জন্য কোন কিছু (লাগবে বলে) মনে করি না এবং যেদিন শিঙ্গা লাগিয়েছে সেই দিনের রোযা কাযা করার হুকুমও করি না। কেননা রোযার ক্ষতির আশংকায় রোযাদারের জন্য শিঙ্গা লাগানো মাকরূহ করা হয়েছে। ফলে যে ব্যক্তি লাগিয়েছে, সন্ধ্যা পর্যন্ত রোযা ইফতার করা হতে বিরত রয়েছে আমি তার জন্য কোন দোষ মনে করি না এবং তার উপর সেই দিনের (রোযার) কাযাও প্রয়োজন হবে না।\n" +
                    "\nহাদিসের মানঃ নির্ণীত নয় \n"));
            linearLayout.addView(textArabic("وَعَنِ ابْنِ عَبَّاسٍ رَضِيَ اللَّهُ عَنْهُمَا؛ أَنَّ النَّبِيَّ - صلى الله عليه وسلم - احْتَجَمَ وَهُوَ مُحْرِمٌ، وَاحْتَجَمَ وَهُوَ صَائِمٌ. رَوَاهُ البُخَارِيُّ\n"));
            linearLayout.addView(textField("ইবনু আব্বাস (রাঃ) থেকে বর্ণিতঃ\n" +
                    "তিনি বলেন, নাবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) মুহরিম অবস্থায় শিঙ্গা লাগিয়েছেন এবং সায়িম (রোযা রাখা) অবস্থায়ও শিঙ্গা লাগিয়েছেন। [৭১১]\n" +
                    "\n[৭১১] বুখারী ১৮২৫, ১৯৩৮, ২৯২৯, ২১০৩, মুসলিম ১২০২, তিরমিয়ী ৭৭৫, ৭৭৬, ৭৭৭, \n" +
                    "\nনাসায়ী ২৮৪৫, ২৮৪৬, ২৮৪৭, ১৮২৫, ইবনু মাজাহ ১৬৮২, ২০৮১,\n" +
                    "আহমাদ ১৮৫২, ১৯২২, দারেমী ১৮১৯, ১৯২১\n" +
                    "হাদিসের মানঃ সহিহ"));
            linearLayout.addView(textHeader("ইহরাম অবস্থায় হিজামা"));
            linearLayout.addView(textArabic("حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ عَنْ يَزِيدَ بْنِ أَبِي زِيَادٍ عَنْ مِقْسَمٍ عَنْ ابْنِ عَبَّاسٍ قَالَ احْتَجَمَ رَسُولُ اللهِ صلى الله عليه وسلم وَهُوَ صَائِمٌ مُحْرِمٌ\n"));
            linearLayout.addView(textField("ইবনু আব্বাস (রাঃ) থেকে বর্ণিতঃ\n" +
                    "রসূলুল্লাহ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) সিয়াম ও ইহরাম রত অবস্থায় হিজামা করিয়েছেন। সহীহ, এ শব্দে তিনি মুহরিম অবস্থায় শিঙ্গা লাগিয়েছেন।\n" +
                    "\nতাহকীক আলবানীঃ (“আরবী’) শব্দ দ্বারা সহীহ।\n" +
                    "[১৬৮২] সহীহুল বুখারী ১৮৩৫, ১৯৩৮, ১৯৩৯, ২১০৩, ২২৭৮, ২২৭৯, ৫৬৯১, ৫৬৯৪, ৫৬৯৫, ৫৬৯৯,৫৭০১, মুসলিম ১২০২, তিরমিযী ৭৭৫, ৭৭৬, ৭৭৭, ৮৩৯, নাসায়ী ২৮৪৫, ২৮৪৬, ২৮৪৭, আবূ দাউদ ১৮৩৫, ১৮৩৬, ২৩৭২, ২৩৭৩, আহমাদ ১৮৫২, ১৯২২, ১৯৪৪, ২১০৯, ২১৮৭, ২২২৯, ২২৪৩, ২২৪৯,২৩৩৩, ২৩৫১, ২৫৩২, ২৫৮৪, ২৬৫৪, ২৭১১, ২৭৮৫৩, ২৮৮৩, ৩০৬৫, ৩০৬৮, ৩২০১, ৩২২৩, ৩২৭২, ৩৫১৩,৩৫৩৭ দারেমী ১৮১৯, ১৮২১ ইরওয়াহ ৯৩২, সহীহ আবী দাউদ ২০৫৪। তাহকীক আলবানীঃ তিনি মুহরিম অবস্থায় শিঙ্গা লাগিয়েছেন, এ শব্দে সহীহ। উক্ত হাদিসের রাবী ১. মুহাম্মাদ বিন ফুদায়ল সম্পর্কে ইবনু মাঈন তাকে সিকাহ বলেছন। আবু যুরআহ আর-রাযী বলেন, তিনি সত্যবাদী। ইমাম নাসাঈ বলেন, কোন সমস্যা নেই। আহমাদ বিন হাম্বল বলেন, তিনি শীয়া মতাবলম্বী। (তাহযীবুল কামালঃ রাবী নং ৫৫৪৮, ২৬/২৯৩ নং পৃষ্ঠা) ২. ইয়াযীদ বিন আবু যিয়াদ সম্পর্কে আহমাদ বিন সালিহ তাকে সিকাহ বললেও ইয়াহইয়া বিন মাঈন ও আবু হাতিম আর-রাযী বলেন, তিনি হাদিস বর্ণনায় নির্ভরযোগ্য নয়। আবু যুরআহ আর-রাযী বলেন, তার থেকে হাদিস গ্রহন করা যাবে কিন্তু দলীল হিসেবে গ্রহণযোগ্য নয়। আহমাদ বিন হাম্বল বলেন, কোন সমস্যা নেই। (তাহযীবুল কামালঃ রাবী নং ৬৯৯১, ৩২/১৩৫ নং পৃষ্ঠা।\n" +
                    "হাদিসের মানঃ সহিহ\n"));
            linearLayout.addView(textArabic("و حَدَّثَنِي عَنْ مَالِك عَنْ عَطَاءِ بْنِ عَبْدِ اللهِ الْخُرَاسَانِيِّ أَنَّهُ قَالَ: حَدَّثَنِي شَيْخٌ بِسُوقِ الْبُرَمِ بِالْكُوفَةِ عَنْ كَعْبِ بْنِ عُجْرَةَ أَنَّهُ قَالَ: جَاءَنِي رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَأَنَا أَنْفُخُ تَحْتَ قِدْرٍ لِأَصْحَابِي وَقَدْ امْتَلَأَ رَأْسِي وَلِحْيَتِي قَمْلًا فَأَخَذَ بِجَبْهَتِي ثُمَّ قَالَ احْلِقْ هَذَا الشَّعَرَ وَصُمْ ثَلَاثَةَ أَيَّامٍ أَوْ أَطْعِمْ سِتَّةَ مَسَاكِينَ وَقَدْ كَانَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَلِمَ أَنَّهُ لَيْسَ عِنْدِي مَا أَنْسُكُ بِهِ. قَالَ مَالِك فِي فِدْيَةِ الْأَذَى إِنَّ الْأَمْرَ فِيهِ أَنَّ أَحَدًا لَا يَفْتَدِي حَتَّى يَفْعَلَ مَا يُوجِبُ عَلَيْهِ الْفِدْيَةَ وَإِنَّ الْكَفَّارَةَ إِنَّمَا تَكُونُ بَعْدَ وُجُوبِهَا عَلَى صَاحِبِهَا وَأَنَّهُ يَضَعُ فِدْيَتَهُ حَيْثُ مَا شَاءَ النُّسُكَ أَوْ الصِّيَامَ أَوْ الصَّدَقَةَ بِمَكَّةَ أَوْ بِغَيْرِهَا مِنْ الْبِلَادِ.\n"
                    + "\n" +
                    "-قَالَ مَالِك لَا يَصْلُحُ لِلْمُحْرِمِ أَنْ يَنْتِفَ مِنْ شَعَرِهِ شَيْئًا وَلَا يَحْلِقَهُ وَلَا يُقَصِّرَهُ حَتَّى يَحِلَّ إِلَّا أَنْ يُصِيبَهُ أَذًى فِي رَأْسِهِ فَعَلَيْهِ فِدْيَةٌ كَمَا أَمَرَهُ اللهُ تَعَالَى وَلَا يَصْلُحُ لَهُ أَنْ يُقَلِّمَ أَظْفَارَهُ وَلَا يَقْتُلَ قَمْلَةً وَلَا يَطْرَحَهَا مِنْ رَأْسِهِ إِلَى الْأَرْضِ وَلَا مِنْ جِلْدِهِ وَلَا مِنْ ثَوْبِهِ فَإِنْ طَرَحَهَا الْمُحْرِمُ مِنْ جِلْدِهِ أَوْ مِنْ ثَوْبِهِ فَلْيُطْعِمْ حَفْنَةً مِنْ طَعَامٍ. قَالَ مَالِك مَنْ نَتَفَ شَعَرًا مِنْ أَنْفِهِ أَوْ مِنْ إِبْطِهِ أَوْ اطَّلَى جَسَدَهُ بِنُورَةٍ أَوْ يَحْلِقُ عَنْ شَجَّةٍ فِي رَأْسِهِ لِضَرُورَةٍ أَوْ يَحْلِقُ قَفَاهُ لِمَوْضِعِ الْمَحَاجِمِ وَهُوَ مُحْرِمٌ نَاسِيًا أَوْ جَاهِلًا إِنَّ مَنْ فَعَلَ شَيْئًا مِنْ ذَلِكَ فَعَلَيْهِ الْفِدْيَةُ فِي ذَلِكَ كُلِّهِ وَلَا يَنْبَغِي لَهُ أَنْ يَحْلِقَ مَوْضِعَ الْمَحَاجِمِ وَمَنْ جَهِلَ فَحَلَقَ رَأْسَهُ قَبْلَ أَنْ يَرْمِيَ الْجَمْرَةَ افْتَدَى\n"));
            linearLayout.addView(textField("কা’ব ইবনু ‘উজরা (রা) থেকে বর্ণিতঃ\n" +
                    "রসূলুল্লাহ্ (সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম) আমার কাছে এলেন। আমি চুলায় আগুন ধরিয়ে সঙ্গীদের জন্য রান্ন-বান্নায় ব্যস্ত ছিলাম। আমার মাথা ও দাড়ি উকুনে ভরা ছিল। রসূলুল্লাহ্ (সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম) আমার পেরেশানী অনুভব করে আমার ললাটে হাত রাখলেন এবং বললেন, চুল কেটে ফেল এবং তিনদিন রোযা রাখ বা ছয় জন মিসকীনকে খাদ্য দিয়ে দাও। আর আমার নিকট কুরবানী করার মত কিছু ছিল না, এ কথা তিনি জানতেন। \n" +
                    "\n(বুখারী ৪১৯০, মুসলিম ১২০১, ইমাম মালিক (র)-এর সনদে মুবহাম রয়েছে)\n" +
                    "\n" +
                    "মালিক (র) বলেন, অপরাধ না হওয়া পর্যন্ত কেউ কিছু ফিদ্\u200Cয়া দিবে না। কারণ অপরাধ করার পরই শুধু কাফ্\u200Cফারা ওয়াজিব হয়ে থাকে। কাফ্\u200Cফারার বেলায় কুরবানী বা রোযা বা মিসকীনকে খাদ্য প্রদান, এই তিনটির যেকোন একটি এবং মক্কা বা মক্কার বাহিরে যেকোন শহরে উহা আদায় করার ইখতিয়ার রয়েছে।\n" +
                    "মালিক (র) বলেন, ইহরাম না খোলা পর্যন্ত মুহরিমের জন্য চুল উপড়ান বা কামানো বা ছাঁটা কিছুই জায়েয নয়। চুলে উকুন ইত্যাদি হয়ে গেলে তা জায়েয। কিন্তু উহার পরিবর্তে আল্লাহর নির্দেশমত ফিদ্\u200Cয়া দিতে হবে। মুহরিমের জন্য নখ কাটা, উকুন মারা বা মাথার চুল হতে উকুন বের করে মাটিতে ফেলে দেওয়া বা শরীর ও কাপড়ের উকুন বের করা জায়েয নয়। এইরূপ করলে এক মুষ্টি খাদ্য খয়রাত করবে।\n" +
                    "মালিক (র) বলেন, যদি ইহরাম অবস্থায় কোন ব্যক্তি নাকের চুল বা বগলতলা বা নাভীর নিচের লোম চিমটি দ্বারা উপড়ায় অথবা মাথায় যখম হওয়ার দরুন প্রয়োজনের খাতিরে চুল কামায় বা শিঙ্গা লাগাবার উদ্দেশ্যে গর্দানের চুল কাটে, এসব জেনে করুক বা ভুলবশত করুক, সকল অবস্থায়ই তার জন্য ফিদ্\u200Cয়া দেওয়া ওয়াজিব। শিঙ্গা লাগানো স্থানের চুল কামানো মুহরিমের জন্য জায়েয নয়।\n" +
                    "মালিক (র) বলেন, অজ্ঞতার দরুন যদি কেউ কঙ্কর নিক্ষেপের পূর্বেই মাথার চুল কামায়ে ফেলে তবে তাকে ফিদ্\u200Cয়া দিতে হবে।\n" +
                    "হাদিসের মানঃ অন্যান্য "));
            linearLayout.addView(textHeader("হিজামার পারিশ্রমিক\n"));
            linearLayout.addView(textArabic("حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ ، قَالَ : حَدَّثَنَا إِسْمَاعِيلُ بْنُ جَعْفَرٍ ، عَنْ حُمَيْدٍ ، قَالَ : سُئِلَ أَنَسُ بْنُ مَالِكٍ عَنْ كَسْبِ الْحَجَّامِ ، فَقَالَ : احْتَجَمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ , حَجَمَهُ أَبُو طَيْبَةَ ، فَأَمَرَ لَهُ بِصَاعَيْنِ مِنْ طَعَامٍ ، وَكَلَّمَ أَهْلَهُ فَوَضَعُوا عَنْهُ مِنْ خَرَاجِهِ , وَقَالَ : \" إِنَّ أَفْضَلَ مَا تَدَاوَيْتُمْ بِهِ الْحِجَامَةُ \" ، أَوْ \" إِنَّ مِنْ أَمْثَلِ دَوَائِكُمُ الْحِجَامَةَ \" \n"));
            linearLayout.addView(textField("হুমায়দ (রাঃ) থেকে বর্ণিতঃ\n" +
                    "তিনি বলেন, আনাস ইবনে মালিক (রাঃ) কে হিজামা লাগানোর পারিশ্রমিক সম্পর্কে জিজ্ঞেস করা হলে তিনি বলেন, আবু তায়বা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে হিজামা লাগিয়েছিল। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁকে ২ সা' খাদ্যশস্য দেয়ার নির্দেশ দিয়েছিলেন এবং তাঁর মালিকের সঙ্গে আলাপ করে তাঁর নিকট হতে আদায়যোগ্য অর্থ খারাজও কমিয়ে দিয়েছিলেন এবং তিনি বলেছিলেন, তোমরা যে ঔষধ ব্যবহার কর, এর মধ্যে শিঙ্গা উত্তম। অথবা বলেছেন, শিঙ্গা উত্তম প্রতিষেধকের অন্তর্ভুক্ত।\n" +
                    "\nসহীহ মুসলিম, হা/৪১২১; মুসনাদে আহমাদ, হা/১২৯০৬; মুসনাদে আবু ই'আলা, হা/৩৭৫৮; \n" +
                    "মুস্তাখরাজে ইবনে আবি আওয়ানা, হা/৪২৯৮। \n" +
                    "হাদীসের মানঃ সহীহ\n" +
                    " \n"));
            linearLayout.addView(textArabic(
                    "حَدَّثَنَا عَمْرُو بْنُ عَلِيٍّ ، قَالَ : حَدَّثَنَا أَبُو دَاوُدَ ، قَالَ : حَدَّثَنَا وَرْقَاءُ بْنُ عُمَرَ ، عَنْ عَبْدِ الأَعْلَى ، عَنْ أَبِي جَمِيلَةَ ، عَنْ عَلِيٍّ : \" أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ , احْتَجَمَ وَأَمَرَنِي فَأَعْطَيْتُ الْحَجَّامَ أَجْرَهُ \" \n"));
            linearLayout.addView(textField("আলী (রাঃ) থেকে বর্ণিতঃ\n" +
                    "রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম নিজে শিঙ্গা লাগালেন এবং আমাকে এর পারিশ্রমিক দেয়ার নির্দেশ দিলেন। অতঃপর আমি তাকে পারিশ্রমিক দিয়ে দিলাম।\n" +
                    "\nইবনে মাজাহ, হা/২১৬৩; মুসনাদে আহমাদ, হা/১১৩০; বায়হাকী, হা/১৯৩০৪; \n" +
                    "মুসনাদুত তায়ালুসী, হা/১৪৮।\n" +
                    "হাদিসের মানঃ সহিহ\n"));
            linearLayout.addView(textArabic(
                    "حَدَّثَنَا هَارُونُ بْنُ إِسْحَاقَ الْهَمْدَانِيُّ ، قَالَ : حَدَّثَنَا عَبْدَةُ ، عَنْ سُفْيَانَ الثَّوْرِيِّ ، عَنْ جَابِرٍ ، عَنِ الشَّعْبِيِّ ، عَنِ ابْنِ عَبَّاسٍ ، قَالَ : \" إِنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ احْتَجَمَ فِي الأَخْدَعَيْنِ , وَبَيْنَ الْكَتِفَيْنِ ، وَأَعْطَى الْحَجَّامَ أَجْرَهُ , وَلَوْ كَانَ حَرَامًا لَمْ يُعْطِهِ \" \n"));
            linearLayout.addView(textField("ইবনে আব্বাস (রাঃ) থেকে বর্ণিতঃ\n" +
                    "তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর গর্দানের দু’পার্শ্বে এবং কাঁধের দু’ পার্শ্বে শিঙ্গা লাগালেন এবং শিঙ্গা লাগানেওয়ালাকে এর পারিশ্রমিক দিলেন। শিঙ্গা লাগানো যদি হারাম হতো, তবে তিনি এর পারিশ্রমিক দিতেন না।\n" +
                    "\nসহীহ বুখারী, হা/২১০৩; মুসনাদে আহমাদ, হা/২৯০৬; মুসনাদে আবু ইয়ালা, হা/২২০৫: \n" +
                    "মুজামুল কাবীর লিত তাবারানী, হা/১২৪২০; মুসান্নাফে ইবনে আবি শাইবা, হা/২১৩৮২।\n" +
                    "হাদিসের মানঃ সহিহ\n"));
            linearLayout.addView(textArabic(
                    "حَدَّثَنَا هَارُونُ بْنُ إِسْحَاقَ ، قَالَ : حَدَّثَنَا عَبْدَةُ ، عَنِ ابْنِ أَبِي لَيْلَى ، عَنْ نَافِعٍ ، عَنِ ابْنِ عُمَرَ ، أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ , دَعَا حَجَّامًا فَحَجَمَهُ وَسَأَلَهُ : \" كَمْ خَرَاجُكَ ؟ \" فَقَالَ : ثَلاثَةُ آصُعٍ ، فَوَضَعَ عَنْهُ صَاعًا وَأَعْطَاهُ أَجْرَهُ \n"));
            linearLayout.addView(textField("ইবনে উমার (রাঃ) থেকে বর্ণিতঃ\n" +
                    "তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এক শিঙ্গালাগানেওয়ালাকে ডাকলেন। সে তাকে শিঙ্গা লাগাল। তিনি জিজ্ঞেস করলেন, তোমাকে দৈনিক কত দিতে হয়? সে বলল, প্রতিদিন তিন সা’। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর আদায়যোগ্য অর্থ এক সা’ কমিয়ে দিলেন এবং তাঁর পারিশ্রমিক দিয়ে দিলেন।\n" +
                    "\nমুসনাদে আহমাদ, হা/১১৩৬; সহীহ ইবনে হিব্বান, হা/৩৫৩৬; মুসনাদুত তায়ালুসী, হা/১৮২৯; \n" +
                    "মুসান্নাফে ইবনে আবি শাইবা, হা/২১৩৮৪।\n" +
                    "হাদিসের মানঃ সহিহ\n"));
            linearLayout.addView(textArabic(
                    "وَعَنِ ابْنِ عَبَّاسٍ رَضِيَ اللَّهُ عَنْهُمَا أَنَّهُ قَالَ: احْتَجَمَ رَسُولُ اللَّهِ - صلى الله عليه وسلم - وَأَعْطَى الَّذِي حَجَمَهُ أَجْرَهُ (1)، وَلَوْ كَانَ حَرَاماً لَمْ يُعْطِهِ. رَوَاهُ الْبُخَارِيُّ\n"));
            linearLayout.addView(textField("ইবনু ‘আব্বাস (রাঃ) থেকে বর্ণিতঃ\n" +
                    "তিনি বলেন নবী(সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) শিঙ্গা লাগালেন এবং যে তাকে শিঙ্গা লাগিয়েছে, তাকে তিনি মজুরী দিলেন । যদি তা হারাম হতো তবে তিনি তা দিতেন না ।\n" +
                    "\n[৯৭৬] বুখারী ১৮৩৫,১৯৩৮,১৯৩৯,২১০৩, মুসলিম ১২০২, তিরমিযী ৭৭৫,৭৭৬,৭৭৭, \n" +
                    "\nনাসায়ী ২৮৪৫,২৮৪৬, আবূ দাঊদ ১৮৩৫,১৮৩৬,২৩৭২, \n" +
                    "ইবনু মাজাহ ১৬৮২,৩০৮১,১৮৫২,১৯২২, দারেমী ১৮১৯,১৮২১ ।\n" +
                    "হাদিসের মানঃ সহিহ\n"));
            linearLayout.addView(textArabic(
                    "حديث أَنَسٍ رضي الله عنه، أَنَّهُ سُئِلَ عَنْ أَجْرِ الْحَجَّامِ، فَقَالَ: احْتَجَمَ رَسُولُ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَجَمَهُ أَبُو طَيْبَةَ، وَأَعْطَاهُ صَاعَيْنِ مِنْ طَعَامٍ، وَكَلَّمَ مَوَالِيَهُ فَخَفَّفوا عَنْهُ وَقَالَ: إِنَّ أَمْثَلَ مَا تَدَاوَيْتُمْ بِهِ الْحِجَامَةُ وَالْقُسْطُ الْبَحْرِيُّ\n"));
            linearLayout.addView(textField("আনাস (রাঃ) থেকে বর্ণিতঃ\n" +
                    "তাঁকে শিঙ্গা লাগানোর পারিশ্রমিক দানের ব্যাপারে প্রশ্ন করা হয়েছিল। তখন তিনি বলেনঃ রাসূলুল্লাহ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) শিঙ্গা লাগিয়েছেন। আবু তাইবা তাঁকে শিঙ্গা লাগায়। এরপর তিনি তাকে দু’ সা‘ খাদ্যবস্তু প্রদান করেন। সে তার মালিকের সঙ্গে এ ব্যাপারে আলোচনা করলে তারা তাঁর থেকে পারিশ্রমিকের পরিমাণ লাঘব করে দেয়। নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) আরো বলেনঃ তোমরা যে সকল জিনিসের দ্বারা চিকিৎসা কর, সেগুলোর মধ্যে সবচেয়ে উত্তম হল শিঙ্গা লাগানো এবং সামুদ্রিক চন্দন কাঠ ব্যবহার করা। তিনি আরো বলেছেনঃ তোমরা তোমাদের শিশুদের জিহবা, তালু টিপে কষ্ট দিও না। বরং তোমরা চন্দন কাঠ (ধোঁয়া) ব্যবহার করাও। \n" +
                    "\nবুখারী পর্ব ৭৬: /১৩, হা: ৫৬৯৬; মুসলিম ২২/১১, হাঃ ১৫৭৭\n" +
                    "হাদিসের মানঃ সহিহ\n"));
            linearLayout.addView(textArabic(
                    "حديث ابْنِ عَبَّاسٍ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ احْتَجَمَ، وَأَعْطَى الْحَجَّامَ أَجْرَهُ وَاسْتَعَطَ\n"));
            linearLayout.addView(textField("ইবনু ‘আব্বাস (রাঃ) থেকে বর্ণিতঃ\n" +
                    "নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) শিঙ্গা লাগিয়ে নিয়েছেন এবং যে শিঙ্গা লাগিয়ে দিয়েছে সে ব্যক্তিকে পারিশ্রমিক দিয়েছেন আর তিনি (শ্বাস দ্বারা) নাকে ঔষধ টেনে নিয়েছেন। \n" +
                    "\nবুখারী পর্ব ৭৬: /৯, হা: ৫৬৯১; মুসলিম ২২/১১, হাঃ ১২০২\n" +
                    "হাদিসের মানঃ সহিহ\n"));
            linearLayout.addView(textArabic(
                    "حديث ابْنِ عَبَّاسٍ رضي الله عنهما، قَالَ: احْتَجَمَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، وَأَعْطَى الْحَجَّامَ أَجْرَهُ\n"));
            linearLayout.addView(textField("ইবনু ‘আব্বাস (রাঃ) থেকে বর্ণিতঃ\n" +
                    "তিনি বলেন, নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) শিঙ্গা নিয়েছিলেন এবং শিঙ্গা প্রয়োগকারীকে তার মজুরী দিয়েছিলেন। \n" +
                    "\nবুখারী পর্ব ৩৭ অধ্যায় ১৮ হাদীস নং ২২৭৮; মুসলিম ৩৯/২৬, হাঃ ১২০২\n" +
                    "হাদিসের মানঃ সহিহ\n"));
            linearLayout.addView(textArabic(
                    "حديث أَنَسٍ رضي الله عنه، قَالَ: كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، يَحْتَجِمُ، وَلَمْ يَكُنْ يَظْلِم أَحَدًا أَجْرَهُ\n"));
            linearLayout.addView(textField("আনাস (রাঃ) থেকে বর্ণিতঃ\n" +
                    "নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) শিঙ্গা লাগাতেন এবং কোন লোকের পারিশ্রমিক কম দিতেন না। \n" +
                    "\nবুখারী পর্ব ২৭ অধ্যায় ১৮ হাদীস নং ২২৮০; মুসলিম ৩৯/২৬, হাঃ ১৫৭৭\n" +
                    "হাদিসের মানঃ সহিহ হাদিস "));
            linearLayout.addView(textHeader("\nরোগ অনুযায়ী চিকিৎসা বিভিন্ন রকমঃ\n"));
            linearLayout.addView(textArabic("حديث جَابِرِ بْنِ عَبْدِ اللهِ رضي الله عنهما، قَالَ: سَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، يَقُولُ: إِنْ كَانَ فِي شَيْءٍ مِنْ أَدْوِيَتِكُمْ، أَوْ يَكُونُ فِي شَيْءٍ مِنْ أَدْوِيَتِكُمْ، خَيْرٌ، فَفِي شَرْطَةِ مِحْجَمٍ، أَوْ شَرْبَةِ عَسَلٍ، أَوْ لَذْعَةٍ بِنَارٍ تُوَافِقُ الدَّاءَ، وَمَا أُحِبُّ أَنْ أَكْتَوِيَ\n"));
            linearLayout.addView(textField("জাবির ইবনু ‘আবদুল্লাহ (রাঃ) থেকে বর্ণিতঃ\n" +
                    "তিনি বলেন, আমি নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-কে বলতে শুনেছিঃ তোমাদের ঔষধসমূহের কোনটির মধ্যে যদি কল্যাণ বিদ্যমান থেকে থাকে তাহলে তা রয়েছে শিঙ্গাদানের মধ্যে কিংবা মধু পানের মধ্যে কিংবা আগুনের দ্বারা ঝলসিয়ে দেয়ার মধ্যে। তবে তা রোগ অনুযায়ী হতে হবে। আর আমি আগুন দ্বারা দাগ দেয়াকে পছন্দ করি না। \n" +
                    "\nবুখারী পর্ব ৭৬ অধ্যায় ৪ হাদীস নং ৫৬৮৩; মুসলিম ৩৯/২৬, হাঃ ২২০৫\n" +
                    "হাদিসের মানঃ সহিহ"));
            linearLayout.addView(textHeader("\nহিজামার তারিখ\n"));
            linearLayout.addView(textArabic("حَدَّثَنَا عَبْدُ الْقُدُّوسِ بْنُ مُحَمَّدٍ الْعَطَّارُ الْبَصْرِيُّ ، قَالَ : حَدَّثَنَا عَمْرُو بْنُ عَاصِمٍ ، قَالَ : حَدَّثَنَا هَمَّامٌ ، وَجَرِيرُ بْنُ حَازِمٍ ، قَالَ : حَدَّثَنَا قَتَادَةُ ، عَنْ أَنَسِ بْنِ مَالِكٍ ، قَالَ : \" كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَحْتَجِمُ فِي الأَخْدَعَيْنِ وَالْكَاهِلِ ، وَكَانَ يَحْتَجِمُ لِسَبْعَ عَشْرَةَ , وَتِسْعَ عَشْرَةَ , وَإِحْدَى وَعِشْرِينَ \" \n"));
            linearLayout.addView(textField("আনাস ইবনে মালিক (রাঃ) থেকে বর্ণিতঃ\n" +
                    "তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কাঁধের দু’ পার্শ্বে এবং কাঁধের মধ্যবর্তী স্থানে শিঙ্গা লাগাতেন এবং তিনি ১৭, ১৯ ও ২১ তারিখে শিঙ্গা লাগাতেন।\n" +
                    "\nশারহুস সুন্নাহ, হা/৩২৩৪; সহীহ তারগীব ওয়াত তারহীব, হা/৩৪৬৪; মিশকাত, হা/৪৫৪৬।\n" +
                    "হাদিসের মানঃ সহিহ"));
            linearLayout.addView(textHeader("\nহিজামার স্থান\n"));
            linearLayout.addView(textArabic("حَدَّثَنَا عَبْدُ الْقُدُّوسِ بْنُ مُحَمَّدٍ الْعَطَّارُ الْبَصْرِيُّ ، قَالَ : حَدَّثَنَا عَمْرُو بْنُ عَاصِمٍ ، قَالَ : حَدَّثَنَا هَمَّامٌ ، وَجَرِيرُ بْنُ حَازِمٍ ، قَالَ : حَدَّثَنَا قَتَادَةُ ، عَنْ أَنَسِ بْنِ مَالِكٍ ، قَالَ : \" كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَحْتَجِمُ فِي الأَخْدَعَيْنِ وَالْكَاهِلِ ، وَكَانَ يَحْتَجِمُ لِسَبْعَ عَشْرَةَ , وَتِسْعَ عَشْرَةَ , وَإِحْدَى وَعِشْرِينَ \" \nحَدَّثَنَا إِسْحَاقُ بْنُ مَنْصُورٍ ، قَالَ : أَنْبَأَنَا عَبْدُ الرَّزَّاقِ ، عَنْ مَعْمَرٍ ، عَنْ قَتَادَةَ ، عَنْ أَنَسِ بْنِ مَالِكٍ : \" أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ احْتَجَمَ وَهُوَ مُحْرِمٌ بِمَلَلٍ عَلَى ظَهْرِ الْقَدَمِ \"\n"));
            linearLayout.addView(textField("আনাস ইবনে মালিক (রাঃ) থেকে বর্ণিতঃ\n" +
                    "রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ইহরাম বাধা অবস্থায় পায়ের পাতার উপরিভাগে মালাল নামক স্থানে শিঙ্গা লাগালেন।\n" +
                    "\nআবু দাউদ, হা/১৮৩৯; সুনানে নাসাঈ, হা/২৮৪৯; মুসনাদে আহমাদ, হা/১২৭০৫; \n" +
                    "সহীহ ইবনে হিব্বান, হা/৩৯৫২ শারহুস সুন্নাহ, হা/১৯৮৬।\n" +
                    "হাদিসের মানঃ সহিহ "));
            linearLayout.addView(textHeader("\nহিজামার পরে গোসল\n"));
            linearLayout.addView(textArabic("وَعَنْ عَائِشَةَ أَنَّ النَّبِيَّ ﷺ كَانَ يَغْتَسِلُ مِنْ اَرْبَعٍ مِّنَ الْجَنَابَةِ وَيَوْمَ الْجُمُعَةِ وَمِنَ الْحَجَامَةِ وَمِنْ غُسْلِ الْمَيِّتِ. رَوَاهُ أَبُوْ دَاوٗدَ\n"));
            linearLayout.addView(textField("আয়িশাহ্ (রাঃ) থেকে বর্ণিতঃ\n" +
                    "নাবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) চারটি কারণে গোসল করতেনঃ (১) অপবিত্রতা, (২) জুমু‘আহ্\u200C, (৩) হিজামা লাগানোর পর (অর্থাৎ-শরীর থেকে রক্ত বের হলে) এবং (৪) মৃত ব্যক্তির গোসল দেবার পর।\n" +
                    "\nয‘ঈফ : আবূ দাঊদ ৩৪৮। কারণ এর সানাদে মুস্‘আব ইবনু শায়বাহ্ সর্বসম্মতিক্রমে দুর্বল।\n" +
                    "হাদিসের মানঃ দুর্বল "));

        } else if (identifier == 9) {
            toolbar.setTitle("চাঁদের সাথে হিজামার সম্পর্ক");

            linearLayout.addView(textField("ইসলাম এক পূর্ণাঙ্গ, শাশ্বত এবং বিজ্ঞানসম্মত জীবনব্যবস্থার নাম। এর প্রতিটি বিধানের রয়েছে বৈজ্ঞানিক ভিত্তি। মানবতার সর্বশেষ নবী মুহাম্মদ সা: বৈজ্ঞানিক ছিলেন না। তিনি ছিলেন আল্লাহ প্রেরিত রাসূল। তাঁর যুগে বিজ্ঞান-প্রযুক্তি প্রসার লাভও করেনি। তবুও বর্তমানে বিজ্ঞানের চরম উৎকর্ষতার যুগে তাঁর জীবনের প্রতিটি কর্ম ও নির্দেশনা রহস্যময় এক বৈজ্ঞানিক ভিত্তি। বিভিন্ন যুগের বৈজ্ঞানিকরা অনুসন্ধিৎসু দৃষ্টিতে তাঁর নির্দেশিত প্রতিটি কাজ, চিন্তাভাবনা, নিয়মনীতি, আইনকানুনের প্রতি মনোনিবেশ করেছেন সেই মহারহস্য উদঘাটন প্রত্যাশায়। অতলান্ত মহাসাগর রোমান্থন দুঃসাধ্য হলেও ফলদায়ক। অতলান্ত মহাসাগরের মতো বিশাল বিস্তৃত মহানবী সা:-এর বর্ণাঢ্য জীবনের সব দিক ও বিভাগ নিয়ে গবেষণা কোনো একক ব্যক্তির পে সম্ভব নয়। এ জন্যই বৈজ্ঞানিকরা তাঁর বর্ণিল জীবনের এক একটি দিক নিয়ে গবেষণায় ব্রত হয়েছেন। উৎসের সন্ধানে : আবু হুরাইরা রা: থেকে বর্ণিত, তিনি বলেন : ‘আমার প্রিয়তম বন্ধু আমাকে তিনটি ব্যাপারে বিশেষভাবে অসিয়ত করেছেন : ১. প্রতি মাসে তিন দিন রোজা রাখা, ২. দুই রাকাত সালাতুত্ দুহা আদায় করা এবং ৩. রাতে ঘুমানোর আগেই যেন বিতর নামাজ আদায় করি (বুখারি)। আব্দুল মালেক বিন কুদামাহ বিন মালহান রা: বলেন : ‘রাসূলুল্লাহ সা: আমাদেরকে আইয়ামে বীজ তথা চন্দ্রমাসের ১৩, ১৪ ও ১৫ তারিখে রোজা রাখার নির্দেশ দিতেন’ (আবু দাউদ)। রাসূলুল্লাহ সা: বলেন : ‘প্রতি মাসে তিনটি রোজা একযুগ রোজার সমতুল্য, মনোরম সে দিন তিনটি হলো ১৩, ১৪ ও ১৫’ (নাসায়ী)। ইবনু আব্বাস রা: বলেন : ‘রাসূলুল্লাহ সা: সফর ও মুকিম অবস্থায় কখনো আইয়ামে বীজের রোজা ভঙ্গ করতেন না’ (নাসায়ী)। রাসূল সা: বলেন : ‘কোনো মাসে তিনটি রোজা রাখলে ১৩, ১৪ ও ১৫ তারিখ রাখবে’ (আহমদ)।\n" +
                    "\nএসব হাদিস থেকে প্রমাণ হয়, রাসূল সা: তাঁর প্রিয় সাথীদের আইয়ামে বীজের রোজা রাখার জন্য বিশেষভাবে নির্দেশ দিতেন; কিন্তু এই নির্দেশ আবশ্যকতার ভঙ্গিতে ছিল না বরং তা ছিল নফল তথা অতিরিক্ত আমল হিসেবে। তিনি সাহাবিদের এই রোজা রাখতে বলতেন; কিন্তু তাদের সবাই এ নির্দেশ পালন করতেন না, যা থেকে প্রমাণ হয়, তাঁর এ নির্দেশ নফল হিসেবে ছিল ওয়াজিব হিসেবে নয়।\n" +

                    "\nআইয়ামে বীজের পরিচিতি : আইয়ামে বীজ আরবি দু’টি শব্দের সমন্বয়ে গঠিত। আইয়ামে অর্থ দিবসসমূহ, আর বীজ অর্থ শুভ্র, সাদা, শ্বেত, খাঁটি, নির্ভেজাল...। চন্দ্র মাসের ১৩, ১৪ ও ১৫ তারিখকে আইয়ামে বীজ বলা হয়। ওই তিন দিনে চাঁদ পূর্ণতা লাভ করে, প্রচণ্ড আলো বিকিরণ করে, চাঁদের আলো কানায় কানায় ভরে যায়, জোসনার প্রচণ্ডতায় ওই রাতগুলো শুভ্র ধবধবে ও আলোকিতভাবে দিনের আলোর মতো দৃশ্যমান হয়। এ দৃশ্য সবাই অবলোকন করে, বিশেষত মরুভূমিতে এটি বেশি দৃষ্টিগোচর হয়। আলোকিত ওই রাতগুলোকে দিনের সাথে সম্পৃক্ত করে ‘আইয়ামে বীজ’ নামকরণ করা হয়েছে। উল্লেখ্য, আরবিতে ইয়াওম শব্দ দ্বারা দিন ও রাত উভয়কে অন্তর্ভুক্ত করে। ফাতহুল বারিতে বলা হয়েছে : ‘বীজ বলতে ওই সব রজনীই উদ্দেশ্য, যাতে রাতের প্রথম থেকে শেষ পর্যন্ত চাঁদ দৃশ্যমান হয়।’\n" +
                    "\nআইয়ামে বীজের রোজার বৈজ্ঞানিক দিক : আইয়ামে বীজের রোজার তারিখ রাসূল সা: নির্ধারণ করেছেন চন্দ্র মাসের ১৩, ১৪ ও ১৫। আরবি মাস ২৯ বা ৩০ দিন হয়ে থাকে। মাসের যেকোনো তিন দিন রোজা রাখার নির্দেশ না দিয়ে তিনি কেন ওই তিন দিনকে নির্দিষ্ট করলেন? আমাদের মনে এ ধরনের প্রশ্ন জাগ্রত হওয়া স্বাভাবিক। মূলত আইয়ামে বীজের রোজার মধ্যে লুকায়িত রয়েছে এক মহারহস্য, রয়েছে হিকমাতে নববীয়্যাহর এক চূড়ান্ত বিস্ময়। এ রহস্য জানতে হলে ‘ভূপৃষ্ঠ ও মানবদেহের মধ্যকার সৃষ্টিগত সম্পর্ক’ এবং ‘চাঁদ-ভূপৃষ্ঠ ও মানবদেহের সম্পর্ক’ বিষয়ক দু’টি বৈজ্ঞানিক দৃষ্টিভঙ্গি জানা একান্ত প্রয়োজন।\n" +
                    "\nভূপৃষ্ঠ ও মানবদেহের মধ্যকার সৃষ্টিগত সম্পর্ক : সৃষ্টিগত দিক থেকে ভূপৃষ্ঠ ও মানবদেহের মধ্যে রয়েছে এক সুদৃঢ় সম্পর্ক। ভূপৃষ্ঠের ৮০ ভাগ তরল পানি (তথা নদী ও সাগর) এবং ২০ ভাগ কঠিন পদার্থের সমন্বয়ে গঠিত। ভূপৃষ্ঠ বিভিন্ন উপাদানে গঠিত, যেমন- ক্যালসিয়াম, ম্যাগনেসিয়াম, সোডিয়াম, লৌহ, নাইট্রিক এসিড, বাইকার্বনেট ইত্যাদি। মানবদেহও এসব উপাদানের সমন্বয়ে গঠিত। এটাই বিজ্ঞানের সর্বশেষ গবেষণালব্ধ ফলাফল। একটি মিনারেল ওয়াটারের বোতল হাতে নিয়ে এর উপকরণগুলোর দিকে দৃষ্টি দিলে দেখা যায়, তা-ও একই উপাদানে গঠিত। এ পানি নলকূপ, কুয়া বা ঝরনার মাধ্যমে উত্তোলন করা হোক অথবা সাগর বা নদী থেকে পরিশোধন করে প্রস্তুত করা হোক। অতএব আমরা পানি পান করলে আমাদের শরীর এসব উপাদানে গঠিত হবে এটাই স্বাভাবিক। একইভাবে আমরা শাকসবজি, ফলমূল বা মাটি থেকে উৎপন্ন অন্যান্য খাদ্যের ওপর অনুসন্ধান চালালে দেখতে পাই, সব কিছু একই উপাদানে গঠিত। যদিও উপকরণের পরিমাণের তারতম্য রয়েছে। এসব খাদ্য-খাবার গ্রহণ করলে আমাদের দেহও এসব উপকরণের সমন্বয়ে গড়ে ওঠে।\n" +

                    "\nমানবদেহ ও মাটির মধ্যে রয়েছে এক দৃঢ় সম্পর্ক। মানুষ মাটি থেকে সৃষ্ট, এ জন্য তার মধ্যে রয়েছে মাটি তথা ভূপৃষ্ঠের উপকরণ। আল্লাহর বাণী: ‘তিনি কর্দম থেকে মানব সৃষ্টির সূচনা করেছেন’ (সূরা আস্ সাজদা: ৭)।\n" +
                    "\nএকইভাবে মানুষ সৃষ্টির উপাদানে রয়েছে পানি। আল্লাহ বলেন: ‘এবং তিনিই মানুষকে সৃষ্টি করেছেন পানি থেকে’ (আল-ফুরকান : ৫৪)। তিনি আরো বলেন : ‘আল্লাহ সব জীব সৃষ্টি করেছেন পানি থেকে’ (সূরা আন্ নূর : ৪৫)। অতএব মানুষের মধ্যে মাটি ও পানির উপকরণ বিদ্যমান থাকায় মানুষ এ দু’টির আকর্ষণ ও বিকর্ষণের শিকার।\n" +
                    "\nচাঁদ-মাটি ও চাঁদ-মানুষের মধ্যকার সম্পর্ক : অন্য দৃষ্টিকোণ থেকে চাঁদ ও মাটি এবং চাঁদ ও মানবদেহের মধ্যে রয়েছে এক বিজ্ঞানময় সম্পর্ক। বৈজ্ঞানিকভাবে এ কথা স্বীকৃত যে, চাঁদের নিজস্ব মাধ্যাকর্ষণ শক্তি রয়েছে। এ মাধ্যাকর্ষণ শক্তির প্রভাব পৃথিবীর ওপর স্পষ্টত দৃশ্যমান হয়। এরই ফলে সাগর, নদ-নদীতে জোয়ার-ভাটার সৃষ্টি হয়। মাটি থেকে তৈরি হওয়ার কারণে, ভূপৃষ্ঠে বসবাস করার কারণে এবং মানবদেহে ভূপৃষ্ঠের উপাদান বর্তমান থাকায় মানুষের ওপরও চাঁদের এ মাধ্যাকর্ষণ শক্তির প্রভাব পড়ে। \n" +
                    "\n১৩, ১৪ ও ১৫ তারিখে ভূপৃষ্ঠ ও মানুষের ওপর চাঁদের প্রভাব : আইয়ামে বীজ তথা চন্দ্র মাসের ১৩, ১৪ ও ১৫ তারিখ চাঁদ পূর্ণতা পায়। এ জন্য এ সময়ে মাটি ও মানুষের ওপর এর প্রভাবও পড়ে সর্বোচ্চ। ফলত ভূপৃষ্ঠ ও মানুষের অভ্যন্তরে এ আকর্ষণের মাত্রাও বৃদ্ধি পায়। ভূভাগে এ আকর্ষণ প্রকাশিত হয় সাগর-নদীতে জোয়ার-ভাটার মাধ্যমে আর মানুষের মধ্যে এটির প্রকাশ ঘটে চঞ্চলতা, আবেগ-উদ্বেগ, গোঁড়ামি, দুঃশ্চিন্তা, অস্থিরতা, মানবিক ও স্নায়ুবিক উত্তেজনা ইত্যাদি বৃদ্ধির মাধ্যমে, যার সর্বশেষ ফলাফল দাঁড়ায় অপরাধপ্রবণতা বৃদ্ধির মাধ্যমে। ইবনে সীনা (৯৮০-১৩৭ খ্রি.) তাঁর ‘আল-কানুন ফীত্-তীব’ গ্রন্থে বলেন : ‘মাসের প্রথম ভাগে শিঙ্গা লাগাতে নিষেধ করা হয়েছে, কারণ এ সময়ে মিক্সার ঠিক মতো প্রভাব বিস্তার করতে পারে না। একইভাবে মাসের শেষ ভাগেও শিঙ্গা ব্যবহার না করতে বলা হয়েছে। কারণ এ সময়ে এর কার্যকরণ মতা হ্রাস পায়; বরং মাসের মধ্যার্ধে এর ব্যবহারের নির্দেশ এসেছে, যাতে চাঁদের আলো ও আকর্ষণ বৃদ্ধির সাথে সাথে মিক্সারের কার্যকরণ মতার পূর্ণতা পায়।’\n" +

                    "\nআইয়ামে বীজের সময়কালে ভূপৃষ্ঠের ওপর এই প্রভাবের প্রমাণ পাওয়া যায় এ দিনগুলোতে নদী-সাগর পাড়ে গেলে। কেননা এ সময়ে জোয়ার ও ভাটা সর্বোচ্চ সীমায় অবস্থান করে এবং পানির তীব্রতা বেড়ে যায়। দেখা যায় অন্য সময়ে জোয়ারে যত পানি থাকে এ সময়ে ভাটাতে সমপরিমাণ পানি থাকে। একইভাবে মানুষের ওপর চাঁদের এ প্রভাবের প্রমাণ পাওয়া যায় ওই দিনগুলোতে আদালত, পুলিশ থানা বা বিচারালয়ে গেলে। দেখা যায়, বড় বড় অপরাধ, হত্যা, চুরি, বিচ্ছেদ, ধর্ষণ ইত্যাদি এ সময়কালে বৃদ্ধি পায়। ‘রোজা ঢালস্বরূপ’ হওয়ায় প্রবৃত্তির যাবতীয় খামখেয়ালিপনা থেকে নিজেকে বিরত রাখা সম্ভব হয়। রাসূলুল্লাহ সা: কর্তৃক আইয়ামে বীজের রোজার অসিয়তের মধ্যে তা-ই নিহিত রয়েছে এক চিরন্তন মুজিজা। চাঁদের পূর্ণতা ও মানবীয় অপরাধপ্রবণতা বৃদ্ধির এ দিনগুলোতে রোজা মানবিক উৎকর্ষতা সাধন, অপরাধ নিয়ন্ত্রণ, বিভিন্ন দুর্ঘটনা নিয়ন্ত্রণের এক বিজ্ঞানময় পদ্ধতির বহিঃপ্রকাশ, যা একজন উম্মি নবীর গৃহীত বাস্তবমুখী এক কর্মসূচি। \n" +
                    "\nঅতএব মানুষের আত্মিক, মানবিক, পারিবারিক, সামাজিক ও আন্তর্জাতিক জীবনের বিভিন্ন সমস্যা দূরীকরণের েেত্র আইয়ামে বীজের রোজা এক গুরুত্বপূর্ণ ভূমিকা রাখতে পারে। মূলত ইসলামের প্রতিটি বিধানই বিজ্ঞানসম্মত। আধুনিক বিজ্ঞানের চরম উৎকর্ষতার যুগে এটাই প্রমাণ হয়েছে যে, ইসলামের বিধিবিধান অনুযায়ী জীবনযাপনই মানুষের দৈহিক, আত্মিক, মানসিক ও পারিপার্শ্বিক উৎকর্ষতার একমাত্র গ্যারান্টি। অতএব প্রতিটি মুসলমান তথা গোটা মানবতার উচিত রাসূলুল্লাহ সা: প্রদর্শিত জীবনপদ্ধতি অনুযায়ী জীবন পরিচালনা করা। \n" +
                    "\nতবেই আমরা সেই মানুষের দলভুক্ত হতে পারব, যাদের সম্পর্কে আল্লাহর নবী করীম সা: বলেন : ‘ঈমানের দিক থেকে ওই সব লোক সর্বাধিক আশ্চর্যজনক, যারা আমার পরে আগমন করবে, তারা আমার প্রতি ঈমান আনবে অথচ তারা আমাকে দেখেনি। তারা আমার সত্যতার প্রমাণ দিবে অথচ তারা আমাকে দেখেনি; তারা আমার ভাই’ (তাবরানি)।\n" +
                    "\n১৯৭৮ থেকে ১৯৮২ এর মধ্যে কয়েকজন খ্যাতনামা বিজ্ঞানী গবেষণা মাধ্যমে সিদ্ধান্থে আসেন, পূর্ণচন্দ্র শুধুমাত্র মানুষের আবেগ বা চঞ্চলতাই বৃদ্ধি করে না, মানুয়ের অপরাধ প্রবণতাকেও জাগিয়ে দেয়। তাঁদের আরও বক্তব্য যে, এ সময়ে চাঁদের আলো এবং আকর্ষণ মানুষের শারীরিক ও মানসিক শক্তির অবনতি, বিভিন্ন প্রকার রোগ, হত্যা এবং আত্বহত্যা করার মানসিকতার সহায়ক হয়ে উঠে।১৯৬৩ সালে লন্ডন বিশ্ববিদ্যালয় ফরেনসিক সায়েন্স - ভেষজ বিজ্ঞান, রোগনিদান তত্ত্ব ও বিষ বিজ্ঞান সম্বন্ধে একটি আন্তর্জাতিক আলোচনা চক্রে পৃথিরীর খ্যাতনামা বিজ্ঞানীরা অংশ গ্রহণ করেন।সেখানে ম্যাসাচুসেটস্\u200C বিশ্ববিদ্যালয়ের বিজ্ঞানী ডঃ জ্যানিনো একটি গবেষণা পত্র উপস্থাপিত করে বলেন, সাহিত্য এবং প্রাচীন জনশ্রুতিতে চাঁদের প্রভাবে মানুষের সামাজিক মতিভ্রম বা উম্মত্ততা-কুসংস্কার বা উদ্ভট কল্পনা নয়, সত্যই চাঁদ মানুষকে প্রভাবিত করে।ডঃ জ্যানিনো চাঁদের প্রভাব সম্বন্ধে বহু যুক্তিপূর্ণ বক্তব্যের উপসংহারে বলেন, শারীর বৃত্তীয় পরীক্ষার দ্বারা প্রমাণিত হয়েছে যে, পূর্ণিমা ও অমাবস্যায় মানুষের দেহের তড়িৎ বিভব বৃদ্ধি পায়।\n" +
                    "\nল্যাটিন ভাষায় চাঁদকে লুনা বলে।এই লুনাই উন্মাদনা সৃষ্টির কারক বলে উন্মাদ কথার ইংরেজী লুনাটিক শব্দের উৎপত্তি মহাকবি মিল্টন তার ‘প্যারাডাইস লষ্ট’ মহাকাব্যে মানুয়ের মস্তিষ্কের সঙ্গে চাঁদের সংযোগ কথা উল্লেখ করেছেন।"));
            linearLayout.addView(textHeader("\nমানুষ ও পশুপাখির ওপর চাঁদের প্রভাব জনিত গবেষণাঃ \n"));
            linearLayout.addView(textLink("১। ", "https://www.ncbi.nlm.nih.gov/pubmed/16407788", "The lunar cycle: effects on human and animal behavior and physiology"));
            linearLayout.addView(textLink("২। ", "https://en.wikipedia.org/wiki/Lunar_effect", "Lunar Effect (Wiki)"));
            linearLayout.addView(textLink("৩। ", "https://www.sciencedaily.com/releases/2016/05/160506105645.htm", "Does the moon affect our mood or actions?"));
            linearLayout.addView(textLink("৪। ", "http://danettemay.com/moon-affects-body-mood/", "6 WAYS THE MOON IS AFFECTING YOUR BODY"));
            linearLayout.addView(textLink("৫। ", "https://www.bustle.com/articles/185033-7-ways-the-full-moon-supposedly-affects-the-human-body", "7 Ways The Full Moon Supposedly Affects The Human Body"));
            linearLayout.addView(textLink("৬। ", "https://www.researchgate.net/publication/233538511_A_study_on_the_physical_fitness_index_heart_rate_and_blood_pressure_in_different_phases_of_lunar_month_on_male_human_subjects", "A study on the physical fitness index, heart rate and blood pressure in different phases of lunar month on male human"));
            linearLayout.addView(textLink("৭। ", "http://www.curiousmeerkat.co.uk/indepth/moon-affects-us/", "HOW THE MOON AFFECTS US"));
            linearLayout.addView(textLink("৮। ", "http://www.fibrozone.com/fibromyalgia/fibromyalgiablog/autoimmune/cfs/rheumatoidarthritis/sjogrens/lupus/fibromyalgia-symptoms-affected-moon-phases/", "FIBROMYALGIA SYMPTOMS AFFECTED BY MOON PHASES?"));
            linearLayout.addView(textLink("৯। ", "https://www.quora.com/Why-does-arthritis-pain-increase-during-a-full-moon", "Why does arthritis pain increase during a full moon?"));
            linearLayout.addView(textLink("১০। ", "https://drive.google.com/file/d/10bJ8o8MokLqJChyWlobqQx4BfpMCWg__/view", "Impact of gravitational interaction between the Moon and the Earth on the occurrence of episodes of cardiogenic pulmonary edema in the field."));

        } else if (identifier == 10) {
            toolbar.setTitle("বিভিন্ন রোগে হিজামা কিভাবে কাজ করে?");
            linearLayout.addView(textHeader("১। কার্ডিয়াক প্রবলেম"));
            linearLayout.addView(textField("হিজামার জন্য যখন স্ক্র্যাচ করা হয় তখন স্কিন এর নিচের বেসমেন্ট মেমব্রেনে অবস্থিত ছোট ছোট রক্তনালীগুলোতে ইনজুরি হয়। আর এই ইনজুরি থেকেই তৈরি হয় নাইট্রিক অক্সাইড। \n\n" +
                    "Nitric oxide has gotten the most attention due to its cardiovascular benefits. Alfred Nobel, the founder of the Nobel Prize, was prescribed nitroglycerin over 100 years ago by his doctor to help with his heart problems. He was skeptical, knowing nitroglycerin was used in dynamite, but this chemical helped with his heart condition. Little did he know nitroglycerin acts by releasing nitric oxide which relaxes narrowed blood vessels, increasing oxygen and blood flow." +
                    "\n\nThe interior surface (endothelium) of your arteries produce nitric oxide. When plaque builds up in your arteries, called atherosclerosis, you reduce your capacity to produce nitric oxide, which is why physicians prescribe nitroglycerin for heart and stroke patients."));
            linearLayout.addView(textHeader("\n২। ক্যান্সার\n"));
            linearLayout.addView(imageField(R.drawable.hijama_nitric9));
            linearLayout.addView(textHeader("\nবিস্তারিত জানতেঃ\n"));
            linearLayout.addView(textLink("১। ", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3669621/", "Nitric oxide and cancer: a review"));
            linearLayout.addView(textLink("২। ", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4819660/", "The Potential Role of Nitric Oxide in Halting Cancer Progression Through Chemoprevention"));
            linearLayout.addView(textHeader("\n৩। কিডনি ডিজিজ"));
            linearLayout.addView(textField("There is increasing evidence that nitric oxide (NO) is one of the most important paracrine modulators " +
                    "and mediators in the control of renal functions, such as overall and regional renal blood flow (RBF), renal autoregulation, " +
                    "glomerular filtration, renin secretion and salt excretion. NO also plays an important role in the pathogenesis of " +
                    "several renal disease states, such as diabetic nephropathy, inflammatory glomerular disease, acute renal failure in septic " +
                    "shock, chronic renal failure and nephrotoxicity of drugs, conveying both beneficial effects via its hemodynamic functions and " +
                    "detrimental effects via its cytotoxicity when produced in large amounts by inducible nitric oxide synthase (iNOS). " +
                    "\n\nThe extensive literature on these pathophysiological functions of NO will not be covered here, and the reader is " +
                    "referred to the pertinent chapters (Chaps. 18,.21, 22, 23) for discussion. In the kidney an unusually large diversity of " +
                    "cells of different types is integrated in a delfuate' and complex architecture, forming various types of functional units. " +
                    "The complexity of the spatial arrangement of cells in these functional units, fmrexample in the glomerulus and the " +
                    "juxtaglomerular apparatus (JGA), is not only a crucial prerequisite for proper functioning but also a serious obstacle of " +
                    "the analysis of these functions. \n\nThis problem also extends to the analysis of the intrarenal functions of NO, " +
                    "and much of the interpretation of data rests on assumptions made as to both the site of formation and the target of " +
                    "NO in each particular experiment. For this reason, a brief survey of the distribution of NOS isoforms in the kidney " +
                    "is given first. For more extensive information, the reader is referred to recent reviews (BACHMANN and MUNDEL 1994; " +
                    "BACHMANN 1997; KONE and BAYLIS 1997; STAR 1997). "));


            linearLayout.addView(textLink("• ", "https://link.springer.com/chapter/10.1007/978-3-642-57077-3_15", "The Role of Nitric Oxide in Kidney Function"));
            linearLayout.addView(textLink("• ", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4588324/", "Nitric oxide status in patients with chronic kidney disease"));
            linearLayout.addView(textLink("• ", "http://www.life-enhancement.com/magazine/article/124-arginine-keeps-kidneys-in-the-pink", "Arginine Keeps Kidneys in the Pink "));
            linearLayout.addView(textLink("• ", "https://academic.oup.com/jn/article/134/10/2801S/4688510", "Role of L-Arginine in the Pathogenesis and Treatment of Renal Disease"));
            linearLayout.addView(textLink("• ", "https://drive.google.com/file/d/1_DY46w67agNSsfAYGp-D1sKvwcOz9Kvw/view", "The role of Nitric Oxide in Hypertension and Renal disease progression"));
            linearLayout.addView(textHeader("\n৪। পেশীর ব্যাথা"));
            linearLayout.addView(textHeader("৫। মাইগ্রেন"));
            linearLayout.addView(textHeader("৬। যে কোন ব্যাকটেরিয়াল, ভাইরাল বা ফাংগাল ইনফেকশান"));
            linearLayout.addView(textHeader("৭। অটোইম্মিউন ডিজিজ"));
            linearLayout.addView(textHeader("৮। নিউরলজিক্যাল প্রব্লেম"));
            linearLayout.addView(textHeader("৯। সাইকোলজিক্যাল প্রব্লেম"));
            linearLayout.addView(textHeader("১০। যৌন সমস্যা"));
        } else if (identifier == 12) {
            toolbar.setTitle("হিজামার আগে ও পরের বিষয়গুলো");

            linearLayout.addView(textField("• খালি পেটে হিজামা করা উত্তম।\n" +
                    "\n• হিজামার পূর্বে গোসল করে নেয়া উত্তম।\n" +
                    "\n• সম্ভব হলে সুন্নাহ তারিখ বা বারে হিজামা করানো উত্তম, তবে প্রয়োজনে হিজামা যে কোন সময়ে করা যায়।\n" +
                    "\n• সূর্যোদয়ের পর থেকে সূর্যাস্তের পূর্বে হিজামা করা উত্তম। \n" +
                    "\n• যে সকল ঔষধ বা রোগে রক্ত জমাট বাঁধতে দেরী হয় বা জমাট বাঁধে না বা অন্যান্য জটিল রোগাক্রান্তদের ক্ষেত্রে অভিজ্ঞ ডাক্তার এর পরামর্শ ছাড়া হিজামা করা নিষেধ।\n" +
                    "\n• হিজামার আগে ও পরে ২৪ ঘন্টা যৌন মিলন না করা উচিৎ।\n" +
                    "\n• হিজামার পরের ২৪ ঘন্টা কঠোর পরিশ্রম থেকে বিরত থাকা উচিৎ।\n" +
                    "\n• আপনি কি কি ঔষধ খাচ্ছেন তা ডাক্তার বা থেরাপিস্টকে এ্যাপয়েন্টমেন্ট নেওয়ার সময়ই জানিয়ে দেবেন।\n" +
                    "\n• আপনি যদি কোন সংক্রামক ব্যাধিতে আক্রান্ত হয়ে থাকেন তবে তা হিজামার পূর্বেই ডাক্তার বা থেরাপিস্টকে জানাবেন।\n" +
                    "\n• যে সকল রোগে রক্ত জমাট বাঁধে না সে সকল রোগে আক্রান্তরা অবশ্যই ডাক্তার বা থেয়ারাপিস্টকে জানাবেন।\n" +
                    "\n• আপনার যদি কোন খাবারে এ্যালার্জি থাকে তবে হিজামার পরে ২৪ ঘন্টা এমন খাবার খাওয়া থেকে বিরত থাকবেন।\n" +
                    "\n• যারা অন্তঃসত্ত্বা তারা জীবনের ঝুঁকি না থাকলে হিজামা করা থেকে বিরত থাকবেন। কারন হিজামা এ্যাবোরশান এর কারন হতে পারে।"));

        } else if (identifier == 14) {
            toolbar.setTitle("কতদিন পরপর হিজামা করা যায়?");

            linearLayout.addView(textField("হিজামার জন্য যে আচড় বা স্ক্র্যাচ দেয়া হয়, সেটা যদি ঠিক ভাবে হয় তবে তা প্রাইমারি হিলিং মেকানিজম অর্থাৎ ২৪ ঘন্টার মধ্যে হিল (heal) হয়ে যাবে। তাই প্রয়োজনে ২৪ ঘন্টা পরই একই স্থানে হিজামা করা যাবে। "));
            linearLayout.addView(imageField(R.drawable.hijama_time));
            linearLayout.addView(textField("সমস্যার গভীরতা অনুযায়ী আমরা বিভিন্ন ইন্টারভেলে হিজামা করতে বলি। কারও ৭ দিন, কারও ১৫ দিন আবার কারও বা মাসে একবার। \n" +
                    "\nতবে সুস্থ মানুষের জন্য বছরে একবার, মতান্তরে দুই বা তিনবার হিজামা করা ভাল, এটা রোগের প্রতিষেধক (Prophylaxis) হিসেবে কাজ করে।"));

        } else if (identifier == 29) {
            toolbar.setTitle("তাইবাহ থিওরি");

            linearLayout.addView(textHeader("হিজামা বা কাপিং থেরাপি কিভাবে কাজ করে"));
            linearLayout.addView(textField("হিজামা কিভাবে কাজ করে এটার পরিষ্কার ধারণা থাকা জরুরী। প্রায়ই এই প্রশ্ন ওঠে যে যে সকল রোগের ক্ষেত্রে প্রচলিত চিকিৎসা বিফল হচ্ছে সেসব ক্ষেত্রে হিজামা কিভাবে কাজ করে। হিজামার উপকারীতা নিয়ে প্রচলিত প্রচুর থিওরি আছে। আমরা এই সকল থিওরি নিয়ে সংক্ষিপ্ত কিছু আলোচনা করব যাতে করে হিজামা কিভাবে কাজ করে এই ব্যাপারে আমরা একটি সামগ্রিক ধারনা পেতে পারি।"));

            linearLayout.addView(textHeader("\nতাইবাহ থিওরি"));
            linearLayout.addView(textField("আমাদের বিভিন্ন অর্গ্যান ও শরীরবৃত্তীয় সিস্টেমের মাধ্যমে আমাদের শরীর একটি ফিজিওলজিক্যাল হোমিওস্ট্যাসিস বা সাম্যাবস্থা বজায় রাখে। রোগের সৃষ্টি হয় এই ফিজিওলজিক্যাল সাম্যাবস্থার বিপরীতে গিয়ে। এক এক রোগের সৃষ্টির কারন খুঁজতে গেলে দেখা যাবে সকল রোগেরই শরীরের এই সাম্যাবস্থা বিঘ্নিত করার বিভিন্ন পন্থা রয়েছে। সকল চিকিৎসার মধ্যে হিজামার সৌন্দর্য এটাই যে, হিজামা একটি এক্সক্রিয়েটরি চিকিৎসা পদ্ধতি, অর্থাৎ এটি শরীর থেকে সাবসট্যান্স বের করে দেয়, ঢোকায় না। অন্যদিকে অন্য সকল চিকিৎসা ইন্ট্রোডাক্টরি অর্থাৎ শরীরে কোন কিছু ঢুকিয়ে দেয়। আমরা এখানে একটা সিম্পল থিওরি নিয়ে আলোচনা করব যা হিজামার উপকারীতার কার্যকরন বৈজ্ঞানিকভাবে ব্যাখ্যা করবে।\n" +
                    "\nতবে একটা ব্যাপার মনে রাখা জরুরী যে হিজামা প্রত্যক্ষভাবে প্রচলিত চিকিৎসা বিজ্ঞানের শত্রু। কথাটা এভাবে বলার জন্য দুঃখিত। আসলে প্রচলিত চিকিৎসা বলতে আমি সেই চিকিৎসাকে বোঝাচ্ছি যা আসলে ফার্মাসিউটিক্যাল ইন্ডাস্ট্রি দ্বারা নিয়ন্ত্রিত। অর্থাৎ আপনার ব্যাথা হবে, আর ব্যাথার জন্য পেইন কিলার খাবেন, দীর্ঘ কয়েক বছর পেইনকিলার খাওয়ার ফলশ্রুতিতে আপনার কিডনির কার্যকারীতা নষ্ট হবে। আর এই কিডনি ফাংশান লস এর সাথে সাথে তৈরি হবে হাইপারটেনশান, কার্ডিয়াক প্রবলেম, এনিমিয়া। ফলশ্রুতিতে শরীরে ঢুকবে আরও ঔষধ। শুধু ঢুকবে যে তা নয়, প্রতিনিয়ত ঢুকবে। আপনার শরীর ধীরে ধীরে পরিণত হবে একটা টক্সিক গার্বেজে। আস্তে আস্তে হোমিওস্ট্যাসিস লস হবে। শরীরের প্রতিটি অর্গ্যান এর সাথে মানিয়ে নিতে চাইলেও পারবেনা। শেষে হবে সামগ্রিক সিস্টেম লস। আর এই সিস্টেম লসই হচ্ছে ফার্মাসিউটিক্যাল মার্কেটের জন্য ব্যাবসার সূত্র।\n" +
                    "\nওয়েট কাপিং বা হিজামার যে এক্সক্রিয়েটরি ফাংশান বা শরীর থেকে পদার্থ বের করে দেয়ার ক্রিয়াকে কিডনির সাথে তুলনা কর যায়। হিজামা কিছুটা আর্টিফিশিয়াল কিডনির মত কাজ করে। এটা চামড়ার ক্যাপিলারি বা অতিসুক্ষ রক্তনালী থেকে সাইজ ডিপেনডেন্ট এক্সক্রিয়েশান করে। কিন্তু হিজামার ক্ষেত্রে পার্টিকেল এক্সক্রিয়েশানের যে প্রেশার তা রেনাল গ্লোমেরুলাই থেকে কিছুটা বেশি থাকে।\n" +
                    "\nযেখানে কিডনি থেকে এক্সক্রিয়েশান হাইড্রোফিলিক ম্যাটেরিয়ালের মধ্যেই সীমাবদ্ধ 44, সেখানে হিজামা হাইড্রফিলিক ও হাড্রোফোবিক সকল ধরনের ম্যাটেরিয়াল এক্সক্রিট করতে পারে, যেমন লাইপোপ্রোটিন। 45 আর এভাবে এটা স্কিনের ন্যাচারাল এক্সক্রিয়েটরি রোলকে এনহ্যান্স করে। কিডনি ও হিজামার এক্সক্রিয়েটরি ফাংশানের মিল ও অমিলগুলো ১ নং টেবিলে লিপিবদ্ধ করা হয়েছে। \n"));
            linearLayout.addView(imageField(R.drawable.hijama_taibah1));
            linearLayout.addView(textField("আমাদের ধারণা অনুযায়ী হিজামা সার্জিক্যাল এ্যাবসেস ড্রেনেজ এর চেয়েও কিছু কিছু ক্ষেত্রে ভাল কাজ করে। এই পার্থক্যগুলো ২ নং টেবিলে লিপিবদ্ধ করা হল।"));
            linearLayout.addView(imageField(R.drawable.hijama_taibah2));
            linearLayout.addView(textField("হিজামার মাধ্যমে চিকিৎসা করা হলে মানুষের শরীর বিভিন্ন ঔষধের অনেক ধরনের সাইড ইফেক্ট এবং ঔষধের মধ্যকার ইন্টারএ্যাকশান থেকেও বাঁচবে। হিজামার রোগ ভাল করার বৈজ্ঞানিক ব্যাখ্যা খুঁজতে গিয়ে রিসার্চাররা হিজামার মেকানিজম পুরোপুরি নতুন ভাবে ব্যাখ্যা করেছেন। \n\n" +
                    "Taibah theory states that: WCT is related in principle to the scientific mechanisms underlying abscess evacuation and fluid filtration at renal glomeruli, where a pressure-dependent excretion of harmful substances and CPS occurs. CPS include both disease-causing substances and disease-related substances resulting during disease pathogenesis.\n" +
                    "\nWCT is a minor surgical excretory procedure, where negative pressure (suction force) applied to skin surface using cups creates skin upliftings (gradually increasing in size due to viscoelastic nature of the skin) inside which local pressure correspondingly decreases (Boyle’s law) around capillaries. This causes increased capillary filtration, local collection of filtered fluids and interstitial fluids and their retention inside skin upliftings. This dilutes chemical substances, inflammatory mediators, nociceptive substances, bathes nerve endings in collected fluids and breaks tissue adhesions causing decreased pain (Taibah theory for dry cupping therapy). On removing the cups, dramatic increase in skin blood flow occurs (reactive hyperemia).\n" +
                    "\nScarifications of surface of skin upliftings opens skin barrier for evacuation of fluids with CPS and prevents their absorption at venous capillary end. Immediate second cupping pressure is transmitted through skin incisions to create a pressure gradient and a traction force across the skin and capillaries leading to excretion of collected interstitial fluids with CPS, filtration of capillary fluids containing CPS, bleeding at puncture sites and increased release of endogenous opioids (analgesic effect).\n" +
                    "\nCupping therapy increases innate and acquired immunity (skin wounding effect), hemolyzes old RBCs against high-pressure gradient and enhances natural excretory functions of the skin.\n" +
                    "\nOld hemolysed blood cellular fragments, molecules and particles smaller than capillary pore sizes selectively pass through capillary pores under suction pressure effect, while intact blood cells (larger than pores of skin capillaries) do not.\n" +
                    "\nIn the cupped area, traumatized capillaries may bleed. Therapeutic benefits of WCT is not related to the amount of blood drawn out but to the amount of excreted CPS. WCT benefits from the vasodilator, antimicrobial, angiogenic and wound healing effects of released nitric oxide (NO)." +
                    "\nWCT-induced fluid and CPS excretion, negative pressure suction and NO may help in dilating local blood capillaries. This improves microcirculation, increases capillary permeability, increases drainage of excess fluids, decreases absorption at venous end of capillaries, increases fluid filtration at both arterial and venous capillary ends, increases fluid excretion (filtered fluids and interstitial fluids) causing increased clearance of blood, plasma and interstitial spaces.\n" +
                    "\nAll that lead to decreasing interstitial fluid pressure, decreasing capillary venous return, decreasing venous pressure, decreasing peripheral vascular resistance, enhancing velocity of blood flow, treating blood congestion, improving blood and lymphatic capillary circulations and resolution of tissue swelling (due to removal of CPS, noxious substances, prostaglandins and inflammatory mediators).\n" +
                    "\nAll these effects may improve oxygen supply, tissue perfusion and cellular metabolism, preserve underlying and remote tissue structures, modulate angiogenesis, relieve muscle spasm, restore balance of neuroendocrine system, improve neurotransmission, exert pharmacological potentiation to conventional treatments and restore physiological homeostasis).\n" +
                    "\nOur theory for WCT is named Taibah theory (named after Taibah city, Al-Madinah Al-Munawwarah, city of Prophet Mohammad peace be upon him). In light of Taibah theory, prophetic method of WCT (Al-hijamah) can be defined as a minor surgical excretory procedure that creates superficial skin lacerations to open skin barrier and create a pressure gradient and a traction force across the skin and underlying capillaries to drain interstitial fluids and enhance blood clearance and waste excretion through skin.\n" +
                    "\nFrom Taibah theory, it can be concluded that WCT works through inducing local fluid collection in skin upliftings that comes out through inducing skin lacerations leading to decreased interstitial fluid pressure and clearance of interstitial spaces. This causes a pressure gradient and traction force across the walls of blood and lymphatic capillaries in the cupped area to drain solutes and fluids to interstitial spaces then through skin lacerations to outside. This enhances blood circulation and lymph flow to the cupped area with further clearance of blood in the short time period during which negative suction is applied. This may help to regain homeostasis in human body (Figures 1-2).\n"));

            linearLayout.addView(imageField(R.drawable.hijama_taibah3));
            linearLayout.addView(imageField(R.drawable.hijama_taibah4));
            linearLayout.addView(imageField(R.drawable.hijama_taibah5));
            linearLayout.addView(imageField(R.drawable.hijama_taibah6));
            linearLayout.addView(imageField(R.drawable.hijama_taibah7));
            linearLayout.addView(imageField(R.drawable.hijama_taibah8));
            linearLayout.addView(imageField(R.drawable.hijama_taibah9));
            linearLayout.addView(imageField(R.drawable.hijama_taibah10));
            linearLayout.addView(textField("Unless there is a contraindication for any of the cupping steps, WCT may be regarded as a beneficial artificial percutaneous route of excretion. Whenever excess fluids, organic substances or solutes are to be drained, evacuated or excreted, WCT may be beneficial."));
            linearLayout.addView(textHeader("\nScientific Evidences in Favor of Taibah Theory"));
            linearLayout.addView(textField("Careful analysis of scientific facts in histology and physiology of capillary circulation and the literature support Taibah theory for WCT, as we will review here"));
            linearLayout.addView(textHeader("\nWCT Causes a Pressure-Dependent and Size-Dependent Excretion of CPS"));
            linearLayout.addView(textField("Physiological upper limits of pore size of skin capillaries (nonsinusoidal fenestrated blood capillaries with diaphragmed fenestrae) range between 6 and 12 nm. Compared with skin capillaries, kidney glomerular capillaries (non-sinusoidal fenestrated capillaries with open non-diaphragmed fenestrae) have slightly wider pores (15 nm) [46], which confirms the size-dependent filtration of blood through skin capillaries (in Taibah theory) leading to plasma filtration and excretion of CPS soluble in plasma. Added to that is the strong negative pressure used during WCT (strong filtration force) that is stronger than filtration pressure at glomerular capillaries.\n" +
                    "\nThe viscoelastic nature of human confirms that it is not plane and allows skin to be modeled in simulation studies where skin can be sucked up into the inside of cups to a certain extent [21,37]. Sucking skin into the inside of cups depends on the amount of pressure applied, point of skin at which cup is applied, subcutaneous tissue and size of cups. Suction pressure (negative pressure) in cupping therapy leads to fluid collection inside skin upliftings then excretion of larger amount of fluids through skin lacerations more than the amount that can be produced without suction. Progressive increase in size of skin upliftings around capillaries can decrease pressure around capillaries (Boyle’s law) leading to more capillary filtration and excretion of CPS (in agreement with Taibah theory) that confirms benefits of the pressure effect in cupping therapy.\n" +
                    "\nMoreover, the negative pressure applied at the skin surface during cupping therapy is variable in strength according to the method of production of this negative pressure. Huber et al. reported that large pressure differences could be obtained when using different methods for inducing negative pressure. Huber et al. [37] reported that mean pressure produced was −200 ± 30 hecta Pascal (hPa) when using 2 cm flame, −310 ± 30 hPa with 4 cm flame, −560 ± 30 hPa with burning alcohol soaked cotton swab and −270 ± 16 hPa with rubber balloon. The pressure produced through rubber balloon was the easiest technically, moderate (not too high or too low) and was the most reproducible on repeating cupping practice as evidenced by reduction of the standard deviation by a factor of 2 compared to the flame methods.\n" +
                    "\nWhen WCT is done across the skin barrier, negative pressure produced in previously mentioned methods was (-200 to -560 hPa) [37] which is equivalent to (-150 to -420 mmHg). This negative pressure at skin surface creates skin upliftings inside which collection of interstitial and filtered fluids take place. This decreases absorption at venous ends (fluid moves to skin upliftings) and increases filtration at arterial ends. This confirms the pressure-dependent excretory role of WCT (Taibah theory). Adjustment of the suitable pressure needed can be achieved through selecting the best pressure method. No need for very high suction pressures if capillary rupture may occur as excretion of CPS can better be achieved through capillary blood filtration than through bloodletting.\n" +
                    "\nAs the negative suction pressure during cupping therapy is much higher than the net filtration pressure at the arterial side of the capillaries (both are filtration forces pushing fluids from inside capillaries to the interstitial spaces) and also much higher than the net venous pressure (absorptive pressure) at the venous side of capillaries as indicated in the normal pressure values at capillary ends [47] as summarized in table 3, WCT increases capillary filtration at both capillary ends (in agreement with Taibah theory). This becomes obvious on puncturing skin surface and opening skin barrier where a pressure gradient across skin surface and capillaries occur. This negative pressure will be a filtering force added to the hydrostatic pressure at both arterial and venous ends of capillaries to enhance filtration at both ends of capillaries (arterial and venous ends) leading to continuous filtration at both ends of capillaries and further clearance of blood and plasma."));
            linearLayout.addView(imageField(R.drawable.hijama_taibah11));

            linearLayout.addView(textField("N.B.→ \nIn = tissue fluid movement to the inside of capillaries (absorption force).\n" +
                    "Out = tissue fluid movement to the outside of capillaries (filtration force)\n\n"));
            linearLayout.addView(textHeader("Intact Blood Cells are not Filtered by WCT-Induced Pressure Filtration"));
            linearLayout.addView(textField("Excretion through WCT is selective. It depends on strength of pressure applied, time allowed, number of cups applied, frequency of cupping therapy and capillary fenestral pore size. As size of pores of skin capillaries (12 nm) is relatively near to size of pores of glomerular capillaries (15 nm) [46], particles around the size of 12 nm or lower will be excreted. RBCs, WBCs and platelets have sizes in micrometer range [48] more than size of capillary fenestrae (in nanometer range) and therefore can never leak through capillary pores. Hemolysed blood cellular fragments and old hemolyzed cells may pass through capillary pores. Intact blood cells that may be present in cupped blood must come through traumatized capillary points. Red color of cupped blood is due to both hemolyzed and intact cells and liberated hemoglobin from hemolyzed RBCs. Based on that, optimization of the cups size, cups number, time factor, pressure factor and anatomical sites for cups application will improve therapeutic outcomes of WCT.\n" +
                    "\nIn addition, filtration in WCT may be stronger than glomerular capillary filtration due to higher pressure in case of cupping therapy (16-43 times higher pressure in WCT more than net pressure at glomeruli) (Table 3).\n" +
                    "\nIn addition, opening skin barrier increases the inherent excretory role of the skin to excrete lipids and hydrophobic sebaceous substances as evidenced by the report that skin guards against metabolic syndrome [49] and the report that WCT decreased serum lipids profile levels of hyperlipidemic patients [45]."));
            linearLayout.addView(textHeader("\nSome Loss of Venous Blood Occurs on Scarifying Skin During WCT"));
            linearLayout.addView(textField("Cupped blood shed out during WCT showed decreased levels of blood constituents and cells in comparison with venous blood values. This may be due to dilution of blood shed out at skin puncture sites with the added collected interstitial and filtered fluids [50-51]. For example, blood shed out during cupping therapy showed highly significant decline in number of WBCs, RBC, platelets, monocytes and granulocytes. Also, there was a significant decrease in hemoglobin level, hematocrit value and mean cell hemoglobin concentration [50-51]. This confirms that venous blood (undiluted with added fluids) is different from blood shed during WCT (diluted with added fluids) in agreement with Taibah theory"));
            linearLayout.addView(textHeader("\nWCT has Analgesic and Immunological Functions"));
            linearLayout.addView(textField("During WCT, skin is punctured. It was reported that injury to the skin leads to release of β-endorphin (endogenous analgesic opioid) and adrenocortical hormones into the circulation. Endothelin-1 is a pain mediator synthesized by normal skin keratinocytes upon skin injury and acts on endothelin-A receptors. Endothelin-1 can produce analgesia via acting also on endothelin-B receptors leading to the release of β-endorphin from keratinocytes and the activation of G-protein-coupled potassium channels linked to opioid receptors on pain receptors [52-56]. Also, the outer root sheath of the anagen hair follicles of skin and dermal fibroblasts [53] mainly produces β-Endorphin. Both β-endorphin and adrenocortical hormones could be helpful in blocking inflammation in arthritis [54]. Moreover, skin nerve endings are bathed in collected fluids inside skin upliftings, which may reduce their stimulation (analgesic effect). Based on that, skin injury (as skin scarifications during WCT) has analgesic effect through release of endogenous opioids [52-56].\n" +
                    "\nIn addition, skin manipulation by needles and electric stimuli causes release of endogenous opioids and neuropeptides e.g. encephalin, betaendorphin and endomorphin in the central nervous system (analgesic effect), while electric stimulus of 100 Hertz selectively increases the release of dynorphin [57]. Based on that, WCT-induced analgesic effect may act using the same pathway.\n" +
                    "\nMoreover, WCT exerts immunomodulatory and regulatory effects on the immune cells e.g. WCT was reported to increase number of natural killer (NK) cells (innate immunity) [5]. In addition, substance P was reported to play a role in peripheral inflammatory responses and pain genesis. Recent evidence from animal models indicates that antagonists of substance P can block peripheral inflammatory responses as well as nociception (pain) associated with inflammation [58]. Based on that, dilution of substance P and other inflammatory mediators in collected fluids inside skin upliftings may decrease pain sensation.\n" +
                    "\nSkin scarifications during cupping therapy stimulate immune system through the components of the innate immune response in the skin where 3 antimicrobial peptides: the cathelicidins, defensins, and dermcidins act as antimicrobials by enhancing activity of the innate immunity, humoral immunity, cell-mediated immune response and directly inhibiting pathogen growth [59]. Based on that, WCT has an important immunological benefit."));
            linearLayout.addView(textHeader("\nEnhances Excretory Skin Functions and Clears Interstitial Spaces"));
            linearLayout.addView(textField("WCT works as an excretory procedure at the skin and interstitium. The interstitium is not a passive fluid reservoir as its connective tissue cells and extracellular matrix have a role in the control of pressure of the interstitial fluids e.g. the interstitium has a critical role in the rapid development of edema in burns and in the induction of initial swelling in inflammation [60]. Based on that, WCT-induced negative pressure can benefit the interstitium through resolving edema and tissue swelling.\n" +
                    "\nThe skin is the largest organ in human body and has an important excretory function. Skin can degrade, inactivate, biotransform, detoxify and eliminate numerous drugs, chemicals and endogenous toxic compounds through its drug-metabolizing enzymes [61-63], antioxidant systems, ROS-scavenging system [64] and excretion through sweat glands [65-69]. Based on that, WCT-induced openings of the skin barrier may help further excretion of free radicals and the above-mentioned substances and improve the natural excretory functions of the skin (in agreemnt with Taibah theory). As an evidence to the important excretory functions of the skin, severe skin burns cause permanent skin structural tissue damage that may be associated with abnormal metabolism in the form of long lasting insulin resistance, endoplasmic reticulum stress response, increased metabolism, increased cortisol, increased catecholamine and increased cytokines [70-72]. Moreover, impaired cutaneous vasodilatation and sweating are found in grafted skin [73]. This confirms the excretory importance of WCT as this treatment modality opens skin barrier and helps excretion of all that matter.\n" +
                    "\nMoreover, sweat glands of human skin (eccrine sweat glands) measure about the weight of one kidney (about 100 g) and can excrete numerous drugs, metals, xenobiotics [65-67], endogenous chemical and biological substances e.g. neurotransmitters, cytokines, heavy metals and sterols [68,74-76]. Therefore, it can be concluded that decreased skin functions due to burn injuries may increase the risk of accumulation of toxic substances in the body. Based on that, WCT-induced skin incisions become important to facilitate excretion through the skin and its importance increases in presence of skin damage. In addition, WCT becomes more important when complicated skin problems e.g. complicated burns occur in full-thickness skin as evidenced by the report by Liu et al. who reported that the expression of enzymes metabolizing xenobiotics, drugs and ROS scavenging enzymes was not detected in the full-thickness burnt rat skin. Burn causes increased generation of free radicals as hydrogen peroxide [76]. Based on that, WCT opens skin barrier and may cause relief of that harmful stress."));
            linearLayout.addView(textHeader("\nSkin Histology is Ideal for Practicing WCT"));
            linearLayout.addView(textField("Histologically, human skin is composed of epidermis and dermis. The epidermis is the outermost, cellular and nonvascular layer of the skin having thickness ranging from 0.07 mm to 0.12 mm (0.8 to 1.4 mm in the palms and soles). The epidermis is impermeable to water and has protecting barrier functions against physical, ultraviolet injury, chemicals and microbial penetration [77-78]. The epidermis can tolerate mechanical tolerance (as that during cupping therapy) by continuous turnover through migration of the cells originating at the basement membrane to the above layers [78].\n" +
                    "\nThe dermis is the second layer of the skin and represents the vascular connective tissue matrix that interacts with the epidermis. Dermis is strong, elastic, thin (1 mm to 3 mm) and can store water. Based on that, depth of human skin is relatively thin (average 2 mm) and is richly supplied by a network of capillaries [77-78]. This facilitates WCT through that shallow depth of the skin and facilitates blood clearance through filtration of blood circulating in this rich capillary network.\n" +
                    "\nDermis contains also elastin protein for elasticity, collagen protein for strength, glycosaminoglycans (dermatan sulfate, hyaluronic acid and chondroitin sulfate) which make up the ground substance surrounding the fibrous components that contribute to the viscoelastic nature of skin [77-78]. Dermal cells are fibroblasts, macrophages, mast cells, and leukocytes. Fibroblasts synthesize collagen, elastin, and glycosaminoglycans and help wound healing [79]. Based on that, the above-mentioned factors help skin to afford the negative pressure (suction force) during cupping therapy due to strength (collagen) and elasticity (elastin) of the skin. Fluids excreted with cupping therapy include fluids stored in dermis (in agreement with Taibah theory)"));

            linearLayout.addView(buttonMore());

        } else if (identifier == 30) {
            toolbar.setTitle("নাইট্রিক অক্সাইড থিওরি");

            linearLayout.addView(textHeader("নাইট্রিক অক্সাইড কি?"));
            linearLayout.addView(textField("নাইট্রিক অক্সাইড একটি ইমপর্টেন্ট যৌগ যা শরীরে রাসায়নিক বার্তাবাহক হিসেবে কাজ করে। এটা আমাদের বেঁচে থাকার জন্য খুব দরকারি। আমাদের রক্তনালিগুলোর ভেতরের লেয়ারে নাইট্রিক অক্সাইড তৈরি হয়। এছাড়াও মস্তিষ্কে ও শ্বেত রক্তকনিকাতেও এটা তৈরি হয়। এটার কাজের ওপর ভিত্তি করে বিজ্ঞানীরা এর নাম দিয়েছেন মির\u200D্যাকল মলিকিউল। \n" +
                    "\nনাইট্রিক অক্সাইড এর এত এত শারিরবৃত্তীয় ফাংশান থাকার পরও এটা আবিষ্কার হয়েছে এই ১৯৯৮ সালে। আর এই রিসার্চের কারনেই তিনজন আমেরিকান ফিজিশিয়ান পেয়েছিলেন নোবেল প্রাইজ।\n" +
                    "\nএটি একটি শক্তিশালী জিনেটিক রেগুলেটর।\n"));

            linearLayout.addView(imageField(R.drawable.hijama_nitric1));
            linearLayout.addView(textField("আমাদের শরীরে যে ৫০ ট্রিলিয়ল কোষ আছে এই কোষগুলোর একটির সাথে আরেকটির যোগাযোগ করার মাধ্যম হচ্ছে এই নাইট্রিক অক্সাইড গ্যাস।"));
            linearLayout.addView(textHeader("\nস্বাভাভিক অবস্থায় শরীরে নাইট্রিক অক্সাইডের কাজ কি?"));
            linearLayout.addView(textField("আমাদের শরীর যখন পরিমিত মাত্রায় নাইট্রিক অক্সাইড তৈরি করে তখন আমাদের ব্লাড প্রেশার কম থাকে, পুরুষাঙ্গের ভাল ইরেকশান হয়, হৃদরোগ ও স্ট্রোকের ঝুকি কম থাকে, গ্লুকোজ লেভেল নিয়ন্ত্রনে থাকে। \n" +
                    "\n • ব্রেন ও শরীরের স্নায়ুকোষ গুলোর মাঝে ট্রান্সমিটার এর কাজ করার মাধ্যমে এটা স্মৃতিশক্তি ও আচরণ এ সাহায্য করে।\n" +
                    " • এটা রোগ প্রতিরোধ ক্ষমতা বৃদ্ধি করে।\n" +
                    " • ক্যান্সার সেল এর এ্যাপোপটোসিস (কোষের স্বাভাবিক ফিজিওলজিক্যাল মৃত্যু) ও সুস্থ কোষের বৃদ্ধি নিশ্চিত করে।\n" +
                    " • রক্তনালীর সংকোচন ও প্রসারণের মাধ্যমে ব্লাড প্রেশার নিয়ন্ত্রণ করে।\n" +
                    " • ইনফ্ল্যামেশান কমায়।\n" +
                    " • ঘুমের গভীরতা নিয়ন্ত্রনের মাধ্যমে ঘুমের কোয়ালিটি নিশ্চিত করে \n" +
                    " • ঘ্রাণশক্তি রেগুলেট করে\n" +
                    " • কষ্ট/ ব্যাথার সহ্যক্ষমতা ও শারীরিক সক্ষমতা বাড়ায়\n" +
                    " • পাকস্থলীর মোটিলিটি নিয়ন্ত্রণ করে।\n" +
                    " • চুল পড়া কমায়। বিস্তারিত জানতে এখানে ক্লিক করুন।\n" +
                    "\n" +
                    "নাইট্রিক অক্সাইড লেভেল কমে গেলে ঠিক এর উলটা ইফেক্ট হয়।"));
            linearLayout.addView(textHeader("\nআরও জানতেঃ\n"));
            linearLayout.addView(textLink(" • ", "https://en.wikipedia.org/wiki/Biological_functions_of_nitric_oxide", " Biological functions of nitric oxide"));
            linearLayout.addView(textLink(" • ", "https://drive.google.com/file/d/148NmLWO8F-YyzR7uVzxWqkURXCOloyoX/view", " 22 Reasons To use L-Arginine"));
            linearLayout.addView(textHeader("\nনাইট্রিক অক্সাইড কমে গেলে কি ফলাফল হতে পারে?"));
            linearLayout.addView(textField("১। এন্ডোথেলিয়াল ডিসফাংশান ও হাইপারটেনশান (HTN, হাই ব্লাড প্রেশার)- রিসার্চ দেখুন\n" +
                    "হাই প্রেশারের রোগীরা যে নাইট্রোগ্লিসারিন ট্যাবলেট বা স্প্রে ইউজ করে তা নিট্রিক অক্সাইডে কনভার্ট হয়, তারপর হাইপ্রেশার নিয়ন্ত্রন করে।\n" +
                    "২। কার্ডিও ভাস্কুলার ডিজিজ, হার্ট ব্লক, এ্যাথেরোস্ক্লেরোসিস"));
            linearLayout.addView(imageField(R.drawable.hijama_nitric2));
            linearLayout.addView(textField("৩। সেক্সুয়াল প্রব্লেম (ইরেক্টাইল ডিসফাংশান, লিবিডো বা যৌনাকাংক্ষা কমে যাওয়া)\n" +
                    "পুরুষাঙ্গের ইরেকশান নাইট্রিক অক্সাইডের ওপর নির্ভর করে।\n" +
                    "৪। ইনসোমনিয়া বা বা ঘুম না আসা\n" +
                    "৫। ফ্যাটিগ বা অল্প কাজেই দূর্বল লাগা\n" +
                    "৬। এ্যাংজাইটি, টেনশান\n" +
                    "৭। ডিপ্রেশান\n" +
                    "৮। ডায়াবেটিস"));
            linearLayout.addView(textHeader("\nনাইট্রিক অক্সাইড কমে যাওয়ার কারন কি?"));
            linearLayout.addView(textField(" • সিগারেট স্মোকিং → মজার ব্যাপার হচ্ছে সিগারেট স্মোকে নাইট্রিক অক্সাইড থাকে যা সরাসরি রক্তে মিশে গিয়ে ব্লাড ভেসেলকে রিল্যাক্স করার কথা। কিন্তু সমস্যা হচ্ছে স্মোক এর মধ্যকার কিছু মলিকিউল  অক্সিডেন্ট ইনডিউসড এন্ডোথেলিয়াল ট্রমা করে রিল্যাক্সেশান করে। আর স্মোকের মধ্যকার নাইট্রিক অক্সাইডকে ডিগ্রেডেশান করে দেয়। তাই স্মোকিং রক্তনালীকে পার্মানেন্টলি ড্যামেজ করে ও ফ্যাট ডিপোজিশান করে। তাই সিগারেট খেলে একটা টেমপোরারি রিল্যাক্সেশান হয় ঠিকই, কিন্তু এটাই পরবর্তীতে হাইপারটেনশান করে। "));
            linearLayout.addView(imageField(R.drawable.hijama_nitric3));
            linearLayout.addView(textField("Cigarette smoke containing superoxide (O2−·), nitric oxide (·NO), and peroxynitrite (ONOO−) induces oxidant stress and impairs endothelium-dependent vasodilation through ·NO degradation to peroxynitrite and causes activation of platelets and macrophages and lipid peroxidation. Vitamin C protects the vessel from oxidant-induced impairment of endothelium-dependent relaxations by scavenging superoxide, which in turn prevents ·NO degradation, lipid peroxidation, and platelet and neutrophil activation. Results of O2−·-induced lipid peroxidation: LO·, lipid alkoxyl radical; LOO·, lipid peroxyl radical; and eNOS, endothelial NO synthase\n" +
                    "\n\nঠিক একই কারণে স্মোকিং নাইট্রিক অক্সাইড ডিগ্রেডেশান করে ইরেক্টাইল ডিসফাংশান করে যৌন ক্ষমতা কমিয়ে দেয়, আর চুল পড়াও বাড়িয়ে দেয়।"));
            linearLayout.addView(imageField(R.drawable.hijama_nitric4));
            linearLayout.addView(textField(" • মাউথওয়াশ ইউজ\n" +
                    "  মাউথওয়াশ মুখের ভাল ব্যাকটেরিয়াকেও মেরে ফেলে, তাই ন্যাচারালি নাইট্রিক অক্সাইড প্রডাকশান কমে যায়। আরও বিস্তারিত জানতে এখানে ক্লিক করুন।\n" +
                    " • বয়স\n" +
                    "  বয়স বাড়ার সাথে সাথে নাইট্রিক অক্সাইড প্রডাকশান কমতে থাকে।\n" +
                    " • স্থূলতা\n" +
                    "  মোটা হয়ে গেলে , কোলেস্টেরল বেড়ে গেলে অর্থাৎ শিরার ভেতরের (এন্ডোথেলিয়ামে) লেয়ারে ফ্যাট ডিপোজিশান হলে।\n" +
                    " • কায়িক শ্রম \n" +
                    "  ব্যায়াম বা কায়িক শ্রম কম করলে নাইট্রিক অক্সাইড প্রডাকশান কমে যায়।"));
            linearLayout.addView(textHeader("\nশরীরে নাইট্রিক অক্সাইড তৈরি করার কি কি উপায় আছে?"));
            linearLayout.addView(textField("আমাদের শরীরে নাইট্রিক অক্সাইড তৈরি করার তিনটি উপায় আছেঃ\n" +
                    "\n • নাইট্রেট- নাইট্রাইট- নাইট্রিক অক্সাইড পাথওয়ে\n" +
                    "  যখন আমরা নাইট্রেট সমৃদ্ধ খাবার খাই তখন এই নাইট্রেট পরিবর্তিত হয়ে নাইট্রাইট ও পরে নাইট্রিক অক্সাইডে রূপান্তরিত হয়। আমরা যখন খাবার খাই, তখন চর্বন ও জিভের নাড়াচাড়ার কারনে, এরপর পাকস্থলিতে ও অন্ত্রে খাবারের সাথে লালা ও জিভের উপকারী ব্যাক্টেরিয়ার মিশ্রন ঘটে। এই ব্যাক্টেরিয়াই "));
            linearLayout.addView(imageField(R.drawable.hijama_nitric5));
            linearLayout.addView(textField(" • সাইট্রুলিন – আরজিনিন – নাইট্রিক অক্সাইড – সাইট্রুলিন পাথওয়ে\n" +
                    "\n  আমরা যখন সাইট্রুলিন রিচ খাবার খাই তখন এটা আরিজিনিন এ কনভার্ট হয় যা নাইট্রিক অক্সাইড তৈরি এর পূর্বাবস্থা। আরজিনিন থেকেই পরে নাইট্রিক অক্সাইড সিনথেসিস হয়।\n" +
                    "\n • হিজামা বা ওয়েট কাপিং থেরাপী\n" +
                    "\n হিজামা করার সময় যে ছোট ছোট স্ক্র্যাচ করা হয় এগুলো স্কিনের ঠিক নীচের বেইসমেন্ট মেম্ব্রেন এর ক্যাপিলারি গুলো পাংচার করে। এটা এতই সুক্ষ যে ব্যাথাই লাগে না। একটু সুড়িসুড়ির মত অনুভুতি হয়। এই ক্যাপিলারি বা ছোট ছোট ব্লাড ভেসেলগুলো পাংচারের ফলে এর এন্ডোথেলিয়াম থেকে নিঃসৃত হয় নাইট্রিক অক্সাইড। এই নাইট্রিক অক্সাইডই মূলত রোগ নিরাময়ের নিয়ামক হিসেবে কাজ করে।"));
            linearLayout.addView(textHeader("\nহিজামাতে কিভাবে নাইট্রিক অক্সাইড তৈরি হয়?"));
            linearLayout.addView(textField("হিজামাকে স্কিন সারফেসের ওপর ছোট ছোট স্কিন ডীপ স্ক্র্যাচ করা হয়। এই স্ক্র্যাচ গুল এতই সুক্ষ যে এটা শুধু স্কিন ও স্কিনের বেইজমেন্ট মেমব্রেনের মধ্যকার ক্যাপিলারি গুলোকে ইনজুরি করে। এর ফলে ইনফ্ল্যামেশান শুরু হয়। আর এই ইনফ্ল্যামেটরি মেডিয়েটরস এর মধ্যে একটা হচ্ছে নাইট্রিক অক্সাইড।"));
            linearLayout.addView(imageField(R.drawable.hijama_nitric6));
            linearLayout.addView(imageField(R.drawable.hijama_nitric7));
            linearLayout.addView(imageField(R.drawable.hijama_nitric8));
            linearLayout.addView(textHeader("\n\nবিভিন্ন ফিজিওলজিক্যাল ও প্যাথলজিক্যাল সিচুয়েশানে নাইট্রিক অক্সাইড এর ভুমিকা কি?"));
            linearLayout.addView(textField(" • হার্ট ডিজিজে\n" +
                    " • যৌন সমস্যায়\n" +
                    " • ক্যান্সার নির্মূলে"));
            linearLayout.addView(imageField(R.drawable.hijama_nitric9));
            linearLayout.addView(imageField(R.drawable.hijama_nitric10));
        }

    }

    @Override
    public boolean onOptionsItemSelected(MenuItem menuItem) {
        if (menuItem.getItemId() == android.R.id.home) {

            if (activityName.startsWith("Main"))
                MainActivity.drawer.openDrawer(Gravity.START);
            else if (activityName.startsWith("User"))
                UserView.drawer.openDrawer(Gravity.START);
            else if (activityName.startsWith("Admin"))
                AdminView.drawer.openDrawer(Gravity.START);
            else if (activityName.startsWith("Master"))
                MasterAdminView.drawer.openDrawer(Gravity.START);
            return true;
        }
        return false;
    }

    public TextView textHeader(String text) {
        ViewGroup.LayoutParams layoutParams = new ViewGroup.LayoutParams(ViewGroup.LayoutParams.MATCH_PARENT, ViewGroup.LayoutParams.WRAP_CONTENT);
        TextView textView = new TextView(getActivity());
        textView.setLayoutParams(layoutParams);
        textView.setText(text);
        textView.setTextColor(getResources().getColor(R.color.pink));
        textView.setTextSize(22);
        textView.setTypeface(textView.getTypeface(), Typeface.BOLD);
        return textView;
    }

    public TextView textField(String text) {
        ViewGroup.LayoutParams layoutParams = new ViewGroup.LayoutParams(ViewGroup.LayoutParams.MATCH_PARENT, ViewGroup.LayoutParams.WRAP_CONTENT);
        TextView textView = new TextView(getActivity());
        textView.setLayoutParams(layoutParams);
        textView.setText("\n" + text + "\n");
        textView.setTextColor(getResources().getColor(R.color.white));
        textView.setTextSize(16);
        textView.setLineSpacing(2, 1.25f);
        return textView;
    }

    public TextView textArabic(String text) {
        ViewGroup.LayoutParams layoutParams = new ViewGroup.LayoutParams(ViewGroup.LayoutParams.MATCH_PARENT, ViewGroup.LayoutParams.WRAP_CONTENT);
        TextView textView = new TextView(getActivity());
        textView.setLayoutParams(layoutParams);
        textView.setText(text);
        textView.setTextColor(getResources().getColor(R.color.white));
        textView.setTextSize(20);
        textView.setLineSpacing(10, 2);
        return textView;
    }

    public TextView textLink(String text, String Link, String linkText) {
        ViewGroup.LayoutParams layoutParams = new ViewGroup.LayoutParams(ViewGroup.LayoutParams.MATCH_PARENT, ViewGroup.LayoutParams.WRAP_CONTENT);
        TextView textView = new TextView(getActivity());
        textView.setLayoutParams(layoutParams);
        textView.setText(Html.fromHtml("<p>" + text + "<a href=" + Link + ">" + linkText + "</a></p>"));
        textView.setMovementMethod(LinkMovementMethod.getInstance());
        textView.setTextColor(getResources().getColor(R.color.white));
        textView.setTextSize(17);
        return textView;
    }

    public ImageView imageField(final int drawable) {
        ViewGroup.LayoutParams layoutParams = new ViewGroup.LayoutParams(ViewGroup.LayoutParams.MATCH_PARENT, ViewGroup.LayoutParams.WRAP_CONTENT);
        final ImageView imageView = new ImageView(getActivity());
        imageView.setLayoutParams(layoutParams);
        //imageView.setImageDrawable(getResources().getDrawable(drawable));
        Glide.with(getActivity()).load(drawable).into(imageView);
        Glide.get(getActivity()).clearMemory();
        //Glide.get(getActivity()).clearDiskCache();
        imageView.setAdjustViewBounds(true);
        imageView.setPadding(0, 10, 0, 10);

        fragment = getActivity().getSupportFragmentManager().findFragmentById(R.id.content_nav);
        imageView.setOnClickListener(v -> {
            ViewCompat.setTransitionName(imageView, getResources().getDrawable(drawable).toString());
            ImageFragment imageFragment = ImageFragment.newInstance(drawable, "notExists");
            ((FragmentActivity) getContext()).getSupportFragmentManager()
                    .beginTransaction()
                    .hide(fragment)
                    .addSharedElement(imageView, ViewCompat.getTransitionName(imageView))
                    .addToBackStack(TAG)
                    .add(R.id.content_nav, imageFragment)
                    .commit();
        });

        return imageView;
    }

    public TextView imageText(String text) {
        ViewGroup.LayoutParams layoutParams = new ViewGroup.LayoutParams(ViewGroup.LayoutParams.MATCH_PARENT, ViewGroup.LayoutParams.WRAP_CONTENT);
        TextView textView = new TextView(getActivity());
        textView.setLayoutParams(layoutParams);
        textView.setText(text + "\n\n");
        textView.setTextColor(getResources().getColor(R.color.indigo));
        textView.setTextSize(13);
        textView.setGravity(Gravity.CENTER);
        return textView;
    }

    public Button buttonMore() {
        ViewGroup.LayoutParams layoutParams = new ViewGroup.LayoutParams(ViewGroup.LayoutParams.MATCH_PARENT, ViewGroup.LayoutParams.WRAP_CONTENT);
        Button button = new Button(getActivity());
        button.setLayoutParams(layoutParams);
        button.setGravity(Gravity.RIGHT);
        button.setBackgroundColor(Color.TRANSPARENT);
        button.setText("LOAD MORE...");
        button.setTextColor(getResources().getColor(R.color.colorAccent));
        button.setTextSize(18);

        button.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                button.setVisibility(View.GONE);
                buttonMoreText();
            }
        });

        return button;
    }

    void buttonMoreText() {
        linearLayout.addView(textHeader("\nWCT may Benefit from NO Production"));
        linearLayout.addView(textField("NO concentration increases in blood plasma following skin punctures in acupuncture in a time-dependent manner. Blood flow in subcutaneous tissue at acupunctured sites also increases and this correlates with the NO increase i.e. acupuncture increases the NO level in treated regions and thereby increases regional circulation. This may explain the analgesic effect of acupuncture [80]. Based on that, skin scarifications WCT may have a similar effect in increasing NO levels.\n" +
                "\nNO synthesis occurs in human dermal fibroblasts [81] while macrophages were reported to produce NO for prolonged periods after injury [81].\n" +
                "\nNO synthase synthesizes NO [82]. Both inducible and constitutive isoforms of NO synthase are expressed by human dermal fibroblasts [83]. Expression of NO synthase was reported also in vascular endothelium [84]. Expression of inducible NO synthase and endothelial NO synthase occurs in macrophages, epidermis, hair follicle, sebaceous gland, fibroblasts (during healing process of skin incised wound in mice) and in polymorphonuclear cells in the wound area and peripheral region [84].\n" +
                "\nNO is critical to wound collagen accumulation, acquisition of mechanical strength and wound healing [85] especially during the inflammatory stages of wound healing. Inhibition of the production of endogenous NO inhibits both leukocyte accumulation and edema formation induced by different mediators of inflammation [83]. No acts as a neurotransmitter, immunoregulator, vasodilator, anti-proliferative, anti-neoplastic and anti-microbial agent [86] as NO restricts pathogen growth after cutaneous infection [87]. NO plays important roles in cell proliferation, differentiation, apoptosis, angiogenesis, matrix deposition and remolding [82]. NO influences the behavior of macrophages, fibroblasts and keratinocytes during wound repair [88]. NO stimulates the induction of vascular endothelial growth factor (VEGF) expression in cultured keratinocytes and during cutaneous wound repair [89]. Increased vascular permeability induced by VEGF is mediated by local production of NO and arachidonic acid metabolites other than prostaglandin E2, which are most probably produced by inducible NO synthase and cyclooxygenase-2 [90].\n" +
                "\nBased on that, NO can be produced locally in punctured skin to help wound healing. NO may play a protecting anti-microbial role to skin scarifications during WCT. NO may help in restoring skin physiology after WCT. Also, WCT may affect angiogenesis through NO-induced VEGF pathway.\n" +
                "\nIn diabetes, NO synthesis is reduced in the wound milieu. This may be a factor in diabetes-induced impaired wound healing and there are few therapeutic options to reverse it. The amino acid L-arginine is the only substrate for NO synthesis. Arginine supplementation restored impaired healing in acute wound model by normalizing the NO pathway [91]. However, NO appeared not to affect the impaired inflammatory reaction in diabetes, which was unaffected by NO donor (molsidomine) treatment and ex vivo NO synthesis [92]. Based on that, a promising improvement in healing of diabetic wounds and diabetic foot may be achieved through normalizing the NO pathway by performing WCT.\n"));
        linearLayout.addView(textHeader("\nWCT Benefits from the Phenomenon of Reactive Hyperemia"));
        linearLayout.addView(textField("Reactive hyperemia is a protective adaptive phenomenon, which quickly restores blood flow distal to a transient arterial occlusion. NO plays a role in it. Other several mediators are involved e.g. myogenic and metabolic factors, prostaglandins, K+ ATP channels and adenosine [93]. Vascular compression occurring during application of sucking cups causes a decrease in blood supply to the skin for few minutes resulting in accumulation of vasodilator chemicals. As soon as vascular compression is removed, blood flow to skin dramatically increases causing hyperemia [94]. Based on that, patients may benefit from this reactive hyperemia in filtering more blood and excreting more CPS.\n" +
                "\nResting skin blood flow in thermoneutral environments is approximately 250 mL/min. Skin vasodilation increases dramatically with skin warming until skin blood flow can reach 6 to 8 L/min during hyperthermia. Both local sensory nerves and nitric oxide may play a role in that [95-96].\n" +
                "\nNO synthase inhibition does not alter the reactive hyperemic response in the cutaneous circulation [97]. Also, vasodilatation of reactive hyperemia is independent of the central nervous system to a large extent and is related to the metabolic debt and affects the deep as well as the superficial circulation, the arterioles, capillaries, and venules being the main point of action [98-102].\n" +
                "\nRecently, using Doppler flowmetry, there was a 4-fold increase of skin blood perfusion (due to reactive hyperemia) as compared to the level of this parameter at rest [103] i.e. skin blood perfusion increases from 250 to 1000 ml/min, which means that about 10 liters blood will enter skin circulation within 10 minutes (the average duration of WCT). This may allow maximal clearance of blood from CPS. Based on that, WCT may clear an enough proportion of the circulating blood during one session (blood volume is 5-6 liters).\n" +
                "\nAt the back region, post-pressure hyperemia reached a maximum after application of 100 mmHg pressure with no greater hyperemic response on application of higher pressures [104]. Moreover, inflammatory hyperemia occurs at inflammatory sites as a physiological compensation for the abnormal local calorification where a rapid circulation of the blood occurs [105] e.g. blood flow (measured by Doppler) increased by 46% higher in low back pain patients than in controls [106]. Based on that, inflammatory hyperemia brings more blood for clearance during WCT at local inflammatory sites e.g. low back pain and cellulitis to enhance clearance of blood from CPS"));
        linearLayout.addView(textHeader("\nCupping Therapy for Treatment of Rheumatoid Arthritis (in Light of Taibah Theory)"));
        linearLayout.addView(textField("Taking RA as an example, the type of pain is severe in the affected joints which are swollen, tender leading to limited mobility. Treatment options available for rheumatoid arthritis include analgesics, steroids and disease modifying antirheumatoid drugs (DMARD) (potent antiinflammatory drugs and cytotoxic drugs e.g. methotrexate) [107]. Numerous drug side effects are encountered in pharmacological treatments used for RA e.g. analgesic drugs induce gastritis, gastric ulcers and toxicities at high doses [107], while prolonged steroid therapy causes osteoporosis, hypertension, steroid diabetes, gastric ulcers and steroid dependence [108]. Cytotoxic drugs are strongly harmful at the long term and are the main reason for the intolerable side effects reported in rheumatoid patients e.g. hepatotoxicity, hair fall, exhaustion and fatigue [109]. Unfortunately, despite the big physical, psychological and economic burden of current treatment modalities for RA, resistance to treatment is reported in some cases e.g. many patients with RA experience resistance to a combination of methotrexate and steroids which necessitate searching for better new lines of treatment [110].\n" +
                "\nIn general, treatment modalities are directed towards treating the three Cs (cause, condition and complications). The curative modality of treatment is that treatment that corrects the cause or causes of disease and prevents its pathogenesis. As RA is an immunological disorder characterized by a chronic inflammatory reaction with an autoimmune nature in which auto-antibodies primarily attack synovial joints [83,111] due to increased levels of inflammatory cytokines e.g. tumor necrosis factor (TNF) [111-112], best treatment option is that directed towards correcting the cause. Infliximab (a monoclonal anti- TNF antibody) was reported to be effective in treatment of RA [112]. However, Infliximab is very expensive and carries a lot of side effects. Better results were reported when anti-TNF-α therapy was combined with DMARD therapy in RA patients leading to reduced inflammatory gene expression in whole blood compared to DMARD therapy alone [111]. Reports published in the literature for treating RA using cupping therapy are too few. Cupping therapy for RA was reported to improve pain encountered in those patients. Ahmed et al. reported that cupping therapy combined with pharmacological treatment for RA dramatically decreased clinical indices of RA as visual analogue score tender joint count, swollen joint count and disease activity scores. Combined cupping and traditional therapy also significantly decreased laboratory markers of disease activity as erythrocyte sedimentation rate, C-reactive protein, soluble interleukin-2 receptors (SIl-2R) and rheumatoid factor (RF) which were evaluated over three successive months [5]. Interestingly, while pharmacological treatment for RA-induced leucopenia and decreased count of natural killer (NK) cells (innate immunity), combined cupping therapy and conventional treatment induced leucocytosis with increasing innate immunity (increased levels of NK cells) which was a big advantage in favor of cupping therapy [5]. These immunomodulatory effects of cupping therapy occurred because cupping therapy helped in decreasing the causative immunological reactions underlying the pathogenesis of RA i.e. the decreased level of serum SIl-2R and RF can only be explained through their cutaneous excretion through skin incisions and suction force in cupping therapy which agree with Taibah theory for cupping therapy. " +
                "\nThis may be a big step towards treating the original cause of that disease. The detailed mechanisms for that were not reported by this research group. Unfortunately, to our knowledge, no similar studies written in English for using cupping therapy for RA were reported. Careful analysis of the reported data may help in understanding how cupping therapy works for treating RA. We propose that cupping technique implied artificial pathways to improve excretion of extracellular tissue fluids, lymph or blood that may be saturated with inflammatory cytokines (as TNF), immune complexes or toxic cellular waste products that are formed in the inflammatory sites. Lack or reduction of those harmful agents through cupping therapy might inhibit the chronic immunological inflammatory reactions or at least decreased their severity or delayed their occurrence. " +
                "\nFor proper elimination of tissue fluids containing those harmful agents and CPS, suction through creating a negative pressure in the cups may help better drainage of these areas. This is expected to help human body to restore physiological homeostasis according to Taibah theory.\n"));
        linearLayout.addView(textHeader("\nCupping Therapy for Treatment of Hypertension (in Light of Taibah Theory)"));
        linearLayout.addView(textField("Obese hypertensive patients were reported to have a higher significant value of extracellular and interstitial fluid volumes than normotensive subjects. At similar blood pressure values, increased extracellular and interstitial fluid volume correlated with the degree of obesity i.e. extracellular and interstitial fluid volumes are increased in obese hypertensive patients and that was related to the degree of overweight and to the mechanisms of hypertension [113]. " +
                "\nIn some patients with renal hypertension, volume-dependent form of hypertension may occur. Reduction of increased fluid volumes may be essential in the management of these cases [114]. In some studies, renal hypertension was reported to be caused by inhibition of nitric oxide synthase (NOS) that synthesizes nitric oxide (NO, a vasodilator). This may cause systemic and glomerular hypertension, glomerular ischemia, glomerulosclerosis, tubulointerstitial injury and proteinuria [87,115]. Free radicals e.g. superoxide anions-induced oxidative stress was reported to cause inactivation of NOS and a decrease of the total NO production in human renal hypertension. Oxidative stress occurs early in the course of chronic kidney diseases causing hypertension that increases as the disease progresses [116]. Oxidative stress causes NO deficiency that precedes the development of hypertension [117]. " +
                "\nWang et al. reported severe endothelial dysfunction and inhibition of microvascular nitric oxide synthase in hypertensive patients. That was accompanied by increased levels of plasma reactive oxygen species and asymmetric dimethyl arginine that can inhibit NOS [118].\n" +
                "\nIn light of Taibah theory, as cupping therapy can drain interstitial fluids and filter excess intravascular fluids full with metabolic noxious substances (CPS), WCT may be beneficial in treating hypertension. In addition, WCT helps in excretion of accumulated wastes, vasoactive substances and free radicals (causing hypertension) and may be beneficial in treating hypertension."));
        linearLayout.addView(textHeader("Cupping Therapy for Treatment of Headache and Migraine (in Light of Taibah Theory)"));
        linearLayout.addView(textField("Cupping therapy was reported to effectively treat headache and migraine, where mean headache severity decreased by 66% following WCT. Treated patients also experienced the equivalent of 12.6 fewer days of headache per month [119]. " +
                "\nIn light of Taibah theory, migraine and headache can be treated by WCT and this may be due to WCTinduced plasma clearance effect through removal of excess fluids, chemical mediators, vasoactive substances, neuropeptides causing headache, decreasing interstitial fluid pressure and treatment of predisposing factors for headache e.g. hypertension [51,113] and acute trigeminal neuralgia [19]. " +
                "\nThe neuropeptides involved in the pathogenesis of headache include substance P, vasoactive intestinal polypeptide (VIP) and calcitonin gene-related peptide (CGRP) that are important mediators in the pathogenesis of migraine and other primary headaches. concentrations CGRP and VIP was reported to be increased in jugular venous plasma during attacks of cluster headache and migraine [120]. " +
                "\nBased on that, excretion of the above mentioned CPS may explain how WCT treats headache and migraine"));
        linearLayout.addView(textHeader("Cupping Therapy for Treatment of Cellulitis (in Light of Taibah Theory)"));
        linearLayout.addView(textField("Cellulitis is a bacterial inflammatory reaction in the subcutaneous tissues caused mostly by gram positive bacteria as staphylococcus aureus and streptococcus. Mortality is high in cellulitis due to toxemia and septicemia. " +
                "\nTreatment for cellulitis is via broad spectrum antibiotics [121]. Delay in treatment of cellulitis allows for multiplication of microorganisms and production of powerful exotoxins. In case of presence of associated gram negative bacteremia, powerful endotoxins are released causing endotoxic shock [122-123]. " +
                "\nThis gives the conclusion that antibiotics only may not be enough to treat cellulitis. In a recent case report, in a patient with cellulitis, broad spectrum antibiotic treatment was not effective in treatment of that patient. Instead, progressive deterioration in general condition of the patient occurred. Antibiotic therapy together with WCT was done on the site of maximum inflammation of cellulitis by applying about 35 superficial cuts where approximately 9 ml of blood was drawn out. An immediate clinical improvement was noted in the form of reduction in all signs of inflammation. " +
                "\nAs a good evidence for efficacy of cupping therapy in treating cellulitis, treatment of the same patient with cellulitis for the second time using cupping therapy alone without antibiotic therapy was effective in inducing dramatic improvement [124]. Improvement of cellulitis may be explained in light of Taibah theory where excretion of interstitial fluids and filtered capillary fluids rich in bacteria and bacterial toxins (CPS) helped in clearing blood from microorganisms and toxins and elimination of microorganisms and their toxins outside human body through suction using the negative pressure. Based on that, cupping therapy did better than antibiotics, which did not affect bacterial toxins. Cupping therapy alone allowed removal of both bacteria and toxins through negative pressure suctioning as evidenced by improvement of patient’s condition. The best is to combine both antibiotics and cupping therapy for treating cellulitis"));
        linearLayout.addView(textHeader("Cupping Therapy for Treatment of Fibromyalgia (in Light of Taibah Theory)"));
        linearLayout.addView(textField("Pain due to fibromyalgia is complex and multifactorial in origin i.e. it may be due to interaction of nociceptive, neuropathic, dysregulatory central nervous system, metabolic deficiencies in muscle and neurogenic inflammation [125]. Abnormally high cerebrospinal fluid levels of glutamate, substance P, inflammatory cytokines, and ROS are hallmarks of fibromyalgia [126-129]. In fibromyalgia, nociceptor pain is based on the excitation of the nervous sensors by the release of substance P and other neuropeptides from the peripheral nerve endings leading to hyperalgesia due to chemical sensitization at tender points. Neuropathic pain is due to nerve compression as in herniation of vertebral disks or disturbances of axonal transport causing hyperexcitability, disturbed axonal transport system and trophic changes causing tender points in fibromyalgia [125].\n" +
                "\nMedicinal cupping therapy using dry cupping therapy with drugs in 30 patients with fibromyalgia was reported to be effective in decreasing the severity of fibromyalgia pain and the number of tender points [10,130]. Based on that and on Taibah theory, WCT is expected to be a more suitable effective treatment for fibromyalgia as it can decrease interstitial fluid pressure, decrease inflammatory cytokines and substance P (CPS via dilution then drainage) and reduce interstitial fluids at sites of inflammation. Evidence for that was the improvement of symptoms of fibromyalgia on using treatments that reduced interstitial fluid at sites of inflammation and the evident anti-inflammatory effects that had been seen [131]."));
        linearLayout.addView(textHeader("\nCupping Therapy for Treatment of Carpal Tunnel Syndrome (CTS) (in Light of Taibah Theory)"));
        linearLayout.addView(textField("CTS is a common entrapment neuropathy that is predisposed to by many disease conditions e.g. hypertension, RA, diabetes mellitus, hypothyroidism, corticosteroid use, hormonal replacement therapy and wrist fractures [132]. CTS may be drug induced e.g. β-blockers [133]. Pathophysiology of idiopathic CTS was reported to be caused by ischemia-induced reperfusion injury causing an intermittent increase in interstitial pressure, leading to degenerative changes in the flexor tenosynovium and fibrotic changes in the perineural tissue. This may cause alteration in the physical properties of the synovium leading to its rapid and persistent swelling and median nerve compression causing the pain syndrome of CTS [134].\n" +
                "\nIdiopathic CTS was reported to be an “-osis” not an “-itis” i.e. CTS has non-inflammatory ischemia-reperfusion etiology as evidenced by normal serum interleukin-1 level and elevated serum levels of malondialdehyde. In CTS, tenosynovial levels of malondialdehyde, interleukin 6, and prostaglandin PGE-2 were reported to be elevated compared to controls. Idiopathic CTS causes progressive edema and fibrosis of the tissues within the carpal canal as the source of pain [135].\n" +
                "\nMetabolic syndrome may cause severe form of CTS three times more common than normal population. Metabolic syndrome includes abdominal obesity, hypertension, dyslipidemia and hyperglycemia [132]. The tissue pressure threshold of normotensive and hypertensive subjects was reported to be consistently 30 mm Hg below diastolic blood pressure which supports the concept that ischemia is the prime mechanism of conduction block in low pressure, nerve-compression CTS [136]. These findings were confirmed later by the study of Husain et al. who reported that most patients with CTS had dyslipidemia and a large proportion of them had hypertension [137].\n" +
                "\nIn light of Taibah theory, WCT is expected to be a powerful treatment for CTS as WCT can drain tissue fluid containing elevated above-mentioned CPS, decrease pressure of interstitial fluids, resolve synovial swelling, absorb edema fluid and treat predisposing factors e.g. hypertension [51,103], RA [5] and dyslipidemia [45]"));
        linearLayout.addView(textHeader("\nProphetic Medicine Recommended WCT (Al-hijamah)"));
        linearLayout.addView(textField("Prophetic medicine recommended WCT. Prophetic method of WCT (Al-hijamah) was recently reported to carry better therapeutic benefits than the traditional method of WCT [138]. Prophet Mohammad (Muhammad) peace be upon him said: “If there is a benefit in any of your treatment modalities, benefit will be in the blade puncture in cupping therapy, a gulp of honey and cauterizing, but I do not like cauterization” [1,139]. " +
                "\nUsing the expression “in the blade puncture in cupping therapy” means WCT not dry cupping therapy. WCT has an excretory function in clearing blood and tissues from soluble and trapped CPS, while dry cupping therapy has no excretory function. This may give the reason why prophetic method of WCT (Al-Hijamah) was frequently used by prophetic medicine for treating different types of diseases [140]. Using the expression “in the blade puncture in cupping therapy” as a cause of cure summarizes the excretory role of WCT and pays our attention to the fact that cupping therapy opens skin barrier to enhance skin excretory function in agreement with Taibah theory. " +
                "\nAt this step mentioned in the hadeeth (scarifying skin), negative suction pressure is transmitted from inside cups through skin incisions to create a pressure gradient across skin which causes retained collected fluids in the skin upliftings (mixed with CPS), filtered fluids (containing CPS and harmful materials) and some blood to come out through skin punctures induced by “the blade puncture in cupping therapy”. At this step mentioned in the hadeeth (puncturing skin), negative suction pressure is transmitted from inside cups through skin incisions to reach around capillaries to create a pressure gradient across capillaries to filter capillary fluids filled with soluble mediators and CPS. It can be concluded from these prophetic sayings that WCT is not a mere bleeding or venesection." +
                "\n If cupping therapy aims at only getting rid of blood, it is easier to injure a superficial vein to start bleeding with no need for negative pressure application.\n" +
                "\nMoreover, best therapeutic outcomes occur on combining current pharmacological treatment modalities with WCT. Taking RA as an example, conventional treatment modalities aim to suppress inflammatory reactions, while WCT powerfully withdraws CPS e.g. SIL2-R to outside the body (as evidenced by its decreased level in venous blood after WCT) which will result in suppression of inflammatory reactions in RA [5]. Excretory role of WCT may be a very potent treatment to many diseases in which harmful substances cannot be excreted outside human body.\n" +
                "\nHowever, practicing cupping therapy using pressure suction force, minimal skin scarifications and pressure suction force for the second time at skin sites away from superficial veins confirms that WCT is an excretory rather than a mere bleeding procedure. Removing noxious agents to outside human body seems more safe and effective than antagonizing or relieving their harmful effects using pharmacological drugs. In prophetic medicine, the method for creating negative pressure suction in WCT was the manual suction [141], which is reported now to exert a suitable reproducible pressure [37].\n" +
                "\nHoney is another curative remedy in prophetic medicine [1,139]. Applying honey before Al-hijamah is beneficial to fix sucking cups at skin points. Applying honey locally to skin scarifications after Alhijamah helps rapid healing. In a German report, wound healing using honey was achieved in patients whose wounds were either infected or colonised with methicillin-resistant Staphylococcus aureus. Antiseptics and antibiotics had previously failed to eradicate the infection [142]"));
        linearLayout.addView(textHeader("\nConclusion and Recommendations"));
        linearLayout.addView(textField("WCT is a minor surgical excretory procedure that has medical and scientific bases in clearing blood and interstitial spaces from harmful substances, noxious substances and CPS. Both modern medicine and prophetic medicine proved the beneficial value of WCT in treatment of diseases that are different in etiology and pathogeneses. The Chinese are pioneering in practicing cupping therapy in their hospitals. We recommend practicing Al-hijamah officially in hospitals for treating human diseases for the great benefits of this promising line of treatment. WHO is invited to shed more light upon health benefits of Al-hijamah and to encourage its practice in hospitals. Ministries of health worldwide and in the motherland of the prophetic medicine (Saudi Arabia) are invited to allow and encourage the practice of Alhijamah in hospitals officially in a pure medical atmosphere to close the way in face of unqualified malpractitioners.\n" +
                "\nMiraculous remedies in prophetic medicine are a heritage (legacy) for the whole humanity. The prophet peace be upon him is being described as a mercy for all people [143]. Researchers worldwide are invited to pay more attention to develop more research in investigating remedies practiced in prophetic medicine to cure and relieve human suffering in many incurable diseases with dismal prognosis. Such remedies include Al-hijamah, Al-kost Al-bahri (Costus speciosus SM), honey, Happah sawdaa (nigella sativa), olive oil, kamaa (Terfeziaceae, desert truffles), vinegar, sana, sanut, Zamzam water, dates of Madinah (ajwah of Aliah) and others.\n" +
                "\nThe majestic deep-rooted Egyptian Universities as Al-Azhar, Cairo, Alexandria Universities and the internationally ranked King Saud University, Taibah University, Islamic University in Al-Madinah and Om Al-Quraa University in Makkah in Saudi Arabia (homeland of prophethood) are invited to guide research to introduce remedies in prophetic medicine to scientific and medical humanity literature. The pioneering report of Sahbaa Ahmed (Al-Azhar University) in treating RA with Al-hijamah [5] is well cited and appreciated"));
        linearLayout.addView(textHeader("Aknowledgment"));
        linearLayout.addView(textField("We are so grateful to the library of Sohag faculty of medicine, Sohag University, Egypt for providing the internet facility and helpful textbooks"));
        linearLayout.addView(textHeader("\nReferences"));

        linearLayout.addView(textLink("1.Loukas M, Saad Y, Tubbs RS, Shoja MM (2010) ", "https://www.ncbi.nlm.nih.gov/pubmed/19709769", " The heart and cardiovascular system in the Qur'an and Hadeeth. Int J Cardiol 140: 19-23"));
        linearLayout.addView(textLink("2.Stannard CF, Kalso E, Ballantyne J (2010) Evidence-based chronic pain management. Wiley-Blackwell 3.", "", ""));
        linearLayout.addView(textLink("3.Last AR, Hulbert K (2009) ", "https://www.ncbi.nlm.nih.gov/pubmed/19530637", " Chronic low back pain: evaluation and management. Am Fam Physician 79: 1067-1074"));
    }
}
