package com.hijamaplanet.drawer.fragment;

import java.util.ArrayList;

public class StaticTextLibary {

    public ArrayList<String> getAshfiaHeaders () {
        ArrayList<String> ashfiaHeader = new ArrayList<>();
        ashfiaHeader.add("শুরুর কথা");
        ashfiaHeader.add("আমাদের যা যা দরকার হবে");
        ashfiaHeader.add("ব্যবহারের জন্য উপাদানগুলো প্রস্তুতকরণ");
        ashfiaHeader.add("রুটিনঃ ১ থেকে ৩দিন");
        ashfiaHeader.add("রুটিনঃ ৪ থেকে ৭দিন");
        ashfiaHeader.add("কি আশা করা যায়");
        return ashfiaHeader;
    }

    public ArrayList<String> getAshfiaExpandableTexts () {
        ArrayList<String> ashfiaText = new ArrayList<>();
        ashfiaText.add("আশফিয়া – শিফাউন এর বহুবচন, যার অর্থ আরোগ্য বা cure । কোরআনুল কারিম এবং হাদিসে যেসব মেডিসিন এবং হার্বসকে শিফা এবং বরকতময় বলা হয়েছে, আমাদের এই ৭দিনের ডিটক্স প্রোগ্রামটি হচ্ছে সেগুলোর একটি সম্মিলিত প্রয়োগ। এজন্যই এটার নাম রাখা হয়েছে ‘আল-আশফিয়া’ The (Collection of) Cures!\n" +
                "\n" +
                "আমাদের আলোচ্য প্রেসক্রিপশনটি শাইখ আদিল বিন তাহির মুকবিল হাফিযাহুল্লাহুর দেয়া। যা বিশেষভাবে যাদু, জিন, বদনজর এবং এর পাশাপাশি অন্যান্য কঠিন শারীরিক ব্যাধির চিকিৎসাতে খুবই ফলপ্রসূ। এছাড়া কারও যদি অনেক প্রকারের কিংবা অনেক বেশি সমস্যা হয়, তখন সেটাকে একটা মাত্রায় আনার জন্য প্রাথমিক ভাবে আমরা ডিটক্স রুকইয়াহ করার পরামর্শ দিয়ে থাকি। এছাড়া এই রুটিনটা উস্তায মুহাম্মাদ তিম হাম্বলের “সার্বজনীন পূর্ণ রুকইয়াহ প্রোগ্রাম” এর মাঝেও রয়েছে, যা এই লিংক-এ আলোচিত হয়েছে।\n");
        ashfiaText.add("১. পানি। সাড়ে তিন বা চার লিটার।\n" +
                "•\tজমজমের পানি হলে সবচেয়ে ভালো। রাসূল সল্লাল্লহু আলাইহি ওয়াসাল্লাম বলেছেন, এর মাঝে শিফা আছে। (মুজামুল আওসাত)\n" +
                "•\tনইলে বৃষ্টির পানি। আল্লাহ তা’আলা এটাকে বরকতময় বলেছেন। (সুরা ক্বফ, আয়াত ৯)\n" +
                "•\tএসব না পেলে সাধারণ পানি হলেও চলবে। রাসূল স. সাধারণ পানিও চিকিৎসার জন্য ব্যবহার করেছেন। (আবু দাউদ)\n" +
                "জমজম বা বৃষ্টির পানি অল্প পরিমাণে থাকলে বরকতের জন্য সাধারণ পানির সাথে মিক্স করা যেতে পারে। আর একসাথে এতগুলো পানি রাখতে না পারলে, প্রথমে ২লিটার প্রস্তুত করুন, এসব ব্যবহার শেষে আবার প্রস্তুত করবেন।\n" +
                "\n" +
                "২. অলিভ অয়েল। ১০০মিলি. যথেষ্ট হবে ইনশাআল্লাহ।\n" +
                "কোরআনুল কারিমে যাইতুনের তেলকে বরকতময় বলা হয়েছে।  (সুরা নুর, আয়াত ৩৫)\n" +
                "•\tসবচেয়ে ভালো হয় ফিলিস্তিনের এক্সট্রা ভার্জিন অলিভ অয়েল হলে।\n" +
                "•\tনইলে শরীরের ব্যবহারের উপযোগী ভালো মানের যেকোন অলিভ অয়েল।    \n" +
                "\n" +
                "৩. মধু। ২৫০ গ্রাম।\n" +
                "আল্লাহ তা’আলা বলেছেন, মধুর মাঝে মানুষের জন্য শিফা রয়েছে। (সুরা নাহল, আয়াত ৬৯)\n" +
                "\n" +
                "•\tযথাসম্ভব পিওর মধু। এক্ষেত্রে পরিচিত কারও মাধ্যমে বা নির্ভরযোগ্য কোন অনলাইন শপের সহায়তা নেয়া যেতে পারে। অথবা কোন ভালো ব্র্যান্ডের মধু হতে পারে।\n" +
                " \n" +
                "৪. কালোজিরা। ৫০গ্রাম।\n" +
                "রাসূল সল্লাল্লহু আলাইহি ওয়াসাল্লাম বলেছেন, কালোজিরা মৃত্যু ব্যতীত সকল রোগের শিফা। (মুসলিম)\n" +
                "•\tএটাও ভালো হওয়া উচিত, ব্যবহারের আগে সম্ভব হলে কালোজিরার ময়লা ঝেড়ে ফেলা।\n");
        ashfiaText.add("সাপ্লিমেন্টারীগুলো হাতের কাছে রেখে নিম্নের আয়াতগুলো পড়ুন এবং সেগুলোতে ফুঁ দিন -\n" +
                "\n" +
                "১. সুরা ফাতিহা - ৭বার অথবা ৩বার\n" +
                "\n" +
                "أَعُوذُ بِاللّٰهِ السَّمِيْعِ الْعَلِيْمِ مِنَ الشَّيْطَانِ الرَّجِيْمِ\n" +
                "\n" +
                "بِسْمِ اللّٰهِ  الرَّحْمٰنِ الرَّحِیْمِ\n" +
                "\n" +
                "اَلْحَمْدُ لِلّٰهِ رَبِّ الْعٰلَمِیْنَ ﴿۱﴾  الرَّحْمٰنِ الرَّحِیْمِ ﴿۲﴾  مٰلِكِ یَوْمِ الدِّیْنِ ﴿۳﴾ اِیَّاكَ نَعْبُدُ وَ اِیَّاكَ نَسْتَعِیْنُ ﴿۴﴾ اِهْدِ نَا الصِّرَاطَ الْمُسْتَقِیْمَ ﴿۵﴾ صِرَاطَ الَّذِیْنَ اَنْعَمْتَ عَلَیْهِمْ۬ۙ  غَیْرِ الْمَغْضُوْبِ عَلَیْهِمْ وَلَا الضَّآ لِّیْنَ  ﴿۷﴾\n" +
                "\n" +
                "২. আয়াতুল কুরসি - ৭বার অথবা ৩বার\n" +
                "\n" +
                "بِسْمِ اللّٰهِ  الرَّحْمٰنِ الرَّحِیْمِ\n" +
                "\n" +
                "اَللّٰهُ لَاۤ اِلٰهَ اِلَّا هُوَۚاَلْحَیُّ الْقَیُّوْمُۚ   لَا تَاْخُذُہٗ سِنَةٌ وَّلَا نَوْمٌ ؕ لَہٗ مَا فِی السَّمٰوٰتِ وَمَا فِی الْاَرْضِ ؕ مَنْ ذَا الَّذِیْ یَشْفَعُ عِنْدَہٗۤ  اِلَّا بِاِذْنِہٖ ؕ یَعْلَمُ مَا بَیْنَ اَیْدِیْهِمْ وَمَا خَلْفَهُمْ  ۚوَلَا یُحِیْطُوْنَ بِشَیْءٍ مِّنْ عِلْمِہٖۤ اِلَّا بِمَاشَآءَ ۚوَسِعَ كُرْسِیُّهُ السَّمٰوٰتِ وَالْاَرْضَ ۚوَلَا یَـُٔوْدُہٗ حِفْظُهُمَا ۚوَهُوَ الْعَلِیُّ الْعَظِیْمُ\n" +
                "\n" +
                "৩. সুরা ইখলাস - ৩বার\n" +
                "\n" +
                "بِسْمِ اللّٰهِ  الرَّحْمٰنِ الرَّحِیْمِ\n" +
                "\n" +
                "قُلْ هُوَ اللّٰهُ  اَحَدٌ  ﴿۱﴾ اللّٰهُ  الصَّمَدُ ﴿۲﴾  لَمْ یَلِدْ ۙوَ لَمْ یُوْلَدْ ﴿۳﴾  وَ لَمْ یَكُنْ لَّہٗ  كُفُوًا اَحَدٌ  ﴿۴﴾\n" +
                "\n" +
                "৪. সুরা ফালাক - ৩বার\n" +
                "\n" +
                "بِسْمِ اللّٰهِ  الرَّحْمٰنِ الرَّحِیْمِ\n" +
                "\n" +
                "قُلْ اَعُوْذُ  بِرَبِّ الْفَلَقِ ﴿۱﴾  مِنْ شَرِّ مَا خَلَقَ ﴿۲﴾  وَ مِنْ  شَرِّ غَاسِقٍ  اِذَا وَقَبَ ﴿۳﴾  وَ مِنْ  شَرِّ النَّفّٰثٰتِ فِی الْعُقَدِ ﴿۴﴾  وَ مِنْ  شَرِّ حَاسِدٍ  اِذَا حَسَدَ  ﴿۵﴾\n" +
                "\n" +
                "৫. সুরা নাস - ৩বার\n" +
                "\n" +
                "بِسْمِ اللّٰهِ  الرَّحْمٰنِ الرَّحِیْمِ\n" +
                "\n" +
                "قُلْ اَعُوْذُ بِرَبِّ النَّاسِ ﴿۱﴾  مَلِكِ النَّاسِ ﴿۲﴾  اِلٰهِ  النَّاسِ ﴿۳﴾  مِنْ شَرِّ الْوَسْوَاسِ ۙ الْخَنَّاسِ ﴿۴﴾  الَّذِیْ یُوَسْوِسُ فِیْ صُدُوْرِ النَّاسِ ﴿۵﴾  مِنَ الْجِنَّةِ وَ النَّاسِ  ﴿۶﴾\n" +
                "\n" +
                "৬. সুরা বাক্বারা সম্পূর্ণ (কোরআন দেখে পড়ুন)\n" +
                "\n" +
                "    - এক বসাতেই বাক্বারা পুরাটা পড়ে শেষ করতে হবে এমন বাধ্যবাধতা নাই, একবারে যতটুকু পারবেন পড়বেন। পড়ার মাঝেমাঝে ফুঁ দিবেন। প্রয়োজনে উঠে যাবেন, এরপর কোন কাজ থাকলে সেটা শেষ করে এসে বাকিটা পড়বেন। প্রয়োজনে দুইদিন সময় নিয়ে প্রস্তুত করবেন, এরপর ডিটক্স শুরু করবেন। সমস্যা নাই।\n" +
                "    - এসব পড়ুন আর মাঝে মাঝে পানি অলিভ অয়েল ফুঁ দিন। এরপর মধু ও কালোজিরায় ফু দিন।\n" +
                "\n" +
                "৭. আরও কিছু দোয়া পড়ুন - প্রতিটি ৩বার করে\n" +
                "\n" +
                "•\tأَعُوذُ بِاللّٰهِ السَّمِيْعِ الْعَلِيْمِ مِنَ الشَّيْطَانِ الرَّجِيْمِ مِنْ هَمْزِهٖ وَنَفْخِهٖ وَنَفْثِهٖ\n\n" +
                "•\tأُعِيْذُكُمْ بِكَلِمَاتِ اللّٰهِ التَّامَّةِ ،  مِنْ كُلِّ شَيْطَانٍ وَهَامَّةٍ ،  وَمِنْ كُلِّ عَيْنٍ لَامَّةٍ\n\n" +
                "•\tبِسْمِ اللّٰه أَرْقِيكَ،  مِنْ كُلِّ شَيْءٍ يُؤْذِيْكَ،  مِنْ شَرِّ كُلِّ نَفْسٍ أَوْ عَيْنِ حَاسِدٍ،  اَللَّه يَشْفِيكَ بِسْمِ اللّٰهِ أَرْقِيْكَ\n\n" +
                "•\tبِاسْمِ اللّٰهِ يُبْرِيْكَ، وَمِنْ كُلِّ دَاءٍ يَشْفِيْكَ، وَمِنْ شَرِّ حَاسِدٍ إِذَا حَسَدَ، وَشَرِّ كُلِّ ذِيْ عَيْنٍ\n\n" +
                "•\tاللَّهمَّ رَبَّ النَّاسِ أَذْهِبِ الْبَاسَ اِشْفِ وَأَنْتَ الشَّافِيْ لَا شِفَاءَ إِلَّا شِفَاؤُكَ شِفَاءً لَا يُغَادِرُ سَقَمًا\n\n" +
                "\n" +
                "এই স্টেপগুলো ঠিকভাবে অনুসরণ করে থাকলে আপনি “আল-আশফিয়া” ডিটক্স প্রোগ্রাম শুরু করার জন্য প্রস্তুত!\n");
        ashfiaText.add("রাতে:\n" +
                "\n" +
                "১. ঘুমের আগে মাথা থেকে পায়ের তালু পর্যন্ত, অর্থাৎ পুরো শরীরে রুকইয়া করা অলিভ অয়েল মাখবেন।\n" +
                "\n" +
                "২. এরপর সাতটা কালোজিরা চিবিয়ে খান।\n" +
                "\n" +
                "৩. তারপর আধা গ্লাস রুকইয়ার পানিতে এক চা চামচ মধু নিন, এটাকে গুলিয়ে খেয়ে ফেলুন।\n" +
                "\n" +
                " \n" +
                "\n" +
                "সকালে:\n" +
                "\n" +
                "১. যথাসম্ভব সকাল-সকাল গোসল করবেন। প্রথমে গোসলের পানিতে এক গ্লাস রুকইয়ার পানি মিশিয়ে নিন। এরপর সাবান দিয়ে ভালোভাবে গোসল করুন। শীতকালে হালকা গরম পানি ব্যবহার করতে পারেন, কোন সমস্যা নেই।\n" +
                "\n" +
                "২. গোসলের পর আবার সাতটা কালোজিরা চিবিয়ে খান।\n" +
                "\n" +
                "৩. তারপর আধা গ্লাস রুকইয়ার পানিতে এক চা চামচ মধু গুলিয়ে খেয়ে ফেলুন।\n" +
                "\n" +
                " \n" +
                "\n" +
                "অন্যান্য সময়:\n" +
                "\n" +
                "পছন্দসই কোন একজন ক্বারির রুকইয়া শুনুন। (অথবা অভিজ্ঞ কারও পরামর্শ নিয়ে আপনার সমস্যা অনুযায়ী কোন রুকইয়া শুনুন)\n");
        ashfiaText.add("রাতে:\n" +
                "\n" +
                "১. ঘুমের আগে শরীরের যেসব যায়গায় ব্যথা আছে, শুধু সে যায়গাগুলোতে রুকইয়ার অলিভ অয়েল ব্যবহার করুন।\n" +
                "\n" +
                "২. এরপর সাতটা কালোজিরা চিবিয়ে খান।\n" +
                "\n" +
                "৩. তারপর আধা গ্লাস রুকইয়ার পানিতে এক চা চামচ মধু নিন, এটাকে গুলিয়ে খেয়ে ফেলুন।\n" +
                "\n" +
                " \n" +
                "\n" +
                "সকালে:\n" +
                "\n" +
                "১. মোটামুটি সকালে গোসল করবেন। গোসলের পানিতে প্রথমে এক গ্লাস রুকইয়ার পানি মিশিয়ে নিন। এরপর সাবান দিয়ে ভালোভাবে গোসল করুন। প্রয়োজনে শীতকালে হালকা গরম পানি ব্যবহার করতে পারেন।\n" +
                "\n" +
                "২. গোসলের পর আবার সাতটা কালোজিরা চিবিয়ে খান।\n" +
                "\n" +
                "৩. তারপর আধা গ্লাস রুকইয়ার পানিতে এক চা চামচ মধু গুলিয়ে খেয়ে ফেলুন।\n" +
                "\n" +
                " \n" +
                "\n" +
                "অন্যান্য সময়:\n" +
                "\n" +
                "পছন্দসই কোন একজন ক্বারির রুকইয়া শুনুন। (অথবা অভিজ্ঞ কারও পরামর্শ নিয়ে আপনার সমস্যা অনুযায়ী কোন রুকইয়া শুনুন)\n");
        ashfiaText.add("১. প্রথম দিন হয়তো তেমন কিছুই অনুভব করবেন না। তবে কারো কারো প্রথম দিন থেকেই ইফেক্ট শুরু হয়।\n" +
                "\n" +
                "২. দ্বিতীয় এবং তৃতীয়দিন সমস্যা বেড়ে যেতে পারে। হয়তো অসুস্থ হয়ে পড়বেন, প্রচণ্ড দুর্বল লাগবে। অথবা পুরো শরীর বা বিভিন্ন অঙ্গ ব্যথা হয়ে থাকবে। ভারি ব্যায়াম করলে যেমন ব্যথা হয়, সেরকম হতে পারে।\n" +
                "\n" +
                "৩. চতুর্থ দিন থেকে সমস্যা কমতে শুরু হবে ইনশাআল্লাহ, এবং ৭দিনের প্রোগ্রাম শেষ হতে হতে আল্লাহ চায়তো আপনি একদম ফ্রেশ হয়ে যাবেন।\n" +
                "\n" +
                "৪. যদি (আল্লাহ না করুক) ৭ দিন পরেও আপনার যথেষ্ট উন্নতি দেখা না যায়, তাহলে আপনার উচিত হবে লাগাতার কয়েকমাস “ সর্বজনীন পূর্ণ রুকইয়াহ প্রোগ্রাম” অনুসরণ করা।\n" +
                "\n" +
                "৫. আর এই কয়দিন নিজের গুনাহ থেকে ক্ষমা চেয়ে ইস্তেগফার করতে থাকা উচিত। সাথে প্রতিদিনের মাসনুন আমলগুলো করা। আর বেশি বেশি দোয়া করা, যেন সপ্তাহ শেষে আপনি একদম সুস্থ হয়ে যান।\n" +
                "\n" +
                "৬. আর হ্যাঁ! এই রুটিন ফলো করার সময় একটা ডায়েরি বা নোটবুক রাখুন, খুব সংক্ষেপে আপনার অবস্থা নোট করুন। যেন প্রোগ্রাম শেষে সেটা আমাদের সাথে শেয়ার করতে পারেন..।\n" +
                "\n" +
                "আল্লাহ আমাদের সবাইকে সুস্থ এবং নিরাপদ রাখুন, আমিন…\n");

        return ashfiaText;
    }

    public ArrayList<String> getRuqyahShariyahHeaders () {
        ArrayList<String> ruqyahShariyahHeader = new ArrayList<>();
        ruqyahShariyahHeader.add("অবতরণিকা");
        ruqyahShariyahHeader.add("প্রাথমিক ধারণা");
        ruqyahShariyahHeader.add("সাধারণ অসুস্থতার জন্য রুকইয়াহ");
        ruqyahShariyahHeader.add("বদনজর আক্রান্ত হওয়ার লক্ষণ");
        ruqyahShariyahHeader.add("বদনজরের জন্য রুকইয়াহ");
        ruqyahShariyahHeader.add("রুকইয়ার গোসল");
        ruqyahShariyahHeader.add("জিন আক্রান্ত হওয়ার লক্ষণ");
        ruqyahShariyahHeader.add("জ্বিনের আসরের জন্য রুকইয়াহ");
        ruqyahShariyahHeader.add("বাড়িতে জ্বিনের উৎপাত থাকলে");
        ruqyahShariyahHeader.add("ওয়াসওয়াসা রোগের জন্য রুকইয়া");
        ruqyahShariyahHeader.add("যাদু আক্রান্ত হওয়ার লক্ষণ");
        ruqyahShariyahHeader.add("যাদু / ব্ল্যাক ম্যাজিক / বান মারার জন্য রুকইয়া");
        ruqyahShariyahHeader.add("যাদুর কোন জিনিশ অথবা তাবিজ খুঁজে পেলে");
        ruqyahShariyahHeader.add("যাদু, জ্বিন, বদনজর সম্পর্কিত একাধিক সমস্যায় আক্রান্ত হলে");
        ruqyahShariyahHeader.add("রুকইয়ার আয়াত");
        ruqyahShariyahHeader.add("যাদু, জিন, শয়তান ইত্যাদির ক্ষতি থেকে বাঁচার উপায়:");
        ruqyahShariyahHeader.add("গুরুত্বপূর্ণ লিংক");
        return ruqyahShariyahHeader;
    }

    public ArrayList<String> getRuqyahShariyahExpandableTexts () {
        ArrayList<String> expandText = new ArrayList<>();
        expandText.add("রুকইয়া শারইয়াহ বিষয়ে অনেক লম্বা চওড়া লেখা আছে, ইতোমধ্যে আমাদের রুকইয়াহ শারইয়াহ সিরিজও শেষ। সেখানে বিস্তারিত আলোচনা হয়েছে। ইনশাআল্লাহ খুব শীঘ্রই এবিষয়ে বই প্রকাশ হবে। আজ আমরা সংক্ষেপে রুকইয়া পরিচিতি এবং বিভিন্ন সমস্যার জন্য রুকইয়া করার পদ্ধতি আলোচনা করবো। বলতে পারেন এই লেখাটি অতীত ও ভবিষ্যতের পুরো রুকইয়াহ সিরিজের সারাংশ।\n" +
                "এর প্রথম সংস্করণ ১৭ জুন প্রকাশিত হয়েছিল। এরপর কিছু সংশোধন এবং সংযোজন করা হয়েছে। এটি চতুর্থ সংস্করণ। এই লেখায় আরও কিছু যোগ করার পরামর্শ থাকলে জানাবেন, আর কোনো পুস্তক-পত্রিকা অথবা ফেসবুকের বাহিরে অন্য কোথাও প্রকাশ করতে চাইলে অনুগ্রহ পুর্বক অনুমতি নিবেন।\n" +
                "আল্লাহ আমাদের সবাইকে হিফাজত করুন। আমীন!\n");
        expandText.add("রুকইয়াহ কী? রুকইয়াহ অর্থ ঝাড়ফুঁক করা, মন্ত্র পড়া, তাবিজ-কবচ, মাদুলি ইত্যাদি। আর রুকইয়াহ শারইয়্যাহ (رقيةشرعية) মানে শরিয়াত সম্মত রুকইয়াহ, কোরআনের আয়াত অথবা হাদিসে বর্ণিত দোয়া দ্বারা ঝাড়ফুঁক করা। তবে স্বাভাবিকভাবে ‘রুকইয়া’ শব্দটি দ্বারা ঝাড়ফুঁক করা বুঝায়। এই ঝাড়ফুঁক সরাসরি কারো ওপর হতে পারে, অথবা কোনো পানি বা খাদ্যের ওপর করে সেটা খাওয়া অথবা ব্যাবহার করা হতে পারে। এক্ষেত্রে রুকইয়ার পানি, অথবা রুকইয়ার গোসল ইত্যাদি পরিভাষা ব্যবহার হয়। আর সবগুলোই সালাফে সালেহিন থেকে বর্নিত আছে।\n" +
                "রুকইয়ার বিধানঃ রাসুলুল্লাহ সল্লাল্লহু আলাইহি ওয়াসাল্লাম বলেছেন, “রুকইয়াতে যদি শিরক না থাকে, তাহলে কোনো সমস্যা নেই।” (সহীহ মুসলিম, হাদিস নং ৫৫৪৪)\n" +
                "বিশুদ্ধ আক্বিদাঃ উলামায়ে কিরামের মতে রুকইয়া করার পূর্বে এই আক্বিদা স্পষ্টভাবে জানিয়ে দেয়া উচিত ‘রুকইয়া বা ঝাড়ফুঁকের নিজস্ব কোনো ক্ষমতা নেই, সব ক্ষমতা আল্লাহ তা’আলার, আল্লাহ চাইলে শিফা হবে, নইলে নয়।’\n" +
                "রুকইয়া প্রকারভেদঃ বিভিন্ন ভাবে রুকইয়া করা হয়, যেমনঃ দোয়া বা আয়াত পড়ে ফুঁ দেয়া হয়, মাথায় বা আক্রান্ত স্থানে হাত রেখে দোয়া/আয়াত পড়া হয়। এছাড়া পানি, তেল, খাদ্য বা অন্য কিছুতে দোয়া অথবা আয়াত পড়ে ফুঁদিয়ে খাওয়া ও ব্যাবহার করা হয়।\n" +
                "পূর্বশর্তঃ রুকইয়া করে উপকার পেতে তিনটি জিনিসের প্রয়োজন। \n" +
                "\uF0D8\tনিয়্যাত (কেন রুকইয়া করছেন, সেজন্য নির্দিষ্টভাবে নিয়াত করা) \n" +
                "\uF0D8\tইয়াক্বিন (এব্যাপারে ইয়াকিন রাখা যে, আল্লাহর কালামে শিফা আছে) \n" +
                "\uF0D8\tমেহনত (অনেক কষ্ট হলেও, সুস্থ হওয়া পর্যন্ত ধৈর্য ধরে রুকইয়া চালিয়ে যাওয়া)।\n" +
                "লক্ষণীয়ঃ রুকইয়ার ফায়দা ঠিকমতো পাওয়ার জন্য দৈনন্দিনের ফরজ অবশ্যই পালন করতে হবে, পাশাপাশি সুন্নাতের প্রতিও যত্নবান হতে হবে। যথাসম্ভব গুনাহ থেকে বাঁচতে হবে। (মেয়েদের জন্য পর্দার বিধানও ফরজ) ঘরে কোনো প্রাণীর ছবি / ভাস্কর্য রাখা যাবেনা। আর সুরক্ষার জন্য সকাল-সন্ধ্যার মাসনুন আমলগুলো অবশ্যই করতে হবে। আর ইতিমধ্যে শারীরিক ক্ষতি হয়ে গেলে, সেটা রিকোভার করার জন্য রুকইয়ার পাশাপাশি ডাক্তারের চিকিৎসাও চালিয়ে যেতে হবে।\n");
        expandText.add("বিভিন্ন অসুখ-বিসুখের জন্য রাসুল স. থেকে অনেক দু’আ-কালাম পাওয়া যায়, সেসব গুরুত্বের সাথে করা। এছাড়া কোরআন থেকে প্রসিদ্ধ কয়েকটি রুকইয়া হচ্ছে সুরা ফাতিহা, সুরা ফালাক, সুরা নাস এবং ৬টি আয়াতে শিফা (৯/১৪, ১০/৫৭, ১৬/৬৯, ১৭/৮২, ২৬/৮০, ৪১/৪৪)\n" +
                "\u200Fوَيَشْفِ صُدُورَ قَوْمٍ مُّؤْمِنِينَ \n\n" +
                "\u200Fوَشِفَاء لِّمَا فِي الصُّدُورِ\n\n" +
                "\u200F يخْرُجُ مِن بُطُونِهَا شَرَابٌ مُّخْتَلِفٌ أَلْوَانُهُ فِيهِ شِفَاء لِلنَّاسِ\n\n" +
                "\u200F وَنُنَزِّلُ مِنَ الْقُرْآنِ مَا هُوَ شِفَاء وَرَحْمَةٌ لِّلْمُؤْمِنِينَ\n\n" +
                "\u200F وَإِذَا مَرِضْتُ فَهُوَ يَشْفِينِ\n\n" +
                "\u200F قُلْ هُوَ لِلَّذِينَ آمَنُوا هُدًى وَشِفَاء\n\n" +
                "\n" +
                "এছাড়া রুকইয়া হিসেবে রাসুল স. থেকে বর্ণিত অনেক দো’আ আছে, যেমন-\n\n" +
                " \u200F اللَّهُمَّ رَبَّ النَّاسِ أَذْهِبْ الْبَاسَ، اشْفِهِ وَأَنْتَ الشَّافِي لَا شِفَاءَ إِلَّا شِفَاؤُكَ شِفَاءً لَا يُغَادِرُ سَقَمًا\n\n" +
                "\u200F بِسْمِ اللَّهِ أَرْقِيكَ، اللَّهُ يَشْفِيكَ، مِنْ كُلِّ شَيْءٍ يُؤْذِيكَ، مِنْ شَرِّ كُلِّ نَفْسٍ أَوْ عَيْنِ حَاسِدٍ، اللَّهُ يَشْفِيكَ بِسْمِ اللَّهِ أَرْقِيكَ\n\n" +
                "\u200F بِاسْمِ اللَّهِ يُبْرِيكَ، وَمِنْ كُلِّ دَاءٍ يَشْفِيكَ، وَمِنْ شَرِّ حَاسِدٍ إِذَا حَسَدَ، وَشَرِّ كُلِّ ذِي عَيْنٍ\n\n" +
                "\u200F  اَسْأَلُ اللهَ الْعَظِيْم، رَبَّ الْعَرْشِ الْعَظِيْم، اَنْ يَّشْفِيَكْ\n\n" +
                "\u200F بِسْمِ اللَّه، بِسْمِ اللَّه، بِسْمِ اللَّه، أَعُوذُ بِعِزَّةِ اللَّهِ وَقُدْرَتِهِ، مِنْ شَرِّ مَا أَجِدُ وَأُحَاذِرُ\n\n" +
                "এসব আয়াত এবং দোয়াগুলো ৩বার করে পড়ুন, ব্যাথার যায়গায় অথবা রুগীর মাথায় হাত রেখে পড়ুন, অথবা এসব পড়ার পর রুগীর ওপর ফুঁ দিন। পানিতে ফুঁ দিয়ে পান করুন, অথবা অলিভ অয়েলে ফুঁ দিয়ে মালিশ করুন। মধু-কালোজিরায় ফু দিয়ে সকাল করে পানিতে গুলিয়ে খান। এসবের পাশাপাশি শাইখ হুজাইফির রুকইয়াহ, এবং সা’দ আল গামিদির আধাঘণ্টার রুকইয়া শোনা যেতে পারে।\n");
        expandText.add("বদনজর আক্রান্ত হওয়ার অনেকগুলো লক্ষণ রয়েছে, এরমাঝে কয়েকটি হচ্ছে-\n" +
                "1.\tকোন কাজে মনোযোগ না থাকা। নামায, যিকর, পড়াশোনাতে মন না বসা।\n" +
                "2.\tপ্রায়শই শরীর দুর্বল থাকা, ক্ষুধামন্দা, বমি বমি ভাব লাগা।\n" +
                "3.\tবুক ধড়পড় করা, দমবন্ধ অস্বস্তি লাগা। মেজাজ বিগড়ে থাকা।\n" +
                "4.\tমেয়েদের ক্ষেত্রে অতিরিক্ত চুল পড়া। প্রচুর গ্যাস হওয়া।\n" +
                "5.\tএকেরপর এক অসুখ লেগে থাকা, দীর্ঘ চিকিৎসাতেও ভালো না হওয়া।\n" +
                "6.\tব্যবসায়-লেনদেনে ঝামেলা লেগেই থাকা। সব কিছুতেই লস হওয়া।\n");
        expandText.add("যদি বুঝা যায় অমুকের জন্য নজর লেগেছে, তাহলে তাকে অযু করতে বলুন, এবংওযুর পানি গুলো আক্রান্তের গায়ে ঢেলে দিন। এরপর চাইলে ভালো পানি দিয়ে গোসল করুন। এতটুকুতেই নজর ভালো হয়ে যাবে ইনশা-আল্লাহ।\n" +
                "আর বদনজরের সেলফ রুকইয়া হচ্ছে, বদনজরের রুকইয়া তিলাওয়াত করবেন, অথবা একাধিকবার তিলাওয়াত শুনতে হবে\nএর পাশাপাশি রুকইয়ার গোসল করবেন। আর এভাবে লাগাতার ৩ থেকে ৭ দিন করবেন। সমস্যা ভালো হওয়া পর্যন্ত করুন। প্রতিদিন কয়েকবার রুকইয়া শুনুন, আর একবার রুকইয়ার গোসল করুন। সমস্যা ভালো হওয়ার পরেও এরকম কয়েকদিন করা উচিত।\n");
        expandText.add("একটা বালতিতে পানি নিবেন। তারপর পানিতে দুইহাত ডুবিয়ে যেকোনো দরুদ শরিফ, সুরা ফাতিহা, আয়াতুল কুরসি, সুরা ইখলাস, ফালাক্ব, নাস, শেষে আবার কোনো দরুদ শরিফ-সব ৭বার করে পড়বেন। পড়ার পর হাত উঠাবেন এবং এই পানি দিয়ে গোসল করবেন।\n" +
                "(এগুলা পড়ে পানিতে ফু দিবেন না, এমনিই গোসল করবেন। যদি টয়লেট আর গোসলখানা একসাথে থাকে, তাহলে অবশ্যই এসব বাহিরে বালতি এনে পড়বেন। প্রথমে এই পানি দিয়ে গোসল করবেন, তারপর চাইলে অন্য পানি দিয়ে ইচ্ছামত গোসল করতে পারেন। যার সমস্যা সে পড়তে না পারলে অন্যকেউ তার জন্য পড়বে, এবং অসুস্থ ব্যক্তি শুধু গোসল করবে।)\n");
        expandText.add("জিন দ্বারা আক্রান্ত হওয়ার অনেকগুলো লক্ষণ রয়েছে, এরমাঝে কয়েকটি হচ্ছে-\n" +
                "1.\tরাতে ঠিকমত ঘুমাতে না পারা।\n" +
                "2.\tপ্রায়শই ঘুমের মাঝে বোবা ধরা।\n" +
                "3.\tভয়ংকর স্বপ্ন দেখা। উঁচু থেকে পড়ে যেতে, কোন প্রাণীকে আক্রমণ করতে দেখা।\n" +
                "4.\tদীর্ঘ মাথাব্যথা, অথবা অন্য কোন অঙ্গে সবসময় ব্যাথা থাকা।\n" +
                "5.\tনামাজ, তিলাওয়াত, যিকির আযকারে আগ্রহ উঠে যাওয়া।\n" +
                "6.\tমেজাজ বিক্ষিপ্ত হয়ে থাকা, একটুতেই রেগে যাওয়া।\n" +
                "7.\tআযান বা কোরআন তিলাওয়াত সহ্য না হওয়া। \n");
        expandText.add("যিনি রুকইয়া করবেন তিনি প্রথমে সুরা ইখলাস, সুরা ফালাক, সুরা নাস পড়ে হাতে ফুঁ দিয়ে নিজের শরীরে হাত বুলিয়ে নিবেন। এরপর রুকইয়া শুরু করবেন। জ্বিনের রুগীর ক্ষেত্রে সাধারণত কথাবার্তা বলে জ্বিন বিদায় করতে হয়। এক্ষেত্রে যিনি রুকইয়া করবেন তাঁকে উপস্থিতবুদ্ধির পরিচয় দিতে হবে। জ্বিনের কথায় ঘাবড়ানো যাবেনা, তার কথা বিশ্বাসও করা যাবে না। হুমকিধামকি দিলে জিনকেই উল্টা ধমক দিতে হবে। রুগীর মাথায় হাত রেখে অথবা (গাইরে মাহরাম হলে) রুগীর পাশে বসে জোর আওয়াজে রুকইয়ার আয়াতগুলো পড়তে থাকুন। পড়ার মাঝেমাঝে রুগীর ওপর ফুঁ দিতে পারেন, আর পানিতে ফুঁ দেয়ার পর মুখে এবং হাতে-পায়ে ছিটিয়ে দিতে পারেন।\n" +
                "রুকইয়ার অনেক আয়াত আছে সেগুলো শেষে বলা হবে। তবে স্বাভাবিকভাবে সুরা ফাতিহা, আয়াতুল কুরসি, সুরা ফালাক, সুরা নাস, সুরা সফফাতের প্রথম ১০ আয়াত, সুরা জিনের প্রথম ৯ আয়াত পড়তে পারেন। জ্বিন ছেড়ে দেয়া পর্যন্ত রুগীর কাছে বসে উঁচু আওয়াজে এই আয়াতগুলো বারবার পড়তে হবে আর ফুঁ দিতে হবে অথবা রুগীর মাথায় হাত রেখে পড়তে হবে। একদিনে না গেলে পরপর কয়েকদিন কয়েকঘন্টা করে এভাবে রুকইয়া করে যেতে হবে। ইনশাআল্লাহ এক পর্যায়ে জ্বিন পালাতে বাধ্য হবে।\n");
        expandText.add("বাড়িতে জ্বিনের কোনো সমস্যা থাকলে পরপর তিনদিন পূর্ন সুরা বাক্বারা তিলাওয়াত করুন, এরপর আযান দিন। তাহলে ইনশাআল্লাহ সমস্যা ঠিক হয়ে যাবে। তিলাওয়াত না করে প্রতিদিন ঘণ্টার পর ঘণ্টা কয়েকবার যদি সুরা বাক্বারা প্লে করা হয় তাহলেও ফায়দা পাওয়া যাবে ইনশাআল্লাহ। তবে সবচেয়ে ভালো ফল পেলে তিলাওয়াত করা উচিত। এরপর প্রতিমাসে অন্তত এক দুইদিন সুরা বাকারা পড়বেন। আর ঘরে প্রবেশের সময়, বের হবার সময়, দরজা-জানালা বন্ধের সময় বিসমিল্লাহ বলবেন। ঘুমের আগে সুরা বাকারার শেষ ২ আয়াত পড়বেন। তাহলে ইনশাআল্লাহ আর কোন সমস্যা হবে না। ");
        expandText.add("1.\tএই দোয়াটি বেশি বেশি পড়া। প্রতি নামাজের আগে-পরে, অন্যন্য ইবাদতের সময়, কোন গুনাহের জন্য ওয়াসওয়াসা অনুভব করলে এটা পড়া -\n" +
                "أَعُوْذُ بِكَلِمَاتِ اللهِ التَّامَّاتِ، مِنْ غَضَبِهٖ وَعِقَابِهِ، وَشَرِّ عِبَادِهِ، وَ مِنْ هَمَزَاتِ الشَّيَاطِيْنِ، وَأَنْ يَّحْضُرُوْنِ\n" +
                "2.\tওয়াসওয়াসা অনুভব করলে বলা (সুরা হাদীদ, আয়াত নং ৩)\n" +
                "هُوَ الْأَوَّلُ وَالْآخِرُ وَالظَّاهِرُ وَالْبَاطِنُ ۖ        وَهُوَ بِكُلِّ شَيْءٍ عَلِيْم\n" +
                "[বিশেষতঃ ঈমান নিয়ে সংশয় উদিত হলে এটা পড়া উচিত। আর সকাল-সন্ধ্যায় সুরা ইখলাস পড়া]\n" +
                "3.\tআয়াতুল হারক (আযাব এবং জাহান্নাম সংক্রান্ত আয়াত) বেশি বেশি তিলাওয়াত করা। এবং প্রতিদিন ৩-৪বার এসবের তিলাওয়াত শোনা। \n" +
                "4.\tনাপাক থেকে বেচে থাকা, বিশেষত প্রসাবের ছিটা থেকে বাচা। যথাসম্ভব সর্বদা ওযু অবস্থায় থাকা।\n" +
                "5.\tপুরুষ হলে জামাআতের সাথে নামাজ পড়া, মুত্তাকী পরহেজগারদের সাথে উঠাবসা করা।\n" +
                "6.\tসকাল-সন্ধ্যায় ও ঘুমের আগের আমলগুলো গুরুত্বের সাথে করা। টয়লেটে প্রবেশের দোয়া পড়া।\n" +
                "7.\tআল্লাহর কাছে দোয়া করতে থাকা। যথাসম্ভবত ওয়াসওয়াসা পাত্তা না দেয়া; ইগনোর করা, এমনকি মুখে বিরক্তির ভাবও প্রকাশ না করা।\n");
        expandText.add("যাদু করতে জ্বিনের সাহায্য নেয়া হয়, তাই যাদুগ্রস্থ রোগীর মাঝে জিন আক্রান্তের কিছু লক্ষণগুলো পাওয়া যায়। তবে এছাড়াও যাদুগ্রস্থ রোগীর মাঝে কিছু বিশেষ লক্ষণ দেখা যেতে পারে। যেমনঃ \n" +
                "1.\tহঠাৎ কারও প্রতি বা কোন কিছুর প্রতি তীব্র ভালবাসা অথবা ঘৃণা তৈরি হওয়া, যা আগে ছিল না।\n" +
                "2.\tবিশেষ কোন কারন ছাড়াই জটিল-কঠিন রোগে ভোগা। যার চিকিৎসা করলেও সুস্থ না হওয়া।\n" +
                "3.\tপরিবারের মধ্যে ঝগড়া-ঝাটি লেগেই থাকা। বিশেষতঃ স্বামীস্ত্রীর মাঝে।\n" +
                "4.\tদৃষ্টিভঙ্গি বা ব্যক্তিত্বে ব্যপক পরিবর্তন। যাতে নিজেও ক্ষতিগ্রস্থ হয়, চারপাশের মানুষও কষ্ট পায়।\n" +
                "5.\tঅদ্ভুত আচরণ করা। যেমন, কোন কাজ একদমই করতে না চাওয়া। কিংবা দিন-রাতের নির্দিষ্ট কোন সময়ে ঘরের বাইরে যেতে না চাওয়া।\n" +
                "আর যাদু আক্রান্ত ব্যক্তির ওপর রুকইয়ার আয়াতগুলো পড়লে, অথবা অডিও শুনলে অস্বাভাবিক অনুভূতি হয়। যেমন, প্রচণ্ড মাথা ব্যথা, বমি আসা, বুক ধড়ফড় করা, ইত্যাদি।\n");
        expandText.add("যাদুর প্রকারভেদ অনুযায়ী বিভিন্ন প্রকার রুকইয়া করা হয়। তবে কমন সেলফ রুকইয়া হচ্ছে-\n" +
                "প্রথমে সমস্যার জন্য নিয়াত ঠিক করে, ইস্তিগফার দরুদ শরিফ পড়ে শুরু করুন। তারপর কোন রুকইয়া শুনে নিশ্চিত হয়ে নিন আসলেই সমস্যা আছে কি না! শাইখ সুদাইসের অথবা লুহাইদানের রুকইয়া শুনতে পারেন \nসবশেষে একটি বোতলে পানি নিন, এরপর- \nক. সুরা আ'রাফ ১১৭-১২২ \nখ. ইউনুস ৮১-৮২ \nগ. সুরা ত্বহা ৬৯নং \nআয়াত পড়ে ফুঁ দিন।\n\n" +
                "\u200F وَأَوْحَيْنَا إِلَىٰ مُوسَىٰ أَنْ أَلْقِ عَصَاكَۖ   فَإِذَا هِيَ تَلْقَفُ مَا يَأْفِكُوْنَ - فَوَقَعَ الْحَقُّ وَبَطَلَ مَا كَانُوْا يَعْمَلُونَ - فَغُلِبُوْا هُنَالِكَ وَانقَلَبُوْا صَاغِرِيْنَ - وَأُلْقِيَ السَّحَرَةُ سَاجِدِيْنَ  -قَالُوْا آمَنَّا بِرَبِّ الْعَالَمِيْنَ - رَبِّ مُوسَىٰ وَهَارُوْنَ -\n\n" +
                " \u200Fفَلَمَّا أَلْقَوْا قَالَ مُوسَىٰ مَا جِئْتُمْ بِهِ السِّحْرُۖ  إِنَّ اللّٰهَ سَيُبْطِلُهُۖ  إِنَّ اللّٰهَ لَا يُصْلِحُ عَمَلَ الْمُفْسِدِيْنَ - وَيُحِقُّ اللّٰهُ الْحَقَّ بِكَلِمَاتِهِ وَلَوْكَرِهَ الْمُجْرِمُونَ -\n\n" +
                " \u200F وَأَلْقِ مَافِي يَمِيْنِكَ تَلْقَفْ مَا صَنَعُوْاۖ  إِنَّمَا صَنَعُوْا كَيْدُ سَاحِرٍۖ  وَلَا يُفْلِحُ السَّاحِرُ حَيْثُ أَتٰى \n\n" +
                "ঘ. এরপর সুরা ফালাক্ব, সুরা নাস সব ৩বার করে পড়ে ফুঁ দিন।\n" +
                "তিন থেকে সাতদিন সকাল-বিকাল এই পানি খেতে হবে, এবং গোসলের পানিতে মিশিয়ে গোসল করতে হবে। আর মাসখানেক প্রতিদিন দেড়-দুইঘণ্টা রুকইয়া শুনতে হবে। সাধারণ কোন রুকইয়া, আর সুরা ইখলাস, ফালাক, নাসের রুকইয়াহ। এর পাশাপাশি আল্লাহর কাছে সুস্থতার জন্য দোয়া করতে হবে। \n" +
                "এভাবে একদম সুস্থ না হওয়া পর্যন্ত রুকইয়া করে যাবেন, সমস্যা বেড়ে গেলেও বাদ দিবেন না। তাহলে ইনশাআল্লাহ খুব দ্রুতই পরিপূর্ণ সুস্থ হয়ে যাবেন।\n");
        expandText.add("কি দিয়ে যাদু করেছে যদি পাওয়া যায়, অথবা সন্দেহজনক কোন তাবিজ পেলে উপরে বলা আয়াতগুলো পড়ে পানিতে ফুঁ দিন, এরপর তাবিজ অথবা যাদুর জিনিশগুলো ডুবিয়ে রাখুন কিছুক্ষণ, তাহলে ইনশাআল্লাহ যাদু নষ্ট হয়ে যাবে। পরে সেগুলো পুড়িয়ে বা নষ্ট করে দিন।\n");
        expandText.add("একসাথে একাধিক সমস্যায় আক্রান্ত হলে প্রথমে বদনজরের জন্য রুকইয়া করতে হবে, এরপর জ্বিনের জন্য এবং যাদুর জন্য রুকইয়া করতে হবে।\n ");
        expandText.add("কোরআন মাজিদের বিভিন্ন আয়াত দ্বারা রুকইয়া করা হয়, তন্মধ্যে প্রসিদ্ধ কিছু আয়াত হচ্ছে-\n" +
                "1.\tসুরা ফাতিহা\n" +
                "2.\tসুরা বাকারা ১-৫\n" +
                "3.\tসুরা বাকারাহ ১০২\n" +
                "4.\tসুরা বাকারাহ ১৬৩-১৬৪\n" +
                "5.\tসুরা বাকারাহ ২৫৫\n" +
                "6.\tসুরা বাকারাহ ২৮৫-২৮৬\n" +
                "7.\tসুরা আলে ইমরান ১৮-১৯\n" +
                "8.\tসুরা আ'রাফ ৫৪-৫৬\n" +
                "9.\tসুরা আ'রাফ ১১৭-১২২\n" +
                "10.\tসুরা ইউনুস ৮১-৮২\n" +
                "11.\tসুরা ত্বহা ৬৯\n" +
                "12.\tসুরা মু'মিনুন ১১৫-১১৮\n" +
                "13.\tসুরা সফফাত ১-১০\n" +
                "14.\tসুরা আহকাফ ২৯-৩২\n" +
                "15.\tসুরা আর-রাহমান ৩৩-৩৬\n" +
                "16.\tসুরা হাশর ২১-২৪\n" +
                "17.\tসুরা জিন ১-৯\n" +
                "18.\tসুরা ইখলাস\n" +
                "19.\tসুরা ফালাক\n" +
                "20.\tসুরা নাস\n");
        expandText.add("১. বিষ, যাদু এবং অন্যান্য ক্ষতি থেকে বাঁচতে সকাল-সন্ধ্যায় এই দোয়া তিনবার পড়াঃ\n" +
                "أَعُوذُ بِكَلِمَاتِ اللَّهِ التَّامَّاتِ مِنْ شَرِّ مَا خَلَقَ\n" +
                "আ’উযু বিকালিমা-তিল্লা-হিত্তা-ম্মা-তি, মিং-শাররি মা-খলাক্ব। (জামে তিরমিযী, ৩৫৫৯)\n" +
                "\n" +
                "২. সব ধরনের ক্ষতি এবং বিপদ-আপদ থেকে নিরাপদ থাকতে এই দোয়া সকাল-সন্ধ্যায় তিনবার পড়াঃ \n" +
                "بِسْمِ اللهِ الَّذِيْ لاَ يَضُرُّ مَعَ اسْمِه شَيْءٌ فِي الأَرْضِ وَلاَ فِي السَّمَاءِ وَهُوَ السَّمِيْعُ العَلِيْمُ\n" +
                "বিসমিল্লা-হিল্লাযী লা-ইয়াদ্বুররু মা‘আসমিহী, শাইউং ফিলআরদ্বী ওয়ালা- ফিসসামা-ই, ওয়াহুওয়াস সামি’উল ‘আলীম। (জামে তিরমিযী, ৩৩৩৫)\n" +
                "৩. প্রতিদিন সকাল-সন্ধ্যায় সুরা ইখলাস, সুরা ফালাক, সুরা নাস তিনবার করে পড়া। এবং এটা বিশেষ গুরুত্বের সাথে করা। (সুনানে আবি দাউদ) \n" +
                "\n" +
                "৪. ঘুমের আগে আয়াতুল কুরসি পড়া এবং সুরা বাকারার শেষ দুই আয়াত পড়া। সুরা ইখলাস, সুরা ফালাক, সুরা নাস পড়ে হাতের তালুতে ফু দিয়ে পুরো শরীরে হাত বুলিয়ে নেয়া। (বুখারী)\n" +
                "\n" +
                "৫. টয়লেটে ঢোকার পূর্বে দোয়া পড়া-\n" +
                "اللَّهُمَّ إِنِّيْ أَعُوْذُ بِكَ مِنَ الْخُبْثِ وَالْخَبَائِثِ\n" +
                "আল্লা-হুম্মা ইন্নী আ’উযুবিকা, মিনাল খুবসি ওয়াল খবা-ইছ। (মুসলিম, ৩৭৫)\n" +
                "\n" +
                "৬. তাহাজ্জুদ নামাজ পড়া। প্রতিদিনের অন্যান্য মাসনুন আমল করতে থাকা। এবং আল্লাহর কাছে সবসময় দোয়া করতে থাকা।\n");
        expandText.add("সর্বশেষ আপডেটঃ  (৪.৩) চতুর্থ সংস্করণ, ০১ - ডিসম্বর – ২০১৭  \n" +
                "উইকিপিডিয়াঃ https://bn.wikipedia.org/wiki/রুকইয়াহ_শারইয়াহ\n");
        return expandText;
    }

    public ArrayList<String> getMasnunHeader () {
        ArrayList<String> masnunHeader = new ArrayList<>();
        masnunHeader.add("সকাল-সন্ধ্যার আমল");
        masnunHeader.add("ঘুমানোর সময়ের আমল");
        masnunHeader.add("অন্যান্য সময়ের আমল");

        return masnunHeader;
    }

    public  ArrayList<String> getMasnunExpandableTexts () {
        ArrayList<String> expandText = new ArrayList<>();
        expandText.add("১. বিষ, যাদু এবং অন্যান্য বিষাক্ত প্রাণীর ক্ষতি থেকে বাঁচতে সকাল-সন্ধ্যায় তিনবার পড়ুন:\n" +
                "أَعُوْذُ بِكَلِمَاتِ اللّٰه التَّامَّاتِ   مِنْ شرِّ مَا خَلقَ\n" +
                "উচ্চারণঃ আ’উযু বিকালিমা-তিল্লা-হিত্তা-ম্মা-তি, মিং-শাররি মা-খলাক্ব। \n" +
                "(জামে তিরমিযী ৩৫৫৯, আবু দাউদ, ইবনে মাযাহ, মুয়াত্তা মালেক)\n" +
                "\n" +
                "২. সব ধরনের ক্ষতি এবং বিপদ-আপদ থেকে নিরাপদ থাকতে সকাল-সন্ধ্যায় তিনবার পড়া:\n" +
                "بِسْمِ اللّٰه ِالَّذِيْ لَا يَضُرُّ مَعَ اسْمِهٖ شَيْءٌ فِي الْأَرْضِ وَلَا فِي السَّمَاءِ وَهُوَ السَّمِيْعُ العَلِيْمُ\n" +
                "উচ্চারণঃ বিসমিল্লা-হিল্লাযী লা-ইয়াদ্বুররু মা‘আসমিহী, শাইউং ফিলআরদ্বী ওয়ালা- ফিসসামা-ই, ওয়াহুওয়াস সামি’উল ‘আলীম।  \n" +
                "(জামে তিরমিযী, ৩৩৩৫, আবু দাউদ, ইবনে মাযাহ, মুসনাদে আহমাদ)\n" +
                "\n" +
                "৩. সুরা তাওবাহ ১২৯ নং আয়াতের অংশ-\n" +
                "حَسْبِيَ اللَّهُ لَا إِلَهَ إِلَّا هُوَ، عَلَيْهِ تَوَكَّلْتُ وَهُوَ رَبُّ الْعَرْشِ الْعَظِيمِ\n" +
                "যে ব্যক্তি সন্ধ্যায় সাতবার এটি পাঠ করবে, আল্লাহ তাআলা তাঁর জন্য যথেষ্ট হয়ে যাবেন। \n" +
                "(সুনানে আবি দাউদ)\n" +
                "\n" +
                "৪. সুরা ইখলাস, সুরা ফালাক, সুরা নাস: প্রতিদিন সকাল-সন্ধ্যায় তিনবার করে পড়া। সব ধরনের অনিষ্ট থেকে বাঁচতে এটা রাসুল স. এর শিখানো আমল। (সুনানে আবি দাউদ)\n" +
                "\n" +
                "৫. প্রতিদিন সকালে ১০০বার পড়া।\n" +
                "لَا إِلَهَ إِلَّا اللهُ ، وَحْدَهُ لَا شَرِيكَ لَهُ ، لَهُ الْمُلْكُ ، وَلَهُ الْحَمْدُ ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ\n" +
                "উচ্চারণঃ লা-ইলাহা ইল্লাল্লাহু ওয়াহদাহু লা-শারীকালাহ, লাহুল মুলকু ওয়ালাহুল হ্ামদ, ওয়াহুওয়া 'আলা কুল্লি শাইয়িন ক্বদীর।\n" +
                "এর অনেক বেশি ফজিলত, এবং জ্বিন-শয়তানের ক্ষতি থেকে বাঁচতে এটা পরিক্ষিত আমল। কোনদিন সকালে শেষ না করা গেলে সারাদিনে ১০০বার পড়লেও হবে। (বুখারি, মুসলিম হাদিস নং ৪৮৫৭)\n" +
                "একশতবার না পারলে, অন্তত ফজর ও আসরের পর ১০বার করে পড়া। (আবু দাউদ, মুসনাদে আহমাদ)\n");
        expandText.add("১. ওযু করে ঘুমানো, তাহলে ফিরিশতারা হিফাজতের জন্য দুয়া করতে থাকে। ডান কাত হয়ে ঘুমানো। এমনিতেও সর্বদা ওযু অবস্থায় থাকা সুন্নাত। (মু’জামুল আওসাত; সনদ হাসান-জায়্যিদ)\n" +
                "২. শোয়ার পূর্বে কোন কাপড় বা ঝাড়ু দিয়ে বিছানা ঝেড়ে নেয়া। এবং বিছানার শোয়ার পর এই দোয়া পড়া:\n" +
                "بِاسْمِكَ رَبِّي وَضَعْتُ جَنْبِي، وَبِكَ أَرْفَعُهُ، فَإِن أَمْسَكْتَ نَفْسِي فارْحَمْهَا، وَإِنْ أَرْسَلْتَهَا فَاحْفَظْهَا، بِمَا تَحْفَظُ بِهِ عِبَادَكَ الصَّالِحِينَ\n" +
                "উচ্চারণঃ বিসমিকা রব্বী ওয়াদ্বা‘তু জাম্বী, ওয়াবিকা আরফা‘উহু। ফাইন্ আম্\u200Cসাকতা নাফ্\u200Cসী ফারহামহা, ওয়াইন আরসালতাহা ফাহ্\u200Cফায্\u200Cহা বিমা-তাহ্\u200Cফাযু বিহী ‘ইবা-দাকাস সা-লিহীন।\n" +
                "৩. আয়াতুল কুরসি পড়া। (বুখারী) সুরা বাকারার শেষ দুই আয়াত পড়া। (বুখারী)\n" +
                "৪. সুরা ইখলাস, সুরা ফালাক, সুরা নাস পড়ে হাতের তালুতে ফু দেয়া, এরপর পুরো শরীরে হাত বুলিয়ে নেয়া। এভাবে তিনবার করা। (বুখারী)\n");
        expandText.add("১. সম্ভব হলে মদিনার আজওয়া খেজুরের ব্যবস্থা করা, না হয় যে কোন আজওয়া খেজুরেও হবে। রাসুল সল্লাল্লহু আলাইহি ওয়াসাল্লাম বলেছেন, যে ব্যক্তি সাতটি আজওয়া খেজুর সকাল বেলায় আহার করবে সেদিন তাকে কোন বিষ ও যাদু ক্ষতি করতে পারবে না। (বুখারী)\n" +
                "\n" +
                "২. টয়লেটে ঢুকার পূর্বে দোয়া পড়া-\n" +
                "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ الْخُبْثِ وَالْخَبَائِثِ \n" +
                "আল্লা-হুম্মা ইন্নী আ’উযুবিকা, মিনাল খুবসি ওয়াল খবা-ইছ। অর্থ: হে আল্লাহ আমি তোমার কাছে আশ্রয় প্রার্থনা করছি খারাপ জ্বিন ও খারাপ পরী থেকে। (সহীহ মুসলিম, ৩৭৫)\n" +
                "\n" +
                "৩. বিয়ের প্রথম রাতে স্ত্রীর কাছে গিয়ে পড়া [*]\n" +
                "اللَّهُمَّ إِنِّي أَسْأَلُكَ خَيْرَهَا وَخَيْرَ مَا جَبَلْتَهَا عَلَيْهِ ، وَأَعُوذُ بِكَ مِنْ شَرِّهَا وَشَرِّ مَا جَبَلْتَهَا عَلَيْهِ\n" +
                "[*] এবিষয়ে প্রচলিত একটি ভুল ধারণা হচ্ছে, অনেকে এটি স্ত্রীর মাথায় হাত রেখেই পড়তে হবে। কিছু হাদিসে মাথায় হাত রেখে পড়ার কথা থাকলেও, প্রসিদ্ধ হাদিসগুলোতে কিন্তু স্ত্রীর কাছে গিয়ে শুধু পড়ার কথা আছে। (সুনানে আবি দাউদ ২২৪৩ এবং ইবনে মাযাহ ১৯০৮ দ্রষ্টব্য)\n" +
                "\n" +
                "৪. স্ত্রী সহবাসের পূর্বে দোয়া পড়া।\n" +
                "بِسْمِ اللَّهِ، اللَّهُمَّ جَنِّبْنَا الشَّيْطَانَ، وَجَنِّبِ الشَّيْطَانَ مَا رَزَقْتَنَا\n" +
                "বিসমিল্লাহি আল্লা-হুম্মা জান্নিবনাশ শাইত্বা-না, ওয়া জান্নিবিশ্-শাইত্বানা মা-রযাকতানা। (বুখারী, ৪৮৭০)\n" +
                "\n" +
                "৫. নতুন কোন যায়গায় বা নতুন কোন বাড়িতে গেলে, অথবা কোন গা ছামছমে যায়গায় হাটলে পড়া:\n" +
                "أَعُوذُ بِكَلِمَاتِ اللَّهِ التَّامَّاتِ مِنْ شَرِّ مَا خَلَقَ\n" +
                "আ’উযু বিকালিমা-তিল্লা-হিত্তা-ম্মা-তি, মিং-শাররি মা-খলাক্ব। (মুসলিম ৪৮৮৮, তিযমিযি, ইবনে মাযাহ, মুয়াত্তা মালেক, মুসনাদে আহমাদ)\n" +
                "\n" +
                "৬. দৈনিক একবার হলেও মসজিদে প্রবেশের দোয়া পড়া\n" +
                "أَعُوذُ بِاللَّهِ الْعَظِيمِ وَبِوَجْهِهِ الْكَرِيمِ وَسُلْطَانِهِ الْقَدِيْمِ مِنْ الشَّيْطَانِ الرَّجِيْمِ \n" +
                "নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) বলেছেন: মসজিদে প্রবেশের সময় কেউ এটা পড়লে শয়তান বলে, এই ব্যক্তি আজ সারাদিনের জন্য আমার থেকে রক্ষা পেয়ে গেল। (সুনানে আবি দাউদ, ৩৯৩)\n" +
                "\n" +
                "৭. বিসমিল্লাহ বলে দরজা-জানালা লাগানো। বিসমিল্লাহ বলে ঘরে ঢোকা। খাবার আগে বিসমিল্লাহ বলা।\n");

        return expandText;
    }
}
