package com.hijamaplanet.drawer;

public class QuestionLibrary {
    public static String jinQuestions[] = {
            "ইবাদত বিমুখতা আছে আপনার? যেমন, ঠিকমত নামজ পড়েন?",
            "রাতে ঘুমাতে গেলে সারারাত ঘুমে না ধরা এমন সমস্যা হয় আপনার?",
            "কোরআন তেলাওয়াত শুনতে আপনার খারাপ লাগে?",
            "আপনি অতিরিক্ত গান শুনেন?",
            "আপনি সবসময় দুঃশ্চিন্তা করেন, উদ্বিগ্ন থাকেন?",
            "প্রায়ই আপনার মেজাজ বিক্ষিপ্ত হয়ে থাকে?",
            "আপনি অতিরিক্ত ঘুমান? ব্যাপক অলসতা হয়?",
            "অন্ধকারে থাকতে আপনার ভালো লাগে?",
            "কোন কারন ছাড়াই হাসাহাসি/কান্নাকাটি করেন?",
            "ঘন ঘন বোবায় ধরার সমস্যা হয়? মনে হয় যে কেউ চেপে ধরেছে, নড়তে পারছেন না এমন হয়?",
            "আপনি ঘুমন্ত অবস্থায় হাটাহাটি করেন?",
            "হঠাৎ আপনার শরীরের কোন অঙ্গ অবশ/বিকল হয়ে গেছে? ডাক্তাররা যেখানে কোন সমস্যা খুঁজে পায় না, এমন হয়েছে?",
            "মেডিকেলীয় কোন ব্যখ্যা ছাড়াই আপনার শরীরের কোন যায়গায় স্থির ব্যথা থাকে?",
            "আপনার শরীরের বিশেষতঃ হাতে পায়ে লাল অথবা নীল অথবা হলুদ দাগ দেখা যায়?",
            "আপনার কি মনে হয় যে কেউ বিছানায় আপনার পাশে শুয়ে আছে অথবা কেউ আপনাকে ফলো করছে?",
            "বিছানায় কেউ আপনাকে জড়িয়ে ধরেছে এমন অনুভুতি হয়?",
            "আপনি এমন কোন আওয়াজ শুনতে পান যে কে কথা বলছে বুঝতে পারছেন না?",
            "জেগে থাকা অবস্থায় স্বপ্নের মত বিভিন্ন অদ্ভুত কল্পনা ভাসতে দেখেন?",
            "স্বপ্নে মাঝেমাঝেই বিশেষ আকৃতির মানুষ দেখেন? যেমন অনেক লম্বা, খুবই খাটো, খুব কালো কুচকুচে ",
            "স্বপ্নে নিজেকে অনেক উঁচু কোনো যায়গা থেকে পড়ে যেতে দেখেন?",
            "স্বপ্নে কোনো প্রাণিকে আক্রমণ করতে বা ধাওয়া করতে দেখেন?। বিশেষতঃ কুকুর বিড়াল ইঁদুর উট সিংহ শিয়াল সাপ",
            "ঘুমের মাঝে প্রায়শই চিৎকার গোঙানো হাসি-কান্নাকাটি করেন?",
            "ঘুম থেকে উঠার পর অনেক ক্লান্ত লাগে?",
            "স্বপ্নে নিজেকে উড়তে দেখেন?",
            "মৃগীরোগ আছে আপনার?"

    };
    public static int jinValue[][] = {
            {8, 0, 7, 0},
            {10, 0, 8, 0},
            {10, 0, 9, 0},
            {8, 0, 7, 0},
            {9, 0, 6, 0},
            {8, 0, 7, 0},
            {7, 0, 5, 0},
            {7, 0, 6, 0},
            {8, 0, 8, 0},
            {10, 0, 7, 0},
            {10, 0, 10, 0},
            {10, 0, 9, 0},
            {9, 0, 7, 0},
            {0, 8, 7, 0},
            {8, 0, 7, 0},
            {9, 0, 8, 0},
            {7, 0, 7, 0},
            {8, 0, 8, 0},
            {8, 0, 8, 0},
            {7, 0, 6, 0},
            {8, 0, 7, 0},
            {8, 0, 7, 0},
            {7, 0, 7, 0},
            {8, 0, 8, 0},
            {10, 0, 10, 0}
    };

    public static String envyQuestions[] = {
            "প্রায়সময় কাজ, নামায, যিকর, ক্লাসে মন না বসা",
            "আত্মীয়-স্বজন বা বন্ধুদের সাথে দেখা হলেই ভালো না লাগা",
            "অহেতুক মেজাজ বিগড়ে থাকা।",
            "পেটে প্রচুর গ্যাস হওয়া",
            "চেহারা ধুসর/হলুদ হয়ে যাওয়া",
            "কোনো কারণ ছাড়াই কান্না আসা।",
            "প্রায়শই শরীর দুর্বল থাকা, ক্ষুধামন্দা, বমি বমি ভাব লাগা",
            "অতিরিক্ত চুল পড়া। শ্যাম্পুতে কাজ না করা।",
            "কোন কারণ ছাড়া প্রায়ই দীর্ঘশ্বাস ফেলা, অতিরিক্ত হাই উঠা।",
            "হাত-পায়ে মাঝেমধ্যেই ব্যাথা করা, পুরো শরীরে ব্যাথা দৌড়ে বেড়ানো। ",
            "মাথাব্যথা হওয়া। তবে ঔষধ খেলে উপকার হওয়া।",
            "শরীরে জ্বর থাকা কিন্তু থার্মোমিটারে না উঠা। ",
            "কোরআন তেলাওয়াত করলে বারবার হাই আসে, ঘুম পায়।",
            "আপনি যে কাজে অভিজ্ঞ সেটা করতে গেলেই ঝামেলা বাধা।",
            "বুক ধড়ফড় করা, দমবন্ধ, অস্বস্তি লাগা।"
    };
    public static int envyValue[][]={
            {8,0,6,0},
            {7,0,7,0},
            {9,0,7,0},
            {8,0,8,0},
            {9,0,9,0},
            {9,0,7,0},
            {9,0,8,0},
            {10,0,9,0},
            {8,0,7,0},
            {9,0,9,0},
            {8,0,8,0},
            {10,0,10,0},
            {9,0,7,0},
            {9,0,9,0},
            {9,0,7,0}
    };

    public static String witchQuestions[] = {
            "চোখের অবস্থা অস্বাভাবিক বা অসুন্দর লাগা।",
            "কোন কারণ ছাড়াই আপনার শরীর গরম থাকে?",
            "ব্যাকপেইন। বিশেষত মেরুদণ্ডের নিচের দিকে ব্যথা করা।",
            "(মহিলাদের ক্ষেত্রে) অনিয়মিত মাসিক (পুরুষদের ক্ষেত্রে) প্রসাবে ইনফেকশন এর সমস্যা আছে?",
            "প্রায়সময় পেট ব্যথা থাকে? ",
            "দীর্ঘদিন চিকিৎসা করেও কোন রোগ ভালো হচ্ছে না?",
            "তীব্র মাথা ব্যথা, ঔষধ খেয়েও তেমন ভালো হয়না?",
            "হঠাৎ করে কারো প্রতি তীব্র ঘৃণা বা তীব্র ভালোলাগা অনুভব হয়?",
            "পরিবার, বাসা, সমাজের প্রতি আপনার তীব্র বিতৃষ্ণা আছে? ",
            "বিকেল থেকে রাত পর্যন্ত খুব অস্বস্তিতে ভুগেন অথবা মেজাজ খারাপ থাকে?",
            "কোন কারণ ছাড়াই বাড়ি থেকে দৌড় দিয়ে বের হয়ে যেতে ইচ্ছা হয়?",
            "শরীরের বিভিন্ন জয়েন্টে অতিরিক্ত ব্যথা হয়?",
            "ঠিকমত ঘুমাতে না পারা। ঘুম হলে ভয়ংকর স্বপ্ন দেখা।",
            "স্বপ্নে কোনো গাড়ি বা প্রাণিকে আক্রমণ করতে বা ধাওয়া করতে দেখেন?। (যেমনঃ কুকুর বিড়াল গরু মহিষ বাঘ সিংহ সাপ)",
            "স্বপ্নে কোন ফাঁকা বাড়ি, মরুভূমি বা গোরস্থানে হাঁটাচলা করতে দেখেন? ",
            "স্বপ্নে বিভিন্ন যায়গায় পানি দেখেন? (যেমন সাগর, নদী, পুকুর, ইত্যাদি)",
            "স্বপ্নে ঘনঘন কোথাও আগুন জ্বলতে বা কিছু পোড়াতে দেখেন?",
            "স্বপ্নে নিজেকে উড়তে দেখেন? বা কোন পাখি অথবা বড়বড় গাছ দেখেন? "

    };
    public static int witchValue[][]={
            {9,0,7,0},
            {8,0,7,0},
            {9,0,8,0},
            {8,0,8,0},
            {9,0,8,0},
            {8,0,7,0},
            {9,0,9,0},
            {10,0,9,0},
            {8,0,7,0},
            {9,0,8,0},
            {10,0,8,0},
            {9,0,8,0},
            {9,0,8,0},
            {9,0,9,0},
            {9,0,9,0},
            {9,0,9,0},
            {9,0,9,0},
            {9,0,9,0}

    };

    public static String waswasQuestions[] = {
            "আপনি ইদানীং কারণে-অকারণে চিন্তিত থাকছেন? ",
            "আপনি হঠাৎ পরিবর্তন হয়ে গেছেন? কেমন যেন উদাস ভাব চলে এসেছে, কিছুই ভালো লাগছে না?",
            "সালাত বা ওযু নিয়ে বেশি দ্বিধাদ্বন্দ্বে আছেন? বারবার মনে হচ্ছে ঠিকমতো ওযু হচ্ছে না, নামাজের এই অংশটা ঠিকমত হল না এরকম হচ্ছে?",
            "পরিষ্কার পরিচ্ছন্নতা অথবা পরনের কাপড় নিয়ে আপনি কি অতিরিক্ত চিন্তা করছেন?",
            "আপনি কি অপ্রয়োজনে টয়লেট বা বাথরুমে অতিরিক্ত সময় ব্যয় করছেন?",
            "আপনি কি আপনার প্রিয় মানুষটিকে নিয়ে বাজে স্বপ্ন দেখছেন? যা আপনাকে ভীত করছে?",
            "আপনার কানে কি ফিস ফিস করে শোনা যাচ্ছে আপনি কুফরের দিকে ধাবিত হচ্ছেন (কুফরি করছেন)?",
            "আপনি কি ওযু-গোসল বা ইস্তিঞ্জার সময় এক অঙ্গ বারবার ধুচ্ছেন? তবুও মনে হচ্ছে ধোয়া হয়নি ঠিকমতো..",
            "আপনার বারবার মনে হচ্ছে যে, ওযু ভেঙ্গে যাচ্ছে? মনে হচ্ছে প্রসাবের ফোঁটা পড়ছে, অথবা সবসময় মনে হচ্ছে বায়ু বের হয়ে যাচ্ছে? কিন্তু আপনি নিশ্চিত হতে পারছেন না?",
            "আল্লাহ, রাসুল অথবা ঈমানের ব্যাপারে, ইসলামের মৌলিক ব্যাপারে অবমাননাকর চিন্তা মাথায় আসে?",
            "মুরব্বি, উস্তায বা বয়োজ্যেষ্ঠদের সামনে বসলে, তাদের সাথে কথা বলতে লাগলে কি আপনার ভেতর থেকে কেউ বারবার বেয়াদবির জন্য উস্কে দিতে চায়?",
            "আপনি কি কোন অদ্ভুত শব্দ কণ্ঠ শুনতে পাচ্ছেন? কারো সাথে এটা নিয়ে আলোচনা করলে ভাবছে, আপনি প্যারানয়েড বা পাগল হয়ে যাচ্ছেন?",
            "আপনি কি নামাজের রাকাত ভুলে যাচ্ছেন? অথবা অন্য আরকানগুলোর ব্যাপারে ভুল হচ্ছে? সাজদাহ একটা দিয়েছেন না দুইটা দিয়েছেন সন্দেহ লাগছে?",
            "নামাজে সাজদা করতে গেলে মনের মধ্যে বিভিন্ন অশ্লীল ছবি কিংবা দেবদেবীর মুর্তি ভেসে উঠছে? ",
            "মাথায় বিক্ষিপ্ত চিন্তা ঘোরাঘুরি করার কারণে দৈনন্দিনের কাজ, সালাত, ইবাদত, যিকির, তিলাওয়াত ইত্যাদিতে মন বসছে না?"

    };
    public static int waswasValue[][]={
            {8,0,6,0},
            {7,0,6,0},
            {10,0,7,0},
            {10,0,7,0},
            {10,0,8,0},
            {8,0,6,0},
            {9,0,7,0},
            {9,0,7,0},
            {9,0,8,0},
            {10,0,9,0},
            {10,0,8,0},
            {9,0,8,0},
            {9,0,7,0},
            {10,0,10,0},
            {7,0,6,0}
    };

    /*private String mChoices [][] = {
            {"হ্যাঁ", "না", "মাঝে মাঝে","বলতে পারছিনা"},
            {"হ্যাঁ", "না", "মাঝে মাঝে","বলতে পারছিনা"},
            {"হ্যাঁ", "না", "মাঝে মাঝে","বলতে পারছিনা"},
            {"হ্যাঁ", "না", "মাঝে মাঝে","বলতে পারছিনা"},
            {"হ্যাঁ", "না", "মাঝে মাঝে","বলতে পারছিনা"},
            {"হ্যাঁ", "না", "মাঝে মাঝে","বলতে পারছিনা"},
            {"হ্যাঁ", "না", "মাঝে মাঝে","বলতে পারছিনা"},
            {"হ্যাঁ", "না", "মাঝে মাঝে","বলতে পারছিনা"}
    };*/

    /*public CharSequence getmQuestions(int a) {
        String question = mQuestions[a];
        return question;
    }

    public int getChoiceValueYes(int a){
        return choiceValue[a][0];
    }

    public int getChoiceValueNo(int a){
        return choiceValue[a][1];
    }

    public int getChoiceValueSometimes(int a){
        return choiceValue[a][2];
    }

    public int getChoiceValueDontKnow(int a){
        return choiceValue[a][3];

    }*/
}
